[{"body": "Many Carbon haters say we have to preserve the future for the children, my concern is a future where the only energy capable of delivering lifestyles like we enjoy today will be so regulated and taxed that only the future children of the rich will benefit. ", "score": 0}, {"body": "Too bad the coal industry is bent on spending so much money defending pollution; it would be better spent on finding a way to make coal safe for humans and the planet.", "score": 2}, {"body": "or simply make miners safer in their work.  If Chile can do it, why cannot we?", "score": 2}, {"body": "Insanity is continuing to do the same thing and expecting a different result.  We continually let big business rob our natural resources without replenishing them.  There should be a tax on this.  Instead, Nevada has it written into its Constitution that mining taxes be limited to a very low amount. We should also be taxing the polution of our air and water.  This should be a cost of doing business.", "score": 3}, {"body": "So they're basically arguing whether to let more carbon and carcinogens into the atmosphere and water. Our economic model is bad for the biosphere b/c destructive habits (tar sands, fracking) are often very good for GDP. We need a new vision where long-term health and well-being of all living things is actually rewarded, so that high school teachers, scientists, park rangers, and people who take care of their dying parents don't have to struggle financially. ", "score": 3}, {"body": "The issue should not be the fight to use coal as a energy source: the fight should be to EVOLVE coal into a clean energy source. The potential is for an energy source with the power of the sun but greedy little minds want to actually BURN it..... worthless. Those who wish fast-profiteering at the expense of the world, will use every dirty, legal loophole/trick in order to make their billions while the rest of us suffer the consequences. Good thing I'm not president....", "score": 3}, {"body": "We have a clear threat to the future of the human race, and it is most difficult that it is tied to the energy we require to do almost everything. Baked into the cake is about 15 meters of sea level rise, perhaps in 200 years but more likely a bit longer.  By the end of the century, somewhere well over a foot but more likely 3 to 5 feet, there is some question about that.  People say we can't do a thing until we are absolutely certain, but science doesn't work that way.  We have an increase in extreme precipitation events, floods, wildfires, a threat to our water and food supplies. So plans are being made to begin to address some of the problem, and a bunch of political operatives and with a well oiled industry-funded PR machine putting short-term thinking and profits ahead of reality want to kill it.  They seem to think that politics trumps nature. At some point, people are need to question the conspiracy stuff going around about how its all about stealing your money and getting one world government, and realize the conspiracy of ignorance is not going to help them as consequences come down the pike. I hope the justice system is not so political that advantage can be taken. But more than anything, we need to get it straight what is really dangerous to us. What is wrong with clean energy and working to make it happen?  Why is it impossible to do the smallest thing until we have a perfect understanding?  The threats are obvious enough.", "score": 6}, {"body": "It's time for the energy companies to move to cleaner forms of generation. Whatever happened to American innovation? The federal government is prepared to subsidize the move to cleaner energy - why don't the energy companies take advantage of that and start hiring people to make the transition?", "score": 2}, {"body": "This is a typical nullification premise that denies federal power to amplify and interpret regulations that proceed from laws concerned with promoting the health and welfare of all Americans.   The regulations in place are determined to discourage a bunch of coal burning square states from poisoning the air of their neighbors with carcinogens and greenhouse gases because ''it's cheaper and better  for the states burning coal to generate power.''   Maybe if the coal state PAID THE TRUE COST  of burning coal CLEANLY WITHOUT ADVERSE ENVIRONMENTAL IMPACT, it would NOT BE A CHEAPER ALTERNATIVE FOR THEM.    In other words, maybe the coal industry would be forced to admit what science has known for a century.   We are still cleaning up from coal tar gasification schemes dating back 100 years.  Why let an industry that has always been a symbol of careless greed pay off a few lawyers and politicians to get its way . . . Oh, that's right ''Citizen's United.''  ", "score": 11}, {"body": "Let's hope the Court injects some job-saving sanity into the outlaw renegade pseudoscientific hysteria that is personified by these inane regulations ", "score": 0}, {"body": "There are plenty of good, well-paying and long-term jobs to be had in the renewable energy sector. It's simply a matter of migrating to a new economy. http://m.bizjournals.com/denver/blog/earth_to_power/2015/04/colorado-no-... And the only \"inane\" regulations are on the part of foot-dragging luddites who can't see the future in front of their eyes: http://www.morrowcountysentinel.com/news/news/152533657/Research:-Ohio-e... I'm sure there were plenty of horse farmers who were unhappy when Henry Ford came around, and plenty of cowboys and ranch-hands had to find jobs as steel workers, machinists and mechanics. The way to save jobs is to transition to the new economy and create ways to ease the transition for the workers coming from dying industries like coal.", "score": 7}, {"body": "I'm all for those states and companies that want to burn coal to keep doing so - as long as they keep all the polluted air and water generated inside their states.  But how dare they think they can pollute as they wish when I have to suffer the consequences.  Who's freedom is at stake here?", "score": 7}, {"body": "Whatever happened to the \"promise\" of \"clean\" coal? Where is the promised R and D funding for the development of truly safe and clean coal? Just has the hopes of the research safety car development was smashed into smithereens at the start of the Republican Reagan administration, we have seen the closing of demonstration \"clean coal\" plants shut down one by one into oblivion! Big tobacco knew of means that could be  used to develop a truly safe tobacco product, but demurred over fear of lawsuits. The big tobacco executives knew of the dangers of their products, as was evidenced in the book \"The Gilded Cage\" in that all of them quit smoking! The priced paid was severe financial loss through lawsuits. Once a \"regime change\" that is badly needed with the Supreme Court, big coal will finally suffer the same fate!", "score": 1}, {"body": "There is no such thing as \"clean\" coal. That was just a ruse to buy the coal companies more time.", "score": 7}, {"body": "\"Clean coal\" refers to removing the sulfur in the mined coal.  There is no process that will stop burned coal from producing CO2 (or CO if oxygen depleted).  Basic chemistry at work.  ", "score": 0}, {"body": "Democrats are clueless.  This single regulation is going to more than double electric costs which effects EVERYTHING.  I am so tired of \"do gooders\" finding problems where none exists.  Yes Margaret, the air is getting cleaner not dirtier - at least until the next volcanic eruption.", "score": 0}, {"body": "Coal power plant emissions are roughly the equivalent of a 911 event every four months (about 10,000 deaths per year:  http://www.edf.org/sites/default/files/9553_coal-plants-health-impacts.pdf) .  I'd say that constitutes a problem.", "score": 5}, {"body": "\"Double\"? Based on what? Please cite your sources. All of the latest data from industry shows both solar and wind being more than price competitive with traditional sources of power generation. The warming planet is a problem that exists. And if you want to worry about rising energy costs, think about how much your bill is going to be when the average summer time temperatures will the higher than the hottest summer temperatures we've been accustomed to. Climate change exists and it's effecting EVERYTHING. NOW.", "score": 9}, {"body": "You can breathe contaminated air and risk global warming or you can pay more for electricity (maybe) ... your choice. ", "score": 0}, {"body": "I don't get how people can not understand that coal burning is bad news? And that any way  we can clean up our 'act ' will set not just a national but an international precedent. While the court can debate the constitutionality of this; isn't the bigger issue of the long term impact of coal burning plus it's laboriously slow process to rectify it's use the greater concern? ", "score": 1}, {"body": "Maybe you'll get it when the coal generated plants drop off line and you wake up one morning, with n lights, no heat and no water. The government makes its rules and regulations without any forethought as to how to replace what is currently in use. These plants are already heavily regulated, including the rates you pay - put another way, let's say you were making 100k a year and you did that using all of the resources you have at hand - now the government tells you that you have to do the same job with one hand tied behind your back. Governmental thinking and common sense are not synonymous. ", "score": 0}, {"body": "The big fly in the ointment of many problems facing your country today rest in the ill considered Citizens United decision. Until that is reversed the fight for clean air, fair voting, financial reform will be a steep uphill battle.", "score": 2}, {"body": "Nice try ... but faulty logic.  There is plenty of power generated by natural gas fired and nuclear plants and by wind and solar power facilities.  Most coal fired plants can easily be converted to natural gas, which is far less polluting than coal.  ", "score": 1}, {"body": "Do the coal interest's legal arguments include the little detail that they've been getting their collective butts kicked in the power generation market here by natural gas generation? War on coal?  Natural gas has been winning it.", "score": 3}, {"body": "Natural gas is better, but still quite polluting.", "score": 3}, {"body": "Hi, bmack.  Yes, even when done properly natural gas is simple the lesser of two evils.   My comment was based on the complaints by McConnell and others that coal's problems are all somehow due to the President.   He didn't perfect horizontal drilling and fracking!", "score": 1}, {"body": "The question before the court is whether to intervene to block a rule which will impact the profits of the coal producers and coal users, and possibly provide an alleged benefit in reducing future global climate change. Put another way, if the rule is allowed the profits of these producers go down now, and future costs to society may go down as lesser impacts of climate change occur. But those profits will never come back, and they come out of the pockets of the 'people' sueing now, while any future costs can be socialized as taxpayers at large pay for levees, disaster relief, higher food prices, and the world as a whole suffers unmonetary loss by extinctions due to species which cannot cope with habitat reductions and encroachments of migrating other species forced to move by climate changes in their former home ranges. So the costs are unquantifiable and in the future, or the lost profits are now. The question before the court is some specific profits now or possible lower costs and impacts for all in the future. Who wants to bet how that one will come out? In the USA today, money talks.", "score": 3}, {"body": "It's time to end transfer payments from the blue states to the red coal producing states.", "score": 10}, {"body": "You really need to do your research and not simply rely on \"feelings\" to simply justify your position on the EPA action.  The overall cost benefit of these proposed rules.   Per the WSJ an analysis of the proposed rule changes stated:   \"The EPA concluded that costs weren’t a relevant consideration. It conducted an analysis estimating the costs to be $9.6 billion annually while valuing the public-health improvements between $37 billion and $90 billion, mostly through a reduction in premature deaths. The EPA reached those numbers by measuring “co-benefits” of the emission controls, which will filter other pollutants in addition to mercury and related toxics. A group of 21 states, including ones that rely heavily on coal for electricity, and industry groups challenged EPA’s approach. The states in a court brief argued Congress “did not intend for EPA to act with deliberate indifference to cost when answering the basic regulatory question whether it is appropriate to regulate.” The states said the health benefits of the regulations, when focused specifically on mercury reductions, were just $4 million to $6 million a year.\" You have to consider the cost of the rule before it is implemented.  This the EPA has failed to do or to justify.", "score": 2}, {"body": "Imagine that, coal producing states downgrade the health effects of using coal to produce electricity. Next you will be telling me that born agains are vehemently opposed to abortion.", "score": 0}, {"body": "It's time to turn out the lights, shut off the digital devices, park the car, and plant a garden. Those who aren't doing these simple things are part of the problem. If you care about your grandchildren, why are you pointing fingers instead of doing your part?", "score": 2}, {"body": "Let's have a huge project like locking up the American Indians in Reservations. They are a country within a country, is'nt it? Similarly lets herd all the climate-change deniers and non-believers, for whom the Earth is 6000 years old into the very fine State of Virginia. They can have their freedom to form their own environmental policy so that they can mine the coal to their heart's content, breathe the wonderful, acrid filthy air, drink excellent water from their polluted water sources and grow crops in their beautiful black, charred landscape. Just like the American Indians we should leave them to their own devices. The rest of this really beautiful country can stay pristine having discovered alternate sources of clean energy. Alas! the one great problem would be to demarcate and isolate their air-space which would be contiguous with ours. But maybe, we could build a bubble around Virginia? Just thinking, just saying.  ", "score": 6}, {"body": "Think that you mean West Virginia. Or, as John Denver wrote, Almost heaven ...\" ", "score": 0}, {"body": "What's the problem?  America is all about money.  So why should we care about kids getting asthma, or the world getting polluted by this filth?  Both issues, and others, create opportunities for companies to develop solutions to these problems that they can sell to people and make more money.  And thereby enable us to live in the sewer that we are creating. We should be grateful for full employment in Koch-type companies and the opportunity to support a fully capitalist system that cares only about making money for the rich. And not to worry, unlike the fools who run these companies, Darwin will have the last word when the human race perishes in its own stupidity.", "score": 6}, {"body": "The earth may survive this. We humans won't, unless we learn to change rather than keep bucking it.", "score": 2}, {"body": "The only viable alternative to coal is nuclear power. Until liberals admit this and provide support for nuclear power they are in denial about the science of energy production and cost. ", "score": 2}, {"body": "\"Liberals\" don't have to admit any such thing. Solar and Wind are now more than competitive with traditional forms of power generation at utility scales: Bloomberg:  http://goo.gl/0U8Anc Motley Fool:  http://goo.gl/OxJa81 Solar and wind are more than \"viable\". All that remains is the will and capital to make it happen.", "score": 3}, {"body": "Nuclear power produces extremely toxic radioactive waste for which there is no acceptable means of disposal. Can't we learn from Fukushima and Chernobyl - or from the near disaster in my home state of Pennsylvania, Three Mile Island?", "score": 2}, {"body": "Nuclear waste can be processed to recover fissionable fuel, and then bombarded with fast neutrons to eliminate some of the higher activity radioisotopes (the Integral Fast Reactor was one method of doing this). The resulting material can be vitrified for long-term storage. The Fukushima disaster was largely due to poor location of the emergency generators for the cooling systems; if the generators hadn't failed because they were underwater, nothing out of the ordinary would have happened. The Three Mile Island accident was largely due to human error, as was Chernobyl (the Chernobyl design also had flaws, but the operators didn't follow their own procedures resulting in the prompt criticality of the reactor). The latest generation nuclear reactor designs are extremely safe, and I would much rather live next to a nuclear power plant than a coal power plant.", "score": 0}, {"body": "I am sad to say that I no longer have any hope whatsoever that humanity will be able to deal with this problem. We are simply too short-sighted, too flawed, too arrogant, and frankly too stupid. It won't affect me that much, but I really feel for my children. ", "score": 6}, {"body": "Coal has made war on public health and the environment for more than a century.  It's time we fight back.", "score": 16}, {"body": "We know that burning fossils fuels alters our climate. We know it changes the concentration of greenhouse gases in out atmosphere. This causes more infrared heat to be absorbed in the atmosphere warming our planet. We know so much about climate change and the global warming we have caused. We need coal companies to transition and move forward. They should be investing and adding to their product lines through renewable energy efforts. Not living in a past we know is problematic for this generation and for those yet to inhabit the Earth. If our human race is to endure on this planet we have to shift away from burning fossil fuels and as a result of that burning changing our atmosphere and climate for worse.", "score": 10}, {"body": "You are so, so right in every way!", "score": 0}, {"body": "If we were smart we'd be actively involved in replacing oil and gas with renewable energy, as other countries are doing. This should be an endeavor that the whole country is proudly in-progress on, not still arguing about thinking about it. It's positively shameful that we're so behind. This is the biggest issue we face as a country and most of the government has its head in the sand.  Renewable energy is an untapped industry that will employ many if we give it a chance. You're worried about coal miners losing their jobs? I don't remember worrying about factory workers when manufacturing disappeared, it was a business decision. We didn't mind when white collar jobs moved to India. That was a business decision. This is pure politics, and money. I really wonder what my grandkids are going to be left with. ", "score": 16}, {"body": "Perfectly put. ", "score": 3}, {"body": "Don't say most of government has its head in the sand - it is only one political party.  If any republican so much as hints at his belief in climate change he can kiss his political career goodbye.  How must we look to the rest of the world?", "score": 4}, {"body": "It's quite telling that Obama's \"signature environmental achievement\" is an executive action, not a law.  In fact, other than Obamacare, which was rammed though congress with a number of dubious parliamentary procedures, Obama's entire legacy would evaporate in the face of a Republican president.  I guess that's what happens when you rule by fiat without regard to the quaint notion of separation of powers.", "score": 3}, {"body": "It is quite telling.  It tells us how Republicans' main priority has not been doing what is good for the country. but rather stopping anything that the President is for, even if they used to be for it.  Their secondary priority, do what puts more money and power in the pockets of the Koch Brothers, Sheldon Adelson, and the other big-money raiders, even if it results in disastrous climate change, sickness and disease, dirty air, dirty water, income inequality, or even war. ", "score": 13}, {"body": "Who told you that a regulation is not a law? Congress enacts statutes, like the Clean Air Act, in which it delegates rulemaking authority to an agency like the EPA to issue implementing regulations. This is what the CAA states: \"The Administrator [of the EPA] may promulgate such regulations as may be reasonably necessary to carry out the purpose of this subsection.\" A regulation issued by a federal agency under the procedures of the Administrative Procedure Act has the force of law. Chevron U.S.A., Inc. v. Natural Resources Defense Council, Inc., 467 U.S. 837 (1984).  Your comment has no legal basis.", "score": 10}, {"body": "blah blah blah rammed through blah blah blah.  If the tactics were really dubious, republicans would have been fighting them from the get-go.  And if it wasn't for republicans filibustering EVERYTHING it would have passed easily.  As to \"rammed through\" it passed the House, the Senate, the President signed it into law and it was upheld by a very conservative Supreme Court.  It used to be if something got 51 votes in the Senate, it passed, McConnell forcing 60 votes for everything is just outrageous and we need to get rid of the filibuster.", "score": 4}, {"body": "I would support a law requiring the principals of every coal-burning company to hook up their plant chimneys to exhaust into their homes.  What's good for the rest of us should be even better for them in a more concentrated dose.", "score": 7}, {"body": "I personally think that this proposition is a great to to creating a better environment in which all of human kind can live in and be safe from climate disorders.", "score": 4}, {"body": "a great step", "score": 0}, {"body": "For the EPA to propose rules regarding climate change is presumptious, as the science behind the claims is still up for debate amomgst the scientific community. Perhaps the administration shoild allow the expert research to run it's full course as he does with the Keyston XL pipeline.", "score": 2}, {"body": "Well said, limarchar.", "score": 0}, {"body": "What?!  There is NO scientific debate.  97% of scientists have confirmed that climate change exists and it is man-made.  There have been over 10,000 peer-reviewed studies confirming this with 3% disagreeing with the results. If 97 doctors said you had cancer and 3 said it was just the flu - who would you believe?", "score": 3}, {"body": "The debate is long over in the scientific community. That delaying tactic has caused enough damage. Its time to marginalize and ignore the deniers", "score": 3}, {"body": "I support a regulation that requires polluters to ADD non-harmful but visible particulate pollutants to their emission streams in proportion to their CO2 emissions.  This would localize the impact of emissions.  Possibly a local impact would motivate polluters to stop fighting emissions cuts.", "score": 7}, {"body": "It will be fun to see the smoke billowing out of your tailpipe.  If you are driving an electric vehicle, there will be a complicated formula for determining how much particulate matter you are require to emit, in proportion to the fuel mix used to deliver electricity to charge your battery.", "score": 2}, {"body": "This is another blatant violation of the constitution by Obama.  Congress has already refused to pass  legislation he proposed that would shut down the coal industry. Obama is now trying circumvent the law by using the EPA which is run by officials that were appointed by Obama.   The supreme court is the only entity preventing Obama from destroying the constitution and taking away our freedom.  ", "score": 2}, {"body": "The Supreme Court has already ruled that CO2 can be regulated under the Clean Air Act. The EPA enforces the provisions of the CAA under law passed by Congress. How, then, is this proposed rule a violation of the Constitution?", "score": 13}, {"body": "What section of the Constitution do you believe is being violated?", "score": 13}, {"body": "That a relatively small number of lost jobs and temporary increases in electricity costs could stand in the way of meaningful steps to mitigate the most dangerous building disaster humanity faces is just plain embarrassing.", "score": 16}, {"body": "The increases in electricity costs are not temporary, they are permanent, substantial, and do not make a measurable reduction in the amount of carbon dioxide in the atmosphere.  The number of job losses associated with reductions in use of fossil fuels is not \"relatively small\". Ask a climate scientist to explain to you how much more worldwide carbon dioxide will be in the atmosphere in 2030 after all US coal fired electricity generators have been shut down.  There will be three to five times as much carbon dioxide. You are like the frog in the pot of warm water with a fire below.  By the time the water is boiling it will be too late for you.  You are content with others losing their jobs, because it won't affect you in one of the highest cost electricity markets in the US, and it won't affect your utility cost, because your state has already de facto established a state carbon tax. It won't be until rolling blackouts affect you that you will realize that you are also affected by the burden of regulations that have no positive environmental benefits.", "score": 0}, {"body": "Yet the court decided to hear the case BEFORE the rule was proposed? Is this the ongoing \"logic\" of the GOP \"judges?\"", "score": 7}, {"body": "I wish the first paragraph was not written as it was.   I think the trouble is that reasonable yet non-activist centrists can be on board that we should do less to harm the environment because we can.  ...But they don't believe that the U.S. going it alone will have any impact on slowing climate change. Change is inevitable and climate change is constant. That is... any discussion that starts with a premise that it was ever at a stand still until evil-doing American industrialists ruined the world is as foolish as any denial of the science that shows climate change. ...And when the discussion leaves the realm of scientific discovery and enters into a discussion of \"my politics versus yours,\" you can forget garnering popular political support from the middle. This is why Al Gore's crusade to make people aware may have done more harm than good.   Likewise, when the discussion of admissible science versus inadmissible is determined in a court room, \"winning\" and \"losing\" the courtroom argument take precedence over the content of the actual science. --- What we should be asking is what we can do (to help the environment) and then promote compliance as opposed to mandated (dictated) regulation backed by punitive authority. Give valuable tax breaks and credits, and favorable contracts to clean energy producers. You only earn the credits if you comply, and you'll have a harder time getting contracts or doing business if you don't.   Make it profitable to think positive.", "score": 2}, {"body": "Do you think we haven't tried that?!  Congress refuses to give credits to clean energy companies as republicans deny climate change and do the bidding of the fossil fuel industry.  We have been talking about climate change for decades with nothing getting done.  Mandating is all that's left and must be done.  We have already seen catastrophic results from our do-nothingness.  Maybe you should watch Al Gore's An Inconvenient Truth - a very sobering documentary.  That was 10 years ago during which time we've done nothing.", "score": 0}, {"body": "This is not so much a legal struggle as a test of whether our courts have become as nakedly corrupt as Congress and statehouses. Maybe the judges will surprise us, and allow the federal government to slow the emissions of polluting and greenhouse gas trapping coal burning emissions. If not, it will be very difficult to feel hopeful about the future.", "score": 17}, {"body": "I'm afraid the \"nakedly corrupt\" ship has already passed.", "score": 0}, {"body": "As the fossil fuel industry breaths it last few gasps, let us not mourn, what is there to grieve over ? Polluted water, air, acid rain? Mountain top removal? The industry employs what a 100,000 people? How many more deaths would doing nothing cause?  There is no such thing as clean coal.", "score": 14}, {"body": "And in thinking about the headline: Obama's effort to slow climate change.  The climate changes each minute (and even television weather people can't predict with accuracy what it will be next week). How can change be slowed?  This is as non-sensicalmas the entire political takeover of the energy, automotive, finance and construction industries. Check the service we get from the USPS, AMTRAK, IRS, and politicians, and you'll get that same sub-basement level of service when the government runs the world of American business. Http://www.periodictablet.com", "score": 1}, {"body": "No one has said climate was constant until Man ca me along, started burning stuff, and now it is changing.  What is unique in our epoch is the rate of change.  And the rate of change is quite large, and promises to get much larger as positive feedback loops - rotting tundra, for example - come into play. Evidence that the rapid change in atmospheric and oceanic  carbon is anthropogenic lies in isotope ratios.  If climate change is anthropogenic, then yes we can, if we're quick about it, slow the change.   Unfortunately we are, as a species, easily persuaded of what we want to believe,  and vested interests are happy to do the oersuading.  People are persuaded by simple but erroneous non-arguments like \"...climate is changing all the time\".", "score": 0}, {"body": "If the energy industry had to correct all the damage they have done to all life forms and the planet they would be out of business immediately.  No individual would ever be allowed such a grievous lack of responsibility.", "score": 10}, {"body": "Maybe Obama should say that Global Warming has been solved.  Given the oppositional way the GOP has behaved I'd bet almost anything that they'd go to court to force him to do something like order the EPA to do just what it's trying to do.", "score": 11}, {"body": "The Court should keep in mind that the particulate matter from the burning of coal in power plants kills over 10,000 Americans each year and poisons the rest of us with mercury, arsenic, and other heavy metals.  Coal also is the main source of CO2.", "score": 11}, {"body": "...and yet, somehow, our population numbers continue to rise.  Far be it for me to attempt to directly tie our massive carbon footprint to our massive overpopulation, but the numbers don't lie.  There were approximately 200 million indigenous people living in the Americas before Columbus arrived.  We now have over 300 million people living in just one sliver of the two continents known as the United States.  In order to slow down the impact of overpopulation, one might suggest returning to a population density more like pre-Columbian America.  Good luck sorting that one out in the court room...", "score": 1}, {"body": "Only a delusional person, (mostly men) would be against measure to reduce air pollution. Or those with selfish financial interests. Kudos to Obama for caring enough to do something about the toxic soup with live in.", "score": 12}, {"body": "As someone wicked liberal,  I choke when admitting that Congress in no way authorized the EPA to do this, and their action is simply not permitted by this statute.  I'm doubtful on the issue of whether the Executive Branch possesses this power:  however; I'm certain the Legislative Branch does, positive the Legislative Branch won't, and fairly comfortable in saying the Executive Branch therefore shouldn't.   If we want a Congress that will authorize this, we have to elect that Congress ... and in the meantime,  stop acting like congressional Republicans by asserting unconstitutional powers that will bring us all to ruin.", "score": 3}, {"body": "The non-science, political litmus-test of global cooling, then global warming, now climate change which is unarguably true (right here in Seattle an hour ago it was cloudy, now it has changed to sunshine) is nothing more than another industrial takeover of the formerly-private sector by the anti-business Obama administration.  No LiberalProgressiveDemocrat seems to understand that taking away coal will damage poor people in our country.  Their life-sustaining heat will be too costly and there is not enough sun and wind energy to substitute.  It is so confusing to me: we hurt those in or near poverty to save us something projected 25 or 100 years away.  LPDs have no confidence in \"We the People\" to invent something when the profits to do so become large enough. You don't trust us.  Projections of climate anyway are so complex that humans can't even understand all the variables.  Hopefully the Supreme Court can save us from those saying they are saving us. Http://www.periodictablet.com", "score": 1}, {"body": "You cite the weather outside your home as \"proof\" of climate change? You do understand that \"weather\" and \"climate\" are two different things, don't you? You dress for the weather; you design and build your house for the climate. You also state that \"taking away coal will damage poor people in our country\". Once again, you are mistaken. The poor are the least equipped to deal with the effects of rising oceans, more severe weather phenomena and more frequent and extreme droughts and floods. They're more deeply impacted by rising food prices, housing costs, healthcare costs and social instability that the effects of climate change impose on civilization. You also state that \"there is not enough sun and wind energy to substitute\" for the fossil fuel generated energy we consume and that it \"will be too costly\". Again, you're mistaken and living in the past. Look at recent industry data: http://www.fool.com/investing/general/2015/04/11/coal-is-dead-its-time-t... http://www.bloomberg.com/news/articles/2015-04-14/fossil-fuels-just-lost... Solar and wind are more than cost competitive, they're often cost-*advantageous* versus coal and even natural gas. The only thing standing between us and a fossil-free, sustainable energy future is the will to build out the necessary generating capacity, and that massive build out would create thousands of jobs. Who is lacking confidence in \"We the People\" now?", "score": 8}, {"body": "Had the politicians not denied our polluting problem years ago when the government figured out we were causing climate change and acted on it then, we would probably have coal replaced by now. But, as long as there are big bucks involved, the planet sucks hind tit, since those involved, know that the bad stuff will occur after they are dead. Strange that they care nothing about their great grand children and beyond. ", "score": 5}, {"body": "C'mon. It doesn't take an Antonin Scalia to tell you that the original intent of the Founding Fathers was that, in the interests of \"a more perfect union\" it is of course acceptable that a handful of corporate interests be able to sabotage the common good -- which thinks that is is in its interests, and its childrens' childrens' interests, not to have to wear face masks to screen out the pollution or to move to Canada to escape the worst effects of global warming -- and require us all to find another way to block pollution and global warming because, well, because Mitch McConnell and Rand Paul want to continue to be reelected. I can't imagine any sensible judge, even a Democrat, not accepting the overwhelming probity of this argument.", "score": 8}, {"body": "\"...President Obama’s most far-reaching regulation to slow climate change.\" Really? And how, exactly, will restricting 'carbon pollution' from US coal-fired power plants 'slow climate change'? What impact on 'climate change' will that have, and when?  And what 'cleaner forms of energy' will replace these coal-fired plants? So much assumed- 'slow climate change'- with so little real data to support the assumptions. But that is the point, isn't it? If people understood what little impact any regulations will have on 'climate change', and the very real economic costs of these regulations, there would be little support for the EPA regulations. A tip: when you hear 'climate change' without any data mentioning actual impact on climate, treat the rest of the story as an opinion piece because that is what it is.", "score": 5}, {"body": "Tom: comparing the air quality issues in Beijing with the proposed EPA regs in US is apples and oranges. Even the EPA doesn't argue that existing plants do not meet air quality standards as previously understood. It is classifying carbon as a pollutant in and of itself that is the issue. As to data, please share: timing and extent of 'slowing of climate change', and costs to achieve. Thank you.", "score": 2}, {"body": "I have looked at the data, which increasingly indicate the hypothesis of catastrophic global warming to be highly unlikely, and I have also been to Beijing.  Although the air in Beijing is certainly polluted and hard to breathe, the CO2 component has nothing whatsoever to do with that.  If anything, increased levels of CO2 should lead to an increase in plant life around the capital, which will make it at least very slightly more livable.  You, and the many other CO2-obsessed people posting here, are tilting at windmills.", "score": 2}, {"body": "We're not tilting AT windmills; we're tilting WITH windmills.", "score": 0}, {"body": "What am I missing? Didn't the Supreme Court already rule that the EPA could regulate greenhouse gases. From NY Times, 6/23/14: \"In a part of the ruling decided by a 7-to-2 vote, the court said the E.P.A. could regulate sources of greenhouse gases as long as they would already need permits for emitting conventional pollutants.\" Even Justices Scalia and Thomas ruled in favor of the EPA. Why does this case not fall under that ruling?", "score": 8}, {"body": "The gall, and the greed of Corporate Coal knows no bounds.  When, in the course of \"human\" events, money becomes more important than clean air, or the good health of future generations, we, and this Planet, are truly doomed. How can Peabody \"Energy\" look itself in the mirror?  What blind excuse do they have for forcing all of us to keep drinking their poison? Any hope for our grandchildren is being murdered right in front of us.  What hope?  \"Mr. Peabody's coal train just hauled it away ...\"", "score": 4}, {"body": "Haven't heard that song in years; thanks for the reminder!", "score": 1}, {"body": "No matter what the judges, politicians, theologians, media pundits and business persons think about climate change and  American environmental ecological reality neither physics nor chemistry nor biology nor geology nor oceanography nor meteorology nor astronomy nor mathematics aka science care or notice.  Nor do the Sun, Moon, Jupiter, Earth, stars or Milky Way care about coal companies.", "score": 2}, {"body": "Which 13 states are backing the Obama's administration's proposal? Does anyone know?", "score": 1}, {"body": "All the sane ones.", "score": 4}, {"body": "I think President Obama should speak to the environmentalists in California that are letting good drinking water literally go down the drain and into the ocean so that fish have cleaner water or some such idiocy while the state is under severe drought conditions.  The E.P.A wacko types have prevented dams and storage facilities for rain water and melting snow to be used for people's needs. PS: If California wants help with their drought tell them to ask the people who caused the problem to solve it with their money.", "score": 1}, {"body": "Maybe fishes are part of an ecosystem where every organism (including humans) depends on natural journey of another organism.", "score": 3}, {"body": "The Sacramento River needs sufficient flow to prevent ocean water from backing up into the Delta irrigation intakes.  So there's that.", "score": 3}, {"body": "Are you saying we shouldn't keep our streams and rivers free of pollutants? And for those who talk about money, there is a fishing industry here that is strangling here due to blocking salmon runs and polluted waters.", "score": 1}, {"body": "The science tells us that climate change is being greatly accelerated by the carbon gases produced by human activities and reducing them a lot can eventually reduce the rate of change but over decades. The sensible strategy is to replace the old fossil fuel plants with ones that reduce carbon gas effluents. The economic costs of doing nothing could be ruinous and use upon so much of the wealth we create that it might be impossible to continue living in the technologically advanced ways that we do. So who is clueless enough to fight the efforts to control this problem? A lot of people who are making money now and do not wish to spend any of it to make the lives of strangers who are not yet alive as good as their own.", "score": 7}, {"body": "It is of interest to me that when President Obama pushes the limits of executive authority and perhaps goes too far, it is dismissed as \"over reach\". Implying an action something in between inadvertent and perhaps \"nice try but no cigar\" (snicker, snicker....wink, wink).  When a Republican President does the same that President is deemed Imperious or dictatorial or polarizingly partisan. Not to be trusted and of bad character and too arrogant to involve the other side of aisle. ", "score": 1}, {"body": "That's funny. I find it interesting that it's all that hard to tell the diff between forcing us to  torture people and invade Iraq, and using one's Constitional authority to support an EPA regulatory change.", "score": 8}, {"body": "If the Court does take up the issue it won't be the first time it decided to weigh in on a matter of \"clerical error.\"  Isn't that what the ACA case is all about? Since industry groups are getting better at exploiting the possibilities of \"clerical errors,\" Congress needs to get better at writing bills.", "score": 6}, {"body": "This shouldn't be a problem, at least if the industry's commercials are accurate.  After all, don't they produce \"clean coal\"?", "score": 6}, {"body": "Clean oil and clean nuclear reactors will pop up once we run out of 'clean coal'", "score": 0}, {"body": "It's understandable how many of these commentators are for dismissing coal from our lives. Coal is just one pollutant we're dealing with, the other is of course oil. Every time I walk to the store and see someone with a four ton truck driving away with a gallon of milk is quite distressing.", "score": 8}, {"body": "My wagon gets around 41 to the gallon, is far more reliable than your truck, and easily carries a good hard load.  it's also safer to drive.", "score": 1}, {"body": "Air Marshall, you miss the point that while YOU are paying for diesel fuel, while the rest of the population pays for the health costs and environmental consequences of your diesel emissions.  That is the idea behind \"carbon taxes\".  Try to capture ALL of the costs associated with fossil fuel use, not just the costs of fuel production.", "score": 1}, {"body": "Robert and Knobby, I appreciate the civil discourse, enjoy your Subarus and battery operated conveyances. Stay sensible, safer, sustainable, cleaner, greener and happy. ", "score": 0}, {"body": "The sound and fury surrounding government's role in mitigating climate change is a distraction. No matter what the GOP does, they can't reverse the accelerating demand-side momentum toward greater efficiency and minimizing cost. From institutions to individuals, we are cutting our carbon footprints for the simple reason that waste costs money. Where we see it, we stop it. This is nothing but capitalism at work. The Republicans are defending a position that savvy energy users, with their increasing numbers, have abandoned. ", "score": 3}, {"body": "The fact that we are actually talking about fighting, tooth and nail, against policies designed to avoid human extinction is beyond insane. If humanity survives the impending environmental collapse, our society and nation will be remembered as one of the most evil, corrupt and twisted ever to blight the planet.  Also, I'd bet anything that climate change denial comments are published by the NYTimes in the name of presenting a fair and balanced view of the debate. At what point do you stop validating stupidity through the simple act of acknowledgement?  It's not a debate. It's science. The same science that makes your cell phone work, airplanes stay in the sky, and gives you HBO via satellite. Just because you don't know how your microwave works doesn't mean that it's magic or that microwaves don't exist. Could we please, please, please stop framing this as a debate to be had. That's like entertaining the notion of Russian Roulette as an acceptable parlor game, on par with Scrabble.  It's far past time to put the lid back on the jar full of crazy that is popular culture, and to focus on making the changes needed to survive as a species.", "score": 12}, {"body": "There is no rational debate over how greenhouse gasses work, that we're pumping increasingly dangerous amounts of them into the atmosphere, that we've been seeing early effects for some time now, and that we probably oughta do something. Is there reasonable debate over the exact ties between warming and climate, how serious the effects will be, and what we should do? Absolutely. Of course as with evil-lution, with vaccines, what you guys are trying to do is to sucker everybody to TEACH THE CONTROVERSY. That way, we just stand around, and stick the kids and grandkids with the bills.  Sorry, no. Darwin never said we decscended from monkeys and the transitional fossils exist, vaccines are safe and effective and don't cause autism, and we are warming up the planet too much.", "score": 0}, {"body": "I'm willing to concede to the idea that there is a debate about how rapidly climate change is happening and exactly how devastating the impact will be; i.e. do we even have a shot at survival at all. But disputing that human activity is having a devastating impact on the ecosystem is not just hubris, it's absolute folly. I understand science and the scientific process just fine. I understand that at a certain point, other than a few industry-bought, amoral mouthpieces who give science a bad name, there is enough evidence to say that something is real. While gravity might turn off tomorrow, there's a preponderance of evidence that it won't and that it will just keep right on being gravity. That's science. Climate change has been studied enough and tested enough that it's as close to \"true\" as science comes. Denying evidence is denying science. So you're proposing to take reality out of the equation and call it scientific?", "score": 1}, {"body": "Totally incorrect. Even the computer models are way off and have predicted warming which has not occurred. If the science was \"settled\" wouldn't the computer models have been better predictors?????", "score": 0}, {"body": "By all means, yes, let's continue to dither and delay while the problem builds beyond any manageable proportion.  Let's continue to politicize a scientific issue that has already achieved consensus among 99% of relevant scientists around the world (that is, those that are not paid by fossil fuel based interests).  Let's condemn our future generations to lives radically and horrifically disparate from those we've enjoyed.   Our planet burns while we fiddle.", "score": 11}, {"body": "Oh and no warming in over 18years doesn't move you? Also the 99% number you quote is an unmitigated lie but of course if all you read is the times you wouldn't know that.", "score": 0}, {"body": "S Charles - The last report I saw said that the surface temperature of the oceans is now at an all time recorded high. The no warming in 18 years is a product of your imagination.", "score": 6}, {"body": "Wrong, look around and read something other than the times the satellite data which is the most accurate temperature record indicates no warming for at least 18 years. Of course that never appears in the Times,", "score": 0}, {"body": "I think this is an overreach by EPA. Such major changes should be done by a law passed by congress and signed by the president. Congress not agreeing to accept that does not give any authority to EPA to bring such a major change based on a \"rule\". The courts should agree to adjudicate on this, because it is not the rule itself that is being challenged but the authority of EPA to even pass a rule for which congress refused to accept administration's request to pass that bill.", "score": 0}, {"body": "\"...battle over the policy that Mr. Obama hopes to leave as his signature environmental achievement.\" The media has gotten us used to thinking that an issue like this are about the man in the White House seeking a legacy. Maybe Mr. Obama just wants us to stop destroying the planet before it's too late. Maybe it's not about his legacy or signature achievement... and simply about doing the right thing.", "score": 17}, {"body": "West Virginia and all these other states need to move on from coal. I can see an energy company bringing a lawsuit - sure - but a state? What message does that send: Coal company lobbyists and their money, and the health- and environment-wrecking jobs that come with them, are more important than the health and sustainability of their own constituents and millions of other people and indeed, the planet. It's shameful.", "score": 12}, {"body": "“Is industry right that the agency lacks the authority to regulate? The challenge is extremely unusual, since the rule is proposed, and not final,” said Jody Freeman, the director of Harvard University’s environmental law program and a former senior counselor to Mr. Obama. “For a court to entertain that would go against decades and decades of precedent.” But there isnt a controversy properly before it as yet. Not even for declaratory relief. ", "score": 3}, {"body": "Justice may be blind, but it can still feel the money being stuffed into its pockets.", "score": 9}, {"body": "I sympathize with coal miners and the economies that depend on coal. But as with *every* industry that undergoes technological and political shifts, things change. If the industry is smart, they shift to 100% gas: trapping methane and other hydrocarbons to use as a particulate-free substitute in place of coal. If our vision were big enough, the government would subsidize the rise of wind farms and solar fields atop the very mountains that were destroyed by coal removal. It's time to face facts and the winds of change, to adapt or die off, nature red in tooth and claw.", "score": 8}, {"body": "Will somebody ask the Republicans and big business why they want dirty air and water?As them if the lives of Americans. including thier grandchildren's don't count. Ask them if money is really all that matters in their lives.", "score": 12}, {"body": "Any statement suggesting that President Obama himself deliberately seeks to harm West Virginia or any one of its citizens is deliberately inaccurate anger-mongering that seeks to dupe those poor people already duped by the coal industry.  The rank and file members of the coal working community have been undercut by the jobs-eliminating automation brought to the industry by their very employers.  That has been happening for decades, and those families have had every opportunity to have seen it coming and prepare.  Did the barons of the coal industry or the various state governments help them prepare with retraining and education?  Did the barons of the coal industry not know that their form of energy is not indefinitely sustainable?   Surely they have had access to environmental reports since at least 1970's.   Those are the areas where responsibility lies, not with further hits to the global atmosphere.   The latter harms us all for the sake of the few who already have been irresponsible.", "score": 17}, {"body": "This reminds me of the science fiction movies and series that depict a future where the rich and privileged live I domed cities and the rest of us live in poverty to scavenge a polluted environment to survive. Those guys pushing to do away with the EPA regulations so they can make money likely see themselves and their progeny as the privileged class and the rest of us as the outsiders.", "score": 16}, {"body": "There's a small kettle pond in the Cape Cod Nat'l Seashore, near where I live. There's a sign posted along the pathway to this seemingly pristine pond, warning of the water's exceedingly high levels of mercury contamination and to avoid consuming the fish. These signs are posted by our federal gov't. Testing of the kettle ponds through out Cape Cod has proven results of mercury poisoned waters. And it is gradually killing them. We may think we are living in a healthy or clean environment but this fallout of deadly toxins from coal burning pollutes everywhere-including our beautiful backyards.  P.S.-Our oceans aren't loving it much either! ", "score": 13}, {"body": "You may be speaking to a crowd above their level of understanding. Remember those that are against regulating green house gases are climate change deniers' and don't trust science. And, those that support the campaign to continue burning fossil fuels see only dollars and could scarcely care what happens to other people. If it can't be seen, it doesn't exist. ", "score": 7}, {"body": "As I understand it, it is legally possible for a whole industry to destroy and poison a country and get away with it. They get away with it, as money and power rules this country,  abuses this country and is basically on the way to slowly kill this country all under the absurdity of laws written for most part by the companies who are involved. For a long time it had been legally possible for the tobacco industry  to kill people, now there is along list of industries who are fighting to kill even on a bigger scale and the outcome is supposedly in the hands of a few lawyers. Since when has freedom become an argument to kill and since when has the government give them the freedom to kill. Where does it say that in  the Constitution does anybody, any industry has been given the right to be allowed to make enormous amounts of money at the cost of the lives who  people who live in this  country, trying to lead a live that leads to happiness? Have the leaders in Congress gone absolutely crazy, have lawyers sunk so deep that they are willing to defend murderers just for money's sake. Have law schools gone of the deep end as well?", "score": 14}, {"body": "There are two things going on here. First, if Obama is involved, go against it - a continuation of the opposition's strategy to discredit the Presidency and embarrass the President. And secondly, the mind set that says, if money is still to be made, eliminate all opposition and go for it. We've seen that mind set with the tobacco industry that took years to slow down, but is still alive and well. America used to be the country of innovation and progressiveness, but we see ourselves falling behind in just about every front due to Conservative thinking. Climate change is just one more nail in our coffin.", "score": 16}, {"body": "We don't need to abolish the coal industry.  All we need to do is reduce it to the size where we can drag it into the bathroom and drown it in the bathtub. (With a nod to Grover Norquist, who said the same thing about government).", "score": 12}, {"body": "Well, like everybody else here, I have no clue whatsoever but it's Bush's fault.  And, the Republicans.  and Cheney's.  Oh yeh, and corporate America's.  (I buy organic).   ", "score": 1}, {"body": "I hate to have to tell you this, but it's your fault for voting for these guys and letting them have their way.", "score": 11}, {"body": "Considering that the suits are brought by two coal companies and that Republicans have been loudly supporting the suits, whi are we spozed to blame? Elves?", "score": 1}, {"body": "The Obama administration is doing its best to help this country towards a sustainable energy economy despite the obstructive political antics of the GOP. The majority of Americans understand the need for us to keep fossil fuels in the ground.  We support the new EPA rules.  The action by the coal companies is just them fighting for their profits. But the action by the state governments opposing the rules is shameful.  They have a responsibility to lead the people in these industries to a just transition to a safer, cleaner, energy economy.  They also have a responsibility to protect the environment for all the people and they are failing badly in this regard.  The USA will soon be split along energy lines and you will see that the health outcomes for people in GOP states will continue to deteriorate.  This is a legacy of shame for the climate deniers who are bought and paid for by the fossil fuel industries..", "score": 11}, {"body": "Rich CA liberals are now considering to have water flown in to their mansions from other states to get around the water restrictions. Perhaps water delivery service, straight from the streams of West Virginia, could be a new line of work for miners?", "score": 4}, {"body": "Maybe that's not such a good idea.  In January 2014 an above ground storage tank containing a chemical used to process coal leaked into the Kanawha River and contaminated the water supply for more than 300,000 people. The state legislature which had just started its session passed legislation that increased regulations on these tanks. In January 2015 a new body of legislators  - now a Republican majority in both the State House and Senate - gutted what had become law to the point that the tank that leaked one year before is now exempt. Even front page news that on Feb 16 a train derailed and nineteen of the derailed tanker cars containing crude oil leaked and caught fire on the banks of - you guessed it - a tributary of the Kanawha did not deter the business-centric Republicans from putting money before lives and clean water. So, no, \"water delivery service, straight from the streams of West Virginia\" is not a good idea for our miners or anyone.", "score": 3}, {"body": "\"Rich CA liberals\" don't consume 80% of the water in CA. Farmers who grow the food that *you* eat do that, which means *you* and we consume 80% of the water in CA, not \"rich CA liberals\". And WV coal miners don't derive most of the benefit from the coal they mine, so in that sense, your parallels are accurate.", "score": 0}, {"body": "It is insane that this is being fought like this. Carbon is a heat trapping gas. We are increasing the amount we put in the air. Climate change has tectonic long tail black swan risks if a negative feedback loop builds. This is a risk mgmt issue. If it is found that carbon company executives knew the science was closing in on them (like the tobacco boys did) then they should be tried and if found guilty given the ultimate punishment.  ", "score": 8}, {"body": "Just the headline by itself speaks volumes about what a frightening time we live in. What if the headline read: legal battle begins over NIH's efforts to stem increased cases of breast cancer. Or: legal battle begins over efforts to prevent the NHTSB from making cars safer to drive. Or: legal battle begins over efforts to learn why autism is being diagnosed more frequently. The list goes on...", "score": 6}, {"body": "As a break from the hyperbole and hysteria... I recently bought some light bulbs  that had the following characteristics: -excellent light available in different color temperatures -a ten year warranty -$5 each -dimmable, suitable for all fixtures, even damp conditions -One sixth of the energy consumption of conventional incandescents. *One sixth* of the energy consumption, and this is effectively the first mass-production generation of these things. Think about that... better light, way longer life, and a huge chunk of CO2 that doesn't have to be released. It took what, ten years? So no, we will not be freezing in the dark and paying all of our paychecks for energy. Unless you choose to be a White Male Christian Martyr, to reference another of today's articles, out of pettiness and spite.  This is supposed to be the country leading the world in technology, and sadly most of the progress is being promoted by others, while we whine and carp and polish our not-smart guns.", "score": 14}, {"body": "All of this litigation would be irrelevant if Congress would enact a carbon tax.  Such a tax could be gradually increased to ease the burden on the rate payers who now get most or all of their power from coal-fired plants.  Rebates to the taxpayers would also ease the burden on car users, while encouraging the auto industry to make electric and hybrid cars more affordable.   There would some economic hits to coal miners, coal companies, and the oil industry.  But should the rest of us be held hostage to their iron grip on power politics?  West Virginia (and KY, Wyoming, et al): put the gun down.", "score": 56}, {"body": "West Virginia and Kentucky are and have been  badly damaged from  coal mining for decades but it has never made the people who worked the mine healthy, well educated, and prosperous.  Instead. many died of lung disease and accident as a consequence of their dangerous occupation.  These states have never been able to develop alternatives in their economy and remain dependent on the Federal largess to fund many of the programs that aid this population.  Yet, they vote for their own inevitable decline as if guns and states rights and suppression of others matter more than good health, wider opportunity and a future out of the trap they are in.   Montanans tout the beauty of their state but  are politically blind to the environmental damage of their exported coal.  These three states are the fiefdoms of distant power and wealth and nothing in the foreseeable future is going to change that sad truth.", "score": 0}, {"body": "There is a reason why the Democrats did not pass a carbon tax during the 2009-2010 period when they had a majority in the House, a filibuster-proof majority in the Senate, and a Democrat President.   It is the same reason why they did not pass immigration reform.  It is the same reason why they did not pass Medicaid for all instead of Obamacare. The Democrats do not have solutions to any problems.  They know it, and were not willing to pass legislation that would be extremely disliked by an overwhelming proportion of the voting public.  Particularly when it would rapidly become evident that their legislation did not even improve the problems it purported to solve.", "score": 0}, {"body": "Once upon a time the legal system was developed to serve the common good.  It has now been hi-jacked by interests that subvert the common good. ", "score": 13}, {"body": "Mr. Tribe is the disgrace always has been.", "score": 3}, {"body": "This is how progressives erase their own and proceed to rewrite the journal. Inversely, N. Mandela and C. Chavez come to mind.", "score": 1}, {"body": "Yet again, the comments are a progressive tantrum about Republicans, vilifying those who think the law should be enforced and scorning those horribly people in fly-over states. Ignore that the president is using the tactics that Bush pioneered to rule by imperial fiat, and that we on the coasts have bought this, every time we turn on a lightswitch. ", "score": 5}, {"body": "The law to be enforced is the EPA's limit on coal pollution. Because Congress is run by people who deny climate science (and what's not to scorn there?) executive fiat is all we have left.", "score": 12}, {"body": "This attack on another base of employment by democrats is why what began in the last elections will be finished by 2016. I can't wait to participate.", "score": 1}, {"body": "Go ahead, and shut down those unions with them. They will thank you, later, in a voting booth. ", "score": 0}, {"body": "Yes, it's clear that the Democrats want to erect thousands of unmanned wind turbines and solar generation facilities that were built by no one and maintained by nobody. The hollowness of your \"job killer\" arguments are truly incredible. Renewable energy jobs are permanent and unexportable. With distributed, decentralized and local generation through solar and wind, many of those jobs will be much closer to where people actually live. There will be plenty of jobs, just different than the ones that are slowly dying off today. We no longer produce buggy whips but I don't see people crying because they're forced to work in an auto factory instead. 2016 is a Presidential year. Our time at bat.", "score": 1}, {"body": "Yeah, because Ted Cruz is such an appealing sweetheart of a candidate. ", "score": 1}, {"body": "Interesting comments but we need to put the coal industry world wide in perspective.  The US has dramatically increased its coal shipments to Asia as coal use slows in America. Portland, OR has refused to allow these shipments from its port, so the coal is now being shipped thru Vancouver, Canada in record quantities.   So, the US is sending its coal problems offshore - out of site, out of mind. As well, Germany, the poster child of 'green', is quietly building over 20 new coal fired electrical generating plants as wind and solar cannot meet the demand as they shut down their nuclear industry.", "score": 6}, {"body": "I feel we need a renaissance for nuclear power, which does not produce carbon dioxide.  This renaissance must include revitalization of nuclear engineering programs, and evaluations of existing nuclear plants.   Spent nuclear fuel is being stored at these plants, so no matter what, they will remain sites of some risk.  Better to evaluate the risk, and make them safer and still use nuclear power as a component of our energy needs. ", "score": 33}, {"body": "No carbon dioxide, just tons upon tons upon tons of radioactive waste -- from contaminated clothing to contaminated tools to spent fuel. Where is all that polluting and deadly radioactive waste to be stored -- forever? ", "score": 0}, {"body": "Lifting of the Carter era ban on reprocessing of spent nuclear fuel would serve as a large source of fuel as well as eliminating the disposal issue.  Further, the waste repository in Nevada is built, ready for use, and the regulatory agencies have cleared it for use.  It is only the illegal actions of the administration that are preventing its use.", "score": 0}, {"body": "Nuclear power does not produce carbon dioxide, but it does produce radioactive waste (infinitely more toxic to us and the planet) for which there is no good method of disposal. Speaking from earthquake territory in California and viewing what happened in Fukushima just a few years ago, I say the risks of storage are too high. Not only is Fukushima still hemorrhaging radioactive waste into the earth and sea, it will continue to do so for decades or more. Earthquakes are increasing in areas where fracking waste is injected back into the earth at high pressure. Any nuclear plants nearby would be at risk. Stored waste is a time bomb waiting to go off.", "score": 0}, {"body": "This conceited sub-heading: WASHINGTON — President Obama’s most far-reaching regulation to slow climate change …Unbelievable!! It is this naïve, ignorant attitude that will doom us all. We perceive we are the gods, masters of the planet and can put it all back together with our superior science and technology. Nature has no mercy for the weak, no compassion for the dim witted and, as for our arrogance in placing ourselves as the most intelligent, superior species on the planet. Well, that is laughable. We take, we despoil, we pollute, with such a contempt and disregard for the environment. If there were such a thing as ‘Mother nature knows best’ she would have suffocated us at birth. We are in a very precarious situation. It is inevitable that we will pass the 2C rise threshold, the point where we pass from danger to potential catastrophe. We are separating ourselves from nature by destroying our very life support systems and putting the planet on a trajectory for the destruction of our species. The Kyoto Accord, the Copenhagen Accord, the Durban Accord etc. are meaningless, they are and always will be accords to 'agree to disagree' as Economic growth is the prime and immediate concern of all governments. And as for Climate Summits …They will go on in strange paradox, deciding only to be undecided, resolved only to be irresolute, adamant for drift, solid for fluidity, all-powerful to be impotent. www.cugerbrant.info", "score": 3}, {"body": "that pretty much confirms my suspicions about Larry Tribe", "score": 3}, {"body": "Mine also, so happy to be wrong about him regarding this issue.", "score": 0}, {"body": "Not only is this headline absurd, so it the premise of slowing down what is suspect and yet collectively deemed inevitable and thus operates by a larger mechanism than that orchestrated by an ideologue President.  It is past time to stop with the legacy narcissism and examine the efficacy of policy as well as judgement and legality while bypassing the politics du jour. Ideology does not trump truth, and when unexamined and unchallenged it will be more certain than global warming to lead to distortion and chaos.", "score": 1}, {"body": "Well, ideology does sometimes trump truth: ask Pat Robertson, or the guys who defended Big Tobacco so well. But I think you'll find that as the temps and the oceans keep going up, and the climate changes, and food and water start to get pricey, that no, you won't be able to hang onto your blinders forever.", "score": 0}, {"body": "This is yet another scam from Obama. Nothing he proposes will do anything to slow climate change.", "score": 5}, {"body": "I would guess you are a Republican?", "score": 5}, {"body": "Is this all about President Obama?  Consider what the Pentagon and the Navy (the favorite recipients of government spending supported by Republicans) have to say on this topic: http://www.nytimes.com/2009/08/09/science/earth/09climate.html http://www.bostonglobe.com/news/nation/2013/03/09/admiral-samuel-locklea...", "score": 0}, {"body": "To the extent that there is a \"war\" on white men it America it is a war of aggression by conservatives who don't want to pay them a living way, don't want to see them get health insurance, and don't want their children to be well educated.  Unfortunately, too many white men (and women) have been hoodwinked by the Conservative Infotainment Complex -- especially Fox News --  into voting against there own interests again and again.", "score": 6}, {"body": "Strange how the United States has to implement these costly environmental reforms while China, India and Russia somehow continue to pollute at will and grow their economies exponentially. Like the Iran nuclear negotiations Obama doesn't mind at all that America is getting taken to the cleaners while other nations get a pass.", "score": 3}, {"body": "The US produces 17.6 tons of CO2 per capita; China, 6.2; India, 1.7. When it comes to cutting emissions, why would any­one else do what we are not will­ing to do ourselves? http://data.worldbank.org/indicator/EN.ATM.CO2E.PC", "score": 4}, {"body": "Industries rise and fall, it's been the way of the world since forever. Now we need investments in clean energy and divestments from coal - that is what the whole country is shouting with a steady crescendo. Climate change is no joke and we HAVE to save our planet. The big dogs with money obviously won't back down, and this legal battle is just another example of that. The odds are stacked against us, the billions of people that want to see our grandchildren living in a sustainable world, but when we are vocal enough then politicians will have to start listening. Money can trump public outrage, but only to a point.", "score": 5}, {"body": "Climate change is happening despite humanity's best efforts to slow or reverse it. Call me a religious nutcase, but I happen to believe in this thing called prophecy. It'll take a while for the rest of you to grasp the concept, but don't worry. You'll catch on.", "score": 1}, {"body": "Thanks, but I'm in good with the Easter Bunny, so I'll be fine.", "score": 1}, {"body": "Fast forward 40 years, a conversation with my grandchild: Kid: I am really angry that we have pushed our planet towards self-destruction, past the point of no return! Why did congress block President Obama's efforts in 2015 to attach climate change, which had been overwhelmingly proven by science years earlier? Because his Republican opponents were more interested in two things: protecting the fossil fuel industry, and destroying the President's legacy. Sorry kid, some of us really tried....", "score": 12}, {"body": "regardless of whether or not \"global warming\" is caused by humans, we are definitely destroying the planet. If major polluting corporations are not held responsible then they will put us on a very undesirable and unlivable earth in the near future. The world cannot support this population growth or the uncontrolled pollution of land, air, and sea. The energy corporations keep us going and we couldn't live without them, but they do not do enough to repair the damage they are causing, and probably never will. I guess the republicans don't care about the world their great grandchildren will live in! Good luck.  ", "score": 7}, {"body": "Democracy simply doesn't work. ", "score": 3}, {"body": "A Democracy that is bought and paid for by business interests is not a Democracy.", "score": 1}, {"body": "Seems like I've heard this one before...oh yeah the tobacco industry's use of shills for decades to divert attention away from just how harmful their product is.", "score": 9}, {"body": "Many precedents have been set with sound legal footing for EPA to regulate  carbon, sulfur dioxide, and other particulates through the Clean Air Act.  In the case this gets knocked down, which I personally can't see happening, I strongly believe even against popular political belief that 2017 will be the year a carbon tax is brought up in Congress again and this some type of carbon pricing framework goes through. People recognize coal and fossil industries for what they are, incumbent industries fighting to protect their profit share in the face of new disruptive, presently competitive but ultimately superior technologies like solar and wind.  Carbon is a problem. Not just for our whole planet, but for our people. It's time our government started protecting our people by protecting the environment that we live in, that everybody lives in. If republicans continue to show they're beholden to the interests of industry and money, the people will eventually, in the very near future, show their might. ", "score": 5}, {"body": "I am all for clean energy at a reasonable(?) price, and I don't think anyone really wants older coal fired plants running into perpetuity.  The sad truth from the DOE is that our current and future energy demands exceed the capacity of all our existing sources.  Grids are strained during heat waves, and there hasn't been any new substantive capacity brought online in decades.  Most of us have a NIMBY attitude about new plants of any kind, and have misguided belief that our demands can be solely met by wind, solar, geothermal, hydro, etc.  Conservation can only get us so far, and if your cost per kilowatt rose 50% or doubled to reflect the true cost of going all green, you might actually enjoy nuclear, or one of the newer IGCC, supercritical, ultracritical, or fluidised bed coal combustion technologies.", "score": 1}, {"body": "I suppose the legal battle has to start sometime, so it might as well be now.  The \"deniers\" will drag it out for years, as you pointed out.  But, it may cause historians of the future to proclaim that we finally \"got it\" in 2015.  (sigh)", "score": 5}, {"body": "Like Tribe and oh, that's right, what's his name? The co-founder of Greenpeace International who is a skeptic now of anthropogenic climate change and who argues that the key to reforestation is more carbon, not less...  ...or has he already been erased from the Gaia/Gore narrative? Patrick Moore, I almost forgot.", "score": 0}, {"body": "What's missing in virtually all discussions I have read about \"replacing fossil fuel as an energy source\" are NUMBERS.  Unless I'm badly mistaken the available \"renewable sources\" CAN'T BEGIN to make a dent in the energy requirements of this country. How many acres of solar panels and how much energy storage (batteries) capacity is needed to provide the same on demand (24 hour, rain or shine) electrical power as one large fossil fuel (coal, oil,etc) power plant? My guess is that the answer to this is something that the \"green\" crowd doesn't wish to discuss. That said,  I am in total agreement that in the long run mankind MUST find adequate energy elsewhere if for no other reason than WE ARE GOING TO RUN OUT OF the energy required to maintain modern life even with great improvements in efficiency.  Of course, that will make the \"greens\" happy, at least those that survive life as it was lived in the 17th century. What to do?  I can see nothing other than some form of nuclear energy (fission, fusion or ??).  Of course the \"greens\" won't stand for that either. As Pogo Possum said.... \"We have met the enemy and he is us\". I'm 78 so this won't affect me or likely my children but I worry about my grandkids. ", "score": 20}, {"body": "Coal mines exist in areas that have great potential for hydroelectric power--there is plenty of water and the area is hilly. Both provide ample opportunity for hydroelectric. Why keep coal as a power source? There are alternatives, for example oil and natural gas. Both cause less pollution than coal, and while not the cleanest sources are a step in the right direction. Other ways to make coal less profitable are for the government to insist that all safety rules regarding mining and use of coal be followed to the most strict interpretation of the laws. Insist on mine safety and cleaner air. Insist on proper scrubbers to remove pollutants from the effluent of plants using coal. If they can clean up chemical labs so that you no longer smell them, they can clean up energy sources. However, existing laws on emissions, protecting the health of miners and their families, environmental effects whether next to the mine or downwind of coal fired plants must be followed completely. No excuses. Hold the companies responsible by withholding all income from the company, including salaries of all managers until they pay for their damage.", "score": 0}, {"body": "The argument that renewable sources of energy can't make a dent in our energy requirements is a false one. Germany and other developing countries are well along in the process of moving to renewable sources and they don't appear to be suffering shortages. It's just a matter of shifting our priorities. What's most important to us? - the coal/oil industry's profits or the health of our planet and the people who live on it?", "score": 0}, {"body": "Renewable energy sources have their place, but you are correct in asserting that they alone can't replace fossil fuels. Indeed, nuclear energy is the only long-term solution; fission for the short term, and then fusion thereafter. Fission energy is being held back by inaccurate perceptions of its risks and a general unwillingness to properly deal with the reprocessing and storing of nuclear waste. Fusion energy research is being held back by insufficient funding and the perception that fusion energy projects are too expensive for one country to take on alone (we've spent trillions of dollars on military engagements over the past decade; fusion power plants would exist today if those trillions had been spent on fusion research instead).", "score": 0}, {"body": "about 5 years ago i decided to drive back to CA from taos NM through farmington in the NW corner of the state. boy..... you get a real lesson in extraction on that trip. first, the oil and gas wells, the remnants of uranium mining and then....... the empty NE corner of arizona cloaked in smog that would rival LA. all from two nearby cola fired plants. i believe these plants are built on the huge reservation and the native americans get financial benefit but what a cost.", "score": 3}, {"body": "Regulation of coal is long overdo.  Coal should be phased out quickly and replaced by solar backed by hydro, where possible.  Treaties, backed by carrots and sticks, should be put in place to make sure the rest of the world is in agreement with this, especially the Chinese, who if they are serious about curbing air pollution, should be the main proponent of this. In places like W. Virginia, there needs to be a buyout of coal aimed at the workers, who might also be given preference in hiring for solar manufacturing and installation.  (Putting Interstate highway arms into Appalachia would also help them.)  As long as China is producing solar panels at lower and lower prices, don't hinder this, but encourage it, while protecting domestic intellectual property rights.  Require Feed In Tariff by electric companies.  (ask Parker to add a Chance card:  \"Install F.I.T.; kick back $100 in executive pay\".  And replace West Virginia with:  \"State of Solar Bliss\") ", "score": 2}, {"body": "Teddy Roosevelt fought and battled loggers, industrialist and many in Congress to preserve large amounts of land that are now the parks and open spaces that we all enjoy. The battlefields were in the U.S. courts. There was significant money to be made and jobs to create from the timber and mines on all that land. Was the preservation worth it? Was it worth the fight?   Today, the stakes are much higher. The fight is worth it. This battle must always be fought, and it is a battle that, at its core, ensures that the public interest must always supersede and take priority over the special interest. ", "score": 61}, {"body": "And TR was a Republican who would not be welcomed at a GOP event today.  GOP has done a 180.", "score": 1}, {"body": "Your understanding of history is distorted.  Teddy Roosevelt supported logging and mining on the overwhelming majority of federal lands. ", "score": 0}, {"body": "And look who invariably sues over everything: Conservatives. The people who howl loudest about needing \"less lawsuits\" (sic) They are all for suing when it is they filing the lawsuits. https://emcphd.wordpress.com", "score": 3}, {"body": "The EPA continues it's attack on the middle class.", "score": 1}, {"body": "Can someone let this president help Americans? ", "score": 4}, {"body": "We probably don' t have for the delay in getting started controlling the warming of our planet that this multiyear legal battle  will  cause.Here in  the Pacific Northwest during the last couple of decades our mountain forests have overall has less winter and spring snow,making them dryer,for more of the year,resulting in worse,longer wildfire seasons.While an increasing portion of our energy transmitted here is wind and solar,we still get,in the NW,30%  from coal,which is unacceptable,and what the EPA       tried  to reduce.", "score": 1}, {"body": "The title to this article is misleading. Obama can't control the climate of the planet. The US is a minor player in carbon emissions and will become increasingly insignificant as global population increases from about 7.4 to some 10-11 billion carbon-generating human heaters during this century. ", "score": 1}, {"body": "West Virginia is more important than the health of the rest of America?", "score": 4}, {"body": "In fact, West Virginia's citizens' health suffers even more from coal-related diseases than the rest of America.", "score": 1}, {"body": "Republicans to their children and grandchildren: \"It's going to be okay. You'll just have to find a different planet.\" ", "score": 7}, {"body": "Coal!  They are fighting a court battle over coal?", "score": 2}, {"body": "More overreach by our imperial president. When will he finally discover that he is not a king?  ", "score": 3}, {"body": "Once again, thank you President Obama for your integrity and courage.  Imagine what the United States of America could be if all of our \"representatives\" possessed these qualities.", "score": 10}, {"body": "People will look back in 100 years, actually in 50 years, shaking their heads at our absolute stupidity and short term greed. Can't we project ourselves forward a little and use 20/20 hindsight now.", "score": 8}, {"body": "\"They said, Go ahead, burn it up like madmen, all these highways, the shopping malls, everything. People won't believe it in a hundred years, the sloppy way we lived.\" \"Didn't we used to burn it up? I had an Imperial once with twin carburetors and when you took off the filter and looked down through the butterfly valve when the thing was idling it looked like a toilet being flushed.\" John Updike, Rabbit Is Rich.", "score": 0}, {"body": "The most upsetting thing about Republican climate denial is that in 50 years when the full effect of their obstructionism is revealed they'll claim it wasn't their fault.  And the very same type of people who are writing anti-liberal comments to this article will believe them.  And we're worried about terrorists?  I'm worried about Republicans.", "score": 9}, {"body": "Global Warming ‘Pause’ Continues — Temperature Standstill Lengthens to 18 years 4 months Satellites reveal temperature standstill increases  - No global warming for 18 years 4 months. 1. Antarctic sea ice has been above normal for almost 3 years uninterrupted. 2. Three years uninterrupted above normal sea ice is unprecedented over the satellite record. 3. Record after record sea ice highs have been set during that period. 4. The trend for the last 10 years has been stunningly strong. 5. The long-term 30-year trend is strongly upwards.", "score": 2}, {"body": "No matter what you claim, and much of it is inaccurate, here are some real facts: Fact - Burning fossil fuels and especially coal adds CO2 to the atmosphere. Fact - The amount of CO2 measured in the atmosphere is increasing. Fact - CO2 in the atmosphere acts as a green house gas absorbing heat that would otherwise be radiated off into space. Therefore, unless the amount of energy coming from the sun is declining, and we know it isn't, it is a fact that the amount of heat on the planet earth is increasing.", "score": 0}, {"body": "So far all we have done is talk and write about how evil the companies are.  Nothing will happen until we take action and revolt.  They are seriously out numbered.  Let's take back our country.", "score": 3}, {"body": "The coal industry is trying to keep itself alive, which is understandable. However, this is the same industry that is responsible for over 70% of US heavy metal water pollution, routinely violates safety laws with resulting miner deaths, and simply refuses to pay the fines imposed on it for such violations (on last check, $70 million in unpaid fines). The coal industry looks out for itself and the pocketbooks of its executives—period. Is this really an industry that we want to keep alive? Let's help people in coal mining regions find new, safer jobs in the renewable energy industry.", "score": 127}, {"body": "Mercury is one of the heavy metals you reference.  Natural processes: volcanos, forest fires, and microbial actions produce 1/3 of mercury \"contamination.\"  All of North America contributes 0.4%, which includes all coal fired plants in Canada and Mexico.  Eliminating all coal fired electricity generators in the US will result in an undetectably small reduction in environmental mercury. Just to clarify, it will be impossible to measure the change in ambient mercury 20 years after all US coal fired plants have been shut down.  Seventy percent of a near zero number is still just a slightly smaller near zero number. Not only do you want to have coal related employees relegated to the dustbin, you also want their electricity costs to double.   Your disregard for the poor  and middle class is appalling. ", "score": 0}, {"body": "The world is going to end.  We humans are so smart, we have it all figured out.  After all we have been writing down temperatures of certain things and stuff for like 100 years.  We that are such geniuses have reported single degree temperature shift over a period of 50 years.  That must prove that the 16 billion year old earth, that has experienced countless ice ages and major temperature shifts, is on a cosmic path to destruction because of the evil corporations that burn stuff.  We must stop them from burning stuff.  We humans that went to liberal ivy league schools know it all and we have figured out how to save the universe.  Everyone else is a neanderthal clinging to their religious morals and stuff.  Al Gore is basically God.", "score": 1}, {"body": "This is like a repeat of using lead in products. We literally poisoned the entire population for decades so certain industries could maximize profits. And I don't blame the industries, at lear not completely, they are pressed to meet bottom lines and are doing the best they can to do that, all of us make comprises but most of us are not in positions where are comprises affect so many people. As non-scientist citizens we need to stop pretending that our uneducated decisions matter and focus on supporting the tremendous amount of work scientist have done to provide us with sound information. One of the comments below states that; \"wind and solar power are not continual, reliable energy sources.\"  This is not a fact, it's just a belief that he is comfortable with. If you truly believe there is no harm with fossil fuels you should completely commit to your side of the argument and begin arguing for lead and asbestos to be brought back into the market place. Scientist used the same method to determine their harm to us that they are using to determine fossil fuels harm to the environment. Please get over yourself, stop pretending your opinion on every subject matters and let the people that are doing real work, gathering real evidence and facts guide us, so that we stop killing ourselves and the only place we have to live.", "score": 89}, {"body": "You make a straw man argument and then argue with it.  It is not a Republican or conservative position that lead paint should be reinstated as a standard or that asbestos should be used in oven mitts or hairdryers, as was the practice in the past.  Only an ideologue would make such an argument, so you have clearly staked out your position as one. The proposed EPA regulations ignore all point sources of carbon dioxide emissions greater than those they are choosing to regulate.  They are imposing costs 80% of which will be borne by red states.  That is not a scientific decision, it is a partisan political decision. Climate scientists will tell you that the proposed reduction will do zero to reduce global warming.   As a non-scientist, you are not having science explained to you by scientists.  You are having science explained to you by politicians, like Al Gore, who stand to make a huge profit (Gore's wealth has increased by $200 million as payback for having lost an election) who are counting on your ignorance of both science and economics.", "score": 0}, {"body": "EPA has gone beyond the boundary of its authority and hopefully the supremes will stomp down on their outrageous illegal and unscientific actions regarding nonsensical climate change regulations. This is just another reason why voters should not vote for Clinton or any other democrats in 2016.", "score": 2}, {"body": "I'm surprised that the editors or the reporter didnt think it worth mentioning that the supreme court already ruled on this issue... I  thought they required  the Obama Administration  to enforce the clean air act...   please inform us!", "score": 3}, {"body": "A court deciding the validity of science? Give us a break! I've had it with the stupidity of Republican greed. Enough. It sounds like the trial of Galileo by the church.", "score": 7}, {"body": "Another vivid example that mankind suffers from a severe case of self destruction.", "score": 4}, {"body": "The ideological diatribes against the very idea of climate change -- and the moral imperative to address it -- are quite remarkable. What does it say when a large percentage of the public and one of the major political parties (at least publicly) deny scientific findings that are accepted not just by liberals, but by national academies of science in virtually every country, the CIA, the defense department, NASA, NOAA, and so on. Apparently it's easier to believe that the whole thing is a \"hoax\", and somehow all these organizations are perpetrating it on the rest of us. Yet many of these same people will tell you they take literally the fables in a book written over many centuries, dating back to a time of scientific ignorance. All the evidence in the world => not credible; incredible stories with no evidence => truth. Truly remarkable.", "score": 6}, {"body": "I'm sorry my sons but you are too late in asking, Mr. Peabody's coal train just hauled it away, as John Denver sang in Paradise. They tortured the time and stripped all the land. This land and the entire nation are owned by all the people, not rapacious energy companies or people looking for jobs.", "score": 4}, {"body": "Well double jeopardy is against the Constitution so why should regulators be free to regulate more than one thing related to any one business, isn't that the same thing? Let the breather beware! This is a case of cynical minds creating an inane discourse to avoid addressing an issue with anything close to seriousness.", "score": 0}, {"body": "There are two sides to this argument - one side argues for what is right, the other for money. Let's see who wins.", "score": 1}, {"body": "They both fight for money. Just different kinds of it.", "score": 0}, {"body": "I have proposal.  Let's allow States like West Virginia burn all the coal they want without any pollution controls, with just one caveat - the smoke stack of the plant can't be any higher than 50 feet, ensuring that all the heavy metals, particulate matter, etc... stays where it's generated. These coal plants all have very tall smoke stacks to pass these poisons on to innocent people down wind.  This is criminal.  You want to burn this stuff?  Then deal with the consequences of your actions; no passing your pollution off on the States downwind from you.", "score": 3}, {"body": "Watching the fate of the world playing out in the hands of our courts system seems like the modern day equivalent of watching Nero play his fiddle while Rome burned to the ground.  I hope someone is tuning Roberts' up before he starts playing it.  At least spare our ears from that final insult being out of tune as well as his lousy playing.", "score": 2}, {"body": "It is utterly amazing that Rush Limbaugh is held in esteem on this topic along with the Senator from Hawaii.  Perhaps, it is no longer about what Republican deniers say they do or don't believe in. Perhaps it is just about money. I believe that the fossil fuel industry in the US simply wants to sell as much of their product as possible before things become scary. I think the love of money is greater than the desire to protect the future. Republican politicians appear to be totally in the pocket of the fossil fuel industry. ", "score": 4}, {"body": "Does carbon pollute the environment? absolutely.  Can we (human beings) afford to continue to pollute at the same levels? Absolutely not, and the majority of Americans and earth dwellers understand this and it's one of the main reasons President Obama was elected twice.  We should demand from future Presidential candidates to be clear about their position in relation to energy pollutants and climate change.", "score": 2}, {"body": "It's depressing to hear that a lawyer like Mr. Tribe is taking arguing the plaintiffs. While in principle I respect that for good lawyers their are really no right and wrong sides, just the law, in practice it disgusts me. As the Times pointed out Sunday, opponents of gay rights cannot find eminent lawyers to take up their cause, because of disgust towards the bigotry.  I look forward to the time when even the deep pockets of the fossil fuel industry can no longer pay for quality opposition. Unfortunately, deep pockets have all the advantages in our system today. The fact that these Coal advocates are ecstatic to take a renowned legal scholar from Harvard, yet are so quick to dismiss the work of climate scientists as out of touch elite campus liberals, is revealing.  ", "score": 2}, {"body": "As a lawyer I understand your dissonance but the fact is I could never hold a candle to Ted Cruz's legal accumen but he parades around the Country pretending to believe in things which are objectively ridiculous.  Money talks my friend. ", "score": 1}, {"body": "If GM can be liable for millions of $ in damages for a faulty ignition switch - why are the Coal Companies not liable for the death and destruction their toxic pollutants cause? We have plenty of clean fuel to burn (natural gas) - the old dirty coal fired plants should be immediately shuttered. It is amazing that corporate greed, supported by Republicans, a constitution written in the 18th Century - can damage societal health without any consequence. We all have to work together, use less energy, ensure that the energy we use is as \"clean\" as it can be, in an effort to ensure that our planet is healthily habitable by our grandchildren.", "score": 7}, {"body": "Haven't you heard, GM bankruptcy has relieved them of any responsibility! Thank you Mr President.", "score": 0}, {"body": "I have to say it's wonderfully darkly funny that folks are gonna sit around and have a years-long debate about this issue, while the earth slowly but surely starts to shake us off like that overgrown infestation of fleas that we are.", "score": 12}, {"body": "Where are the Democrats? Where have they been for more than 7 years? Why can't they stand up and support the President and his policies? Where were they during the mid-term? Why didn't they stand up for the record of the President over the past 7 years? They don't represent us anymore. They have succumbed to the greed of only trying to get elected and stay in those positions. They are nothing more than Republicans masquerading as Democrats. Ah, the hated government that all Senators and Representatives cling to for their personal profit.  What an incredible disappointment. ", "score": 24}, {"body": "Ask the Grimes gal from Kentucky what she thinks of coal, and then ask her who she voted for in the last presidential election. She, in a nutshell, is why democratic presidents can't get anything done.", "score": 0}, {"body": "I agree with you completely. That was a shameful display in my opinion. ", "score": 0}, {"body": "The coal company's arguments on this one are crazy.   They are advancing two arguments -- the first is a claimed technicality that since the plants are already regulated under part 112, they cannot be regulated under part 111d. This claim is on par with \"You already prevent me from killing him with a gun so it must be legal to kill him with a knife.\"     The coal plants are already regulated under 112, and are also regulated under part 111d (which controls a very large number of polluting chemicals, many of which no power plant would have any reason to emit, but if they did, they would still be subject to 111d) Their second argument is a 10th-amendment argument about states rights.   That argument would repeal the Interstate Highways, and virtually every other Federal regulation, were they to prevail. The real problem for the Coal companies is that the Supremes already determined that CO2 is a pollutant, and the EPA not only can regulate it, but having made a determination of harm, must regulate it.    The obvious point to the Supremes, and the coal companies, is what method of EFFECTIVE regulation would you like better?", "score": 4}, {"body": "The GOP endlessly complains about the government passing its debt to future generations, but it's no big deal passing them polluted air and water.  The human species and all planet life can survive without coal and oil, but it cannot survive without clean air and water.  Green energy now and for the future.", "score": 285}, {"body": "When it comes down to hired legal guns, the various energy-production industries are going to get the best legal counsel money can buy. This whole issue will be played out endlessly while the effects of climate change, which the energy industry as a whole doesn't believe in, ravage the globe. Lawyers making money while Rome burns. Mr. Tribe should be ashamed of himself. ", "score": 13}, {"body": "Perhaps if the Republicans who have been obstructing everything Obama has attempted to accomplish would get there heads out of the sand and take a look around they might realize something needs to be done to regulate those spewing garbage into the air.  Not only are coal burning plants soiling the air they are causing lung cancer and various other ailments that in turn puts a strain on the healthcare system and of course they oppose Obamacare too.  Climate change is real, pollution is real and Republicans or those living with the belief that none of this is true are very unreal.", "score": 7}, {"body": "It is so evident that big money now rules this country in every way whether it is policy, religion, commerce, our personal lives and even the environment. Sometimes I wonder why we bother anymore electing a government with a congress that just disregards the good of the people and protects the corporate interests. Why not just hand over the keys to the corporate CEO's and become one large corporate factory town.", "score": 9}, {"body": "Because this way works better for the corporatists. It allows the majority of Americans to continue believing in American myths, which allows them to sidestep their responsibilities to this nation and its people.", "score": 0}, {"body": "It is not the EPA that is hurting us, it is Republicans. For twenty-plus years now Republicans have sacrificed our future, and the future of our children and grandchildren, on behalf of the narrow, profit-oriented interest of fossil fuel corporations like Peabody Coal. Peabody Coal and Republicans don't seem to care about anything but the next quarterly. They don't care about water. They don't care about people. They don't care about mountains and rivers. And they don't care about the air and the looming necessity of keeping the density of carbon dioxide in the atmosphere at 400 ppm or less. It is our governmental leadership that is supposed to stand up and protect all those non-profit values, but Republicans care about nothing but fossil-fuel profit. Republicans signed up for the fossil-fuel disinformation campaign as soon as the facts came out that carbon dioxide would cook the planet. They signed on in the 1990s to sell doubt and confusion, to question the ethics and the credibility of scientists, and to treat climate activists like hysterical wackos, and they're still at it. Republicans have been spewing doubt about climate change to avoid regulation for so long that it is most likely too late. Battling the EPA is harmful, immoral, and environmental suicide. Except Republicans and Peabody Coal are not just killing themselves, they're killing us all.", "score": 8}, {"body": "I believe in Global Warming and that the present global warming is of human origin.  However at 83 I well remember that the impending Ice Ge was the big worry as I began my maturity.  The period between glaciation of the earth was soon to end it was warned.  Perhaps this global warming will be the first that will hold back the return of the next ice age with its devastating effects on civilization.  Take your pick- another ice age and perhaps the greening of the Sahara Desert or Global Warming and the inundation of much of Florida, etc etc.", "score": 2}, {"body": "Well, there's some truth to that. The next ice age is certainly now on indefinite hold. However, when geologist warned that the next ice age was coming soon, they meant on geological time scales - sometime in the next 10,000 years. Furthermore, we now understand that ice ages begin slowly (and end quickly). There never was reason to panic. On the other hand, at the rate things are going, Florida will be underwater in the next two centuries. The two threats aren't equally pressing. A scientist.", "score": 0}, {"body": "This is very similar to Obama's secret negotiations with Iran.   The United States gives up everything and get's nothing in return.   Obama agreed to immediately start reducing US emissions while China the world's largest polluter does nothing until 2030.    Anyone who cares to take the time to research the issue versus believing what they are told by Obama and the media that supports him will see that there is no credible science showing humans are causing global warming.  This is all about a president who is using the presidency to implement his personal agenda with no consideration on the impact to the average american and our country.  ", "score": 0}, {"body": "Nothing in return? How about  breathable air and a slowing of climate change", "score": 1}, {"body": "Hooey, Don. Grim, commercial-interest boilerplate hooey. I'm an average American and I support what President Obama is doing.", "score": 1}, {"body": "Mshae, too bad the president you support isn't.", "score": 0}, {"body": "I had a class at the UW in Wausau back in 1979. It was a geography class. Professor Musloff was also the official temperature keeper for the area. In the lab there was a cylinder with a pen on it. The cylinder would move very slowly and the temp would be graphed. It was like a slow motion seismograph. One day Musloff announced we just broke the record for consecutive days without the temp going above freezing - 80 straight days. Back then the talk was about global cooling. He dismissed the notion and said that the long term trend was for more warming and shrinking of the polar areas. He cited recessional moraines as an example of how a warming world can have cooling periods. Now it seems that the notion of a warming world without man is ridiculed. WI was under a mile of ice just 14000 years ago. Now that ice is 3000 miles away. That is a recessional rate of a mile every five years. Even if we shut down all the CO2 the world would still get get warmer. Maybe we should just plan for a warmer world.", "score": 1}, {"body": "In a sane world EPA regulations should be embraced by large potential polluters to protect them from massive liability.   Government and industry working together is good for the public and the industry.  This attack on regulation by an industry that has been harming the public for a very long time is just as likely to open the industry up for massive liability damages when compliance may allow the industry to survive and thrive.   Rather than fighting this regulation the coal producers should be modernizing their plants and looking to comply.  I suspect this action is going to kill the industry in the long run an outcome that is much worse than the cost of compliance for both the public and the industry.", "score": 5}, {"body": "This is the American Way, alright: take a clear, patently obvious issue, and throw expensive lawyers at it, who will burn time, money, and the future of the country in excruciating, dilatory, and pharisaical combat. It isn't enough that Big Coal owns and operates North Carolina, West Virginia, and Kentucky.  It is fighting, in the end, to protect profits absolutely.  The outcome may include the possibility that it alone will decide if human respiration and the health of the planet are more or less important than its bottom line. Year by year, court decision by decision, piecemeal we give away - or allow the neutralization of -  our ability to defend our beings and health.  In the end, even your ability to breathe is your problem alone.", "score": 151}, {"body": "It is clear that the EPA made a partisan decision to ignore all contributors to carbon dioxide and to concentrate only on those in red states.  Their intention is to raise electricity costs exclusively in the states that consume coal, and to hold other states harmless on costs.  The states that are supporting the proposed legislation correctly perceive an economic benefit to increasing electricity costs in other states.  Not the regulations do not require comparable CO2 reductions across the states.  The lion's share (80%) is in red states.", "score": 0}, {"body": "Thank you for \"pharisaical.\" What a lovely word to add to my vocabulary!", "score": 0}, {"body": "If the TPP passes as written, any company would be able to sue any locality in the U.S. for enforcing any regulations including environmental laws that cut into their profits. Check it out!", "score": 0}, {"body": "Another of President Obama's urgent call and solution to prevent Earth's massacre and impending, ominous complete destruction will bite the dust. These stupid, greedy nay-sayers will lead us to that disaster which will be irrevocable. Ray, from Texas - We might find a few caves but we will still have stomachs in our bodies and we need to eat and drink. Where is that going to come from? Unfortunately for us, Nature is neither kind or forgiving. We will certainly not be given a second chance. And just to remind these stupid climate change deniers - they are going against the same agency that a brilliant President from their Party, foresaw the future decades earlier and set up the EPA. Too bad for us, he had to resign for illegal political reasons which pales in comparison to what is happening now, that too, legally! ", "score": 3}, {"body": "Of the comments so far, nearly none are interested in the legal issues, and neither, it seems, is the article. Everyone perceives this issue to be political. Some commenters say we should make the polluters pay. That's interesting because the shortest road to that outcome is another lawsuit, maybe filed by Northeast states against the coal companies. In fact, our society is rarely protected by regulations, with the Clean Air and Clean Water acts exceptions. I'll be surprised if Obama or anyone else is able to use regulations to shift us from coal to solar and wind, as we obviously must eventually do. Mostly we are protected by greedy trial lawyers. The tobacco industry was felled by lawyers, not regulators, and cars are safer because of lawsuits, not regulations. In Europe, regulators control the economy far more; to use a new chemical, the burden of proof that it is safe is on you. Here, you can use a new chemical until you're sued because you harmed people. In this litigious environment, I don't see how we can sue our way to the right shift in power generation. I'm waiting for a smart, greedy lawyer to figure that one out.", "score": 51}, {"body": "Why not support a highly reliable, ultra clean replacement....nuclear energy?", "score": 0}, {"body": "Unfortunately, the tobacco industry was not \"felled\" as cigarettes are still legally sold in the US despite the fact that they cause immeasurable suffering, loss of productivity, life and health care dollars. Another example of corporate interests trumping those of our citizens.  Will this be the pattern for air, water and land pollution as well?", "score": 0}, {"body": "This is mostly, but not entirely true.  There are precedents of harm being prevented by regulation (EPA regulation, actually) rather than punished by lawsuit after the fact. The issue is political and environmental.  The early 70s gave us the EPA, the Endangered Species, Clean Air, and Clean Water Acts.  What an amazing time!  Congress acted because of a groundswell of public outrage that was nurtured in no small part by Rachel Carson's book Silent Spring.  One of those acts (I forget which one) was vetoed by Nixon but that was overridden.  The others Nixon signed into law. Since then, our courts have never second-guessed the EPA.  There have been rulings in which the Supreme Court have stated explicitly they are not there to agree or disagree with a regulation; they are there, rather, to ensure that the EPA followed proper procedures in developing their regulations. It really would be an outrageous overstep if the courts allow the coal industry to abort a proto-regulation that the EPA isn't even done crafting yet.", "score": 0}, {"body": "Only a handful of the most rural states are net exporters of coal.  The vast majority of states recognize that coal is a losing proposition economically and that replacing outdated coal-fired power while investing in energy efficiency is one of the best ways to help their local economies. Unlikely heroes have emerged in the transition to wind and renewable energy. TX has an enormous capacity for wind power, dwarfing even that of CA, and the State recognizes the value of its rapidly growing capacity.  http://blogs.edf.org/texascleanairmatters/2014/06/04/texas-wind-energy-c... New York has the potential to produce over 80 percent of its electricity needs from renewable energy (primarily wind, solar, and bioenergy), and has made a significant commitment to deploying renewable energy, with a majority of the other states and the District of Columbia having already adopted similar renewable electricity standards.   Despite a slight increase in 2013, coal production has been steadily declining here, and the real battle now has moved towards the ability of US companies to export more, particularly to China.  In 2013, the energy sector of the S&P500 derived 44% of its revenue from sales outside the US, with rapidly emerging market economies, including China, being key growth drivers. In spite of these facts and trends, Americans have been encouraged to mistakenly believe that the crux of the battle over coal is about US energy needs.", "score": 3}, {"body": "This is not a political football, as though it is a game.  It's for real!   Clean air is vital for survival of the human species on this planet.  If you've got your health, you've got everything! No health due to the effect of global warming, and you've got nothing.", "score": 7}, {"body": "If you love coal, don't have children. !!!!!", "score": 6}, {"body": "I don't love coal but I am awfully fond of electricity.", "score": 0}, {"body": "As I walked from the parking ramp to my office I had to button my jacket because the wind was blowing. I wished i'd brought my sunglasses along because the sun was shining and the Mighty Mississippi was flowing strong as it has for millenia.  Energy abounds and I wonder why this is not obvious to everyone. It's time to discuss buying out the monied interests impeeding progress; or is it already too late?  ", "score": 12}, {"body": "Is this sarcasm or serious? Honestly, can't tell.", "score": 0}, {"body": "I'm serious. Let's buy 'em out.  We can't afford another decading of thumb twiddling. ", "score": 0}, {"body": "So we want to change from power sources that provide continuous, reliable energy (coal) to sources that don't (wind & solar)? Are the fossil-fuel deniers going to finally be happy when the whole world lives in caves again?", "score": 7}, {"body": "Here's the story to follow, Ray: the ice sheets, which are melting faster than expected. https://youtu.be/0pDB_C-jwkU", "score": 1}, {"body": "I used to have similar thoughts, Ray.  I am part of the utility industry, and early in my career I thought the environmentalists would never be happy till we were all living in tepees.  But as time went by, I saw that the doomsayers in our industry were way overstating the negative effects of the original Clean Air Act.  As it was implemented, it created more jobs and new industries for the pollution control equipment.  And nobody can argue that the air is much cleaner because of it. Today we face an environmental challenge even more daunting than the original.  As I look at the science for global warming, it is too overwhelming to be a hoax.  Despite that, we once again see the industry doomsayers overstating the negative effects of regulating CO2.  In my career, I have helped design coal plants, nuclear plants and a solar plant.  And you're right that coal and nuclear run more reliably, but they each have detriments that are undeniable, as well. Big ones.   For the sake of our children and our planet, we need to take on this daunting environmental challenge and win it.  Will it be easy?  No, but we won't have to sacrifice as much as the doomsayers say we will.  And the longer we haggle, the harder it will be to win.", "score": 4}, {"body": "Call me when so-called \"renewable\" energy sources can provide wide-spread, reliable, scalable power to a world that runs on electricity. Texas has some of the largest sun and wind power facilities in the world and they only provide a fraction of the electricity we generate. We have enough coal and natural gas to meet America's power needs for centuries. Fossil fuel deniers refuse to accept this very simple fact. Instead of wasting capital on marginal sources, we need to be figuring out how to use what works - coal and natural gas - in a more efficient manner. ", "score": 0}, {"body": "The headline of this article should be changed to \"Obama's effort to Monetize Carbon Dioxide Heads to Court.\" How can something that we exhale be characterized as pollution? Secondly, no one really understands the impact of more carbon dioxide on the earth. The US is a small fraction of these gasses compared to China and India, who are not regulated. This is a scheme by the carbon credit mafia, led by Al Gore, to make money on selling carbon credits.  The EPA should be spending it's time regulating REAL pollution, like sulphur dioxide, excess fertilizer in the soil and runoff,  and solid waste recycling and composting.", "score": 3}, {"body": "Ah, looks like we have a professional here. CO2 can be characterized as a pollutant because it's changing the climate we depend on. This process is well understood and has been for decades despite disingenuous efforts of individuals such as yourself to create the illusion of reasonable uncertainty. The US has emitted far more CO2 than both China and India. You purposefully neglect certain inequities in past emissions. Nice distraction with Al Gore though. Baseless, but hey, if that helps people to overlook the enormous monied interests fighting to stop action on climate change to protect their bottom lines at the cost of the planet, by all means go for it. Even funnier considering that you probably be on this for a living.", "score": 1}, {"body": "Only deniers don't \"really understand the impact of more carbon dioxide\" on the earth. The science is clear and and not in dispute. The earth is warming and we're the cause of it. And the last time I checked, sewage is characterized as pollution and that came out of us, or does it only count if it comes out of the front end? And \"this scheme\" was hatched by those tree-hugging members of the \"carbon credit mafia\" named Reagan and Bush. At least give credit where credit is due.", "score": 1}, {"body": "Better yet, abolish the EPA.", "score": 0}, {"body": "When a regulation is passed, which version of it that was used? If it's the Senate version, then that's the final words. It's pointless of coal industry trying to use the House version (which wasn't a final version), and point out some \"clerical error,\" 25 years too late.", "score": 3}, {"body": "This is a time and money equation.  We do not have the time, but they do have the money.  Increasingly unfair distribution of wealth is magnifying the effect of delaying action on climate change.   ", "score": 7}, {"body": "Whether or not you support the regulation is beside the point.  There is a legal issue as to whether the EPA has the authority under the Clean Air Act to issue it.  If the courts determine that the EPA in fact does not, then it's up to Congress to address, or not address the issue.  Either way, the legal and political process will have worked.  Let it work and stop the vitriol.", "score": 2}, {"body": "His \"signature environmental achievement\" is destroying peoples lives eliminating their jobs while increasing electricity costs and making US products more expensive.  In another one of his brilliant negations he agreed to immediately reduce US pollution levels while China the worlds largest polluter does nothing until 2030. In the meantime he flies around in his 747 taking weekend golf trips totally unconcerned about the environment.   He has total disregard for how his policies impact the average American.   The only thing that is important is implementing his personal agendas versus doing what is best for the majority of Americans.  ", "score": 3}, {"body": "You are forgetting the impact of the massive droughts, fires. floods and super storms around the world, all effects, felt now, of a warming globe. Those are also real costs, far greater than the small effect of slightly higher energy costs and a few coal country jobs. While those stories are hard, they are as inevitable as the closing of stables and decline in buggy whip production (those cost jobs, too) when the gasoline-powered auto took over from horses. Time marches on, and it is now time to turn our backs on fossil fuels and face a better future powered by solar, wind, geothermal, tidal and other renewable energy sources.", "score": 3}, {"body": "\"Destroying people's lives\"? Care to explain how? \"Eliminating their jobs\"? Which jobs are those? In the fossil fuel industry? The oil companies are shutting down operations because there's a surplus and prices are low. They're for profit companies, after all. \"While increasing electricity costs\"? Hate to break this to you but solar and wind generation is now price competitive with fossil fuel generation and in many cases, it's lower. Renewable energy will *lower* your electricity costs going forward, not raise them. And remember the guy who rode in Air Force One before him? He did \"what is best for the majority of Americans\" by overseeing the economy into a ditch and bringing us to the brink of financial collapse. Talk about destroying people's lives.", "score": 1}, {"body": "When things get tough West Virginians will be watching you bunnies self decimate by your own consequences.", "score": 0}, {"body": "About the Bush Administration: For the profits of oil, pollution and war we really care. Many more people than on 911 will die or become ill From the toxic fumes that from those polluting smokestacks continue to spill. Death will come much more slowly for those with incurable ills And my pals, the phamaceuticals, will sell many more pills. The great unspoiled beauty of Alaska will all disappear, All thanks to my new exploration policy, have no fear.", "score": 2}, {"body": "When China and India make half an effort to reduce pollution and carbon emissions, then I can support our nation's reduction of energy.  For those who have a problem with that I say get off the grid.  My home's electricity is 90% produced by solar.  ", "score": 1}, {"body": "You know that, besides your home, on average one American consumes as much energy as 10 Chinese people?", "score": 0}, {"body": "In a perfect world, all the supporters of non-renewable energy would have to live in the filthy mess they make. Mountain top removal, fouling of waterways, despoiling the air, let them enjoy the benefits. If these captains of the energy industry had spent half as much time perfecting renewables as they spent fighting them, our only world would have a fighting chance, now I think we're doomed.", "score": 12}, {"body": "First let me make clear that I want coal to go away asap, we should be moving off of it yesterday.   Its important to do so fairly though - those coal miners and coal power plants have given us cheap (on the monthly bill cheap, not in the long term) power that has been amazingly reliable.   As someone who has lived in developing countries I know from power outages.   One complaint they have the deserves a hearing is this: \"you regulated us for conventional pollutants under the Clean Air Act and we made the investments that allowed us to comply.  The rules became stricter, we made the investments.  But CO2 is different -- these new rules put us on a timetable to shut down, this is essentially a property taking.\"   This may be true in some cases, and like I say I think it deserves a hearing - compensation would be the solution, because the coal plants do have to go.", "score": 54}, {"body": "Compensation? The taxpayer will be cleaning up their coal ash for decades. The taxpayer is paying much of the medical costs incurred by these polluter. In the end, they've already been overcompensated.", "score": 1}, {"body": "It's time for the energy companies to move to cleaner forms of generation. Whatever happened to American innovation? The federal government is prepared to subsidize the move to cleaner energy - why don't the energy companies take advantage of that and start hiring people to make the transition?", "score": 1}, {"body": "I live in California, and the current drought bolstered by the trend beneath it of mega-drought to come, is unprecedented.  Once every several years, a summer warming in the mid-Pacific brings extra rain to California in the winter, called \"El Nino\". This year one was due, and the mid-Pacific did heat up. But the area of warmth was diverted due to the change in currents caused by the unprecedented melting of the arctic ice (the same phenomenon that brought floods and extreme snowfall to the Eastern coast). So not only did we not get our much-needed extra rain this winter after three consecutive years of severe drought, we had the driest winter on record!", "score": 1}, {"body": "The use of coal for power is a perfect example of the indifference of the industry to pay for the negative externality this industry creates.  And, it's not merely the acid rain that has changed the lake waters downwind from the plants, the particulate expelled is dangerous to human health, as the Chinese are discovering.  According to the NIH, particulate is responsible for 20000 premature deaths each year, to say nothing of other medical problems it causes.  Those who defend the coal industry are quite silent on these, and other health issues caused by coal.  The coal industry is, in effect, a free rider, and like all free riders, distorts the economy.  Yet another example that the market economy is not free when its true cost is not calculated in lives or treasure.  ", "score": 212}, {"body": "The proposed regulations do not address acid rain or particulate.  Those are already regulated, and you will note that there are zero cities in the US (with the exception of LA, which gets its particulate matter from China) that have a problem with particulate matter, acid rain has been eliminated, and the Greats Lakes have returned to health, except for the sewage and treated sewage that continues to be  dumped into them and their tributaries by Democrat controlled urban areas.  Liberals are quite silent on the ecological damage they do. The proposed EPA regulations, which have the stated objective of reducing CO2, do not in fact reduce CO2 by a measurable amount.  They are a cost being imposed on red states for the exclusive purpose of raising costs.  There are individual point sources of carbon dioxide that are not being regulated that make much larger contributions to carbon dioxide than some of the plants that the EPA is insisting be shut down.  It is the role of the legislature to make political decisions, not the President.", "score": 0}, {"body": "Stuff and nonsense.  The acid rain protocols have not worked, according to scientists.  The level of particulates is regulated?  Oh, so those 20000 pre-mature deaths must have committed suicide., right?  Try reading the constitution, if you believe that the president cannot make political decisions.  Was Lincoln's emancipation proclamation a political decision as well as an executive order?  Or, was Truman's executive order racial integrating the military not a  political decision?  But what can anyone expect from a state whose   scientifically illiterate legislature thinks that creationism is an alternative to Darwinian science? Obviously no one in that body has ever read the decision in the Dover, PA case.  Of course, there is an alternative to science.  It's know as ignorance, the remedy for which is knowledge.  Your state legislature, to say nothing of the citizenry, should try it.", "score": 0}, {"body": "Be clear: our federal government runs off tax monies it gets from corporate America. These gestures by varying administrations are merely that: gestures. Look at what Obumma shoved down our throats with the Trade Act which they are also using to shove GMO chemicals down our, and the world's throats. Evil people doing what they do best: EVIL. ", "score": 0}, {"body": "Sheer madness.  First, we are suppose to live in a representative democracy not some sort of soviet ruled by the decrees of one man, legal or otherwise. Liberals used to demand democracy but now seem to demand authoritarian, ideological rule.  Second the liberal media speaks of climate change (code for global warming) as if it is a fact. Yet, even the UN admits that there has been no global warming in more than 18 years. Those claiming otherwise refuse to use satellite data or are very selective and frankly dishonest. NASA has been caught fudging the data several times. The data before that is suspect. There is no ocean rise. The ice caps have begun to grow again. The Great Lakes region is still rebounding from the weight of the last ice age and the planet has warmed naturally to melt all of that ice. \"Climate change\" is a natural phenomena and there is no evidence tying it to man. I believe that we are, of course, having an effect. Everything does. But to launch national and world policies based on junk science and hysteria is madness.", "score": 3}, {"body": "I suggest looking at the actual science, and the real reports, not FOX News and Breitbart.", "score": 3}, {"body": "According to NASA, 97% of climate scientists believe that global warming is happening and that it's caused by human activity. So, you're dismissing 97% of climate science as hysterical junk, yet you yourself are not presenting any hard evidence to support your position. Interesting.", "score": 1}, {"body": "\"First, we are suppose to live in a representative democracy not some sort of soviet ruled by the decrees of one man, legal or otherwise\".....A representative democracy means that we elect someone to represent our interests. Obama was elected by all the people twice.  \"But to launch national and world policies based on junk science and hysteria is madness.\".....You mention several things which you allege are facts, but do not include any references. You cannot provide references to support them because they are not facts.", "score": 2}, {"body": "Let's look at each side: The Obama administration is trying to pass a law that will overtime hopefully reduce greenhouse gas emissions, create a sustainable plant, and invest in clean energy. In contrast, the coal industry is trying to maintain a competitive business and continue to gain revenue from year to year. In the end, can you blame them? Maybe they have a misguided view of the effects on the environment, but from their prospective, they are doing what's best for them and the coal industry.   Perhaps a more reasonable way for both parties to agree, is to compromise. Today's energy industry should start investing in green energy. Because, even if they won't admit it, there will be a day not far from now when they will lose the battle. Compromise seems to be the best solution. But again, can we really blame the coal industry or call them unreasonable for trying to fight this proposed law? Not at all. ", "score": 2}, {"body": "Hmm, Let's look at the big picture. States with Republican state led legislatures and governors want to do away with Common Core Education. The aims of Common Core are to educate our children so that they are able to do critical thinking and share a common level of education. Identifying climate change and its affects and addressing the causes appropriately and effectively requires critical thinking. Also, leading a business which serves the public by providing a useful product and by being a responsible member of the community (whether as an institution or person) requires critical thinking. So instead of doing the critical thinking necessary to correct EPA's instructions, Republican ignore the problem, recite their deregulation mantras, and dummy down education so these problems won't be addressed in the future. In the meantime a lot of money needed for the education of our children and environmental protection will be spent on litigation in the courts. This is how the Republicans in all government offices serve American citizens.", "score": 4}, {"body": "The fossil fuel industry is beginning to grasp at straws to prove their viability.  The coal industry is dying a slow agonizing death that will unfortunately put folks out of work.  As we slowly begin to understand the humanitarian and economic costs of climate change, the tide will gradually turn.  West Virginia along with many other states need to set new goals to be part this future.  A lot of money will be spent and time will be lost as we struggle with this change for many years to come.   ", "score": 7}, {"body": "Nobody thinks the fossil fuel industry opposition to clean air has anything to do with jobs.  Establish new companies in these areas, and retrain miners to do those jobs.  Or put them to work fixing our roads and bridges, as in FDR's day.  Americans should be outraged that this is even an issue for the courts.  What a waste!  It's the air, stupid.", "score": 1}, {"body": "Ejzim, do you really have a three chambered heart or do you just read that way?", "score": 0}, {"body": "Go Laurence Tribe! Win one for the cause of limited government (i.e., America's founding principle).", "score": 4}, {"body": "The Clean Air Act will still exist. In all its massive glory. All Mr. Tribe will accomplish, should he win his case, is to further complicate the administration of regulations which is more or less a wage and employment support for lawyers. To achieve limited government we would need to eliminate that hundreds of laws on the books that provide perverse incentives to mine coal and burn it in the open atmosphere. A single example should suffice. If coal mines were required to escrow the eventual cost of returning public land to its original condition the price of coal would exceed that of virtually every other form of energy. What we are burning in these power plants is not just coal, it is our mountains, forests, rivers and streams.", "score": 0}, {"body": "This isn't a sports contest, nor is it Hollywood. Big names are irrelevant.", "score": 0}, {"body": "As Naomi Klein brilliantly argues in her book \"This Changes Everything\", the issue here is not legal but scientific and political: capitalism vs. the climate. What we are witnessing is corporate power claiming its right to keep destroying our habitat, and the life of our children, for the sake of profit; corporate power and its lackeys (the Republicans and a majority in the Democratic party) counting on right-wing judges to arbitrate against what the science has been telling us for over 30 years. THAT is class struggle, coming from above.", "score": 27}, {"body": "Do you guys really believe this nonsense?  There is no global warming, climate change or what have you.  It's a scam, a game to enhance the public coffers around the world at the expense of the American citizen.  ", "score": 4}, {"body": ".....and cigarettes don't cause Cancer.", "score": 17}, {"body": "Tell that to us on the west coast who, in Oregon have a 12% of normal snowpack looking to the south at our California cousins who have an 8% snowpack.  And your quaint little Rio Grande is already drink to a trickle.  Of course your opinion wouldn't be based on the fact that energy companies are now going after the high hanging fruit via fracking to get the last of Texas oil out now would it?", "score": 3}, {"body": "Yes and pigs fly.", "score": 2}, {"body": "Remind me again, why is the President's agreement with the Chinese, where they limit greenhouse gas emissions sometime after somewhere over the rainbow, matters in an era of near runaway pollution by the world's most populous nation?  And why Obama's failed domestic policy, not the least of why it failed is because of the lack of decent jobs over the past six years, matters anymore?", "score": 3}, {"body": "What is it with republicans always grasping at straws to defeat  the larger mission if all these federal agencies to protect the interests of American citizens at large? The EPA is charged with protecting the environment. The GOP apparently is chrarged with protecting their wealthy patrons only.", "score": 19}, {"body": "Regardless of the outcome, this question represents our increasing inability to process, to effectively navigate exponential accelerating complexity. Whether it's this, or today's umpteenth article about money in politics (The Upshot), or another article about species extinction or climate, we simply can't order, prioritize complex network relationships per all the billions of new people & all the new tech they wield that has unprecedented reach and impact in and across geo, eco, bio, cultural & tech networks. Cultural governance breaks down just as governance of the body breaks down with obesity &/or diabetes from new, more complex inputs, e.g.: The average intake of sugar that Americans consumed over five days in 1822 can now be had in one can of soda. (Bus. Insider) Code is infrastructure for complex relationships: genetic, legal, monetary, religious, moral, software, etc. In the transition from simple hunter-gatherer social structures to the exponentially more complex information architecture of city-states, we added writing, legal, etiquette, and monetary coding structures to our cultural genome. Humans using our two primary coding structures for culture's reality interface: monetary & legal codes, simply don't have the reach, the processing power, speed, and accuracy to handle these levels of complexity. Hence we get relationships wrong with: climate, governance, other species, etc. To survive, we need to add whole new coding structures to our cultural genome. ", "score": 7}, {"body": "Cultural literacy would help, too.", "score": 2}, {"body": "In the meantime we will just keep plugging along the best we can.  Now lets get rid of coal use and keep it simple for you.", "score": 2}, {"body": "We've been doing that, since Rachel Carson? How's that working out? Gotta do both. Gotta get down to physics / evolution fundamentals to better handle this: “There were 5 exabytes of information created by the entire world between the dawn of civilization and 2003; now that same amount is created every two days.” Eric Schmidt, former Google CEO Gotta think long term per our vastly expanded reach, and with a wider lens, like this: \"We need scarcely add that the contemplation in natural science of a wider domain than the actual leads to a far better understanding of the actual.\" Sir Arthur Eddington Keeping it fundamental for you.", "score": 0}, {"body": "The root of this issue is a law passed in 1990.  Remeber who was President in 1990? Right, George H. W. Bush. Lat time I looked, he had an (R) after his name on the ballot. But now President Obama wants to have the EPA issue a rule, so the law becomes a political football.  That pretty much says it all.", "score": 68}, {"body": "Just because a Republic was the president at the time a law was passed doesn't imply that a particular regulation passed today is within the scope of that law.", "score": 1}, {"body": "Joe you apparently totally ignored the \"secret\" agreement Obama recently negotiated with China the world's largest polluter where they have to do nothing until 2030 while Obama agreed to immediately start cutting US emissions.    This is the same President secretly negotiating with Iran over nuclear weapons.  ", "score": 1}, {"body": "Are they going to make this man go to war for every single thing he wants to do.  I have never seen such stupidity, pointless stubbornness, obstructionism, and--of course--personal venom and racism.  I am sick to death of this.  The entire seven years have been, thanks to our elected representatives, a complete embarrassment.  We are making fools of ourselves, at the very best.  I'm afraid we've gone way beyond foolishness and have become monsters.", "score": 234}, {"body": "I don't know what stocks you own but the ones I own allow me to vote for the members of the Board Of Directors. ", "score": 0}, {"body": "Your failure to see the similarities is problematic. I expect the president, legislature and court to check each branch for soundness of position. As a citizen/stockholder It's what I voted for them to do. ", "score": 0}, {"body": "The good news is we are just warming up.", "score": 0}, {"body": "I think it's great that the Republican party is firmly in the pro-pollution camp. I love it when party platforms are for sale.", "score": 64}, {"body": "I prefer to think of them more in the anti-Planet Earth camp. After all, it fits right in line with their opposition to everything else.", "score": 0}, {"body": "This is one of the first salvos in the left's scheme to tax energy use so punishingly that carbon footprints will shrink leaving the middle class sweltering in the summer and frozen in the winter.  It will not only shutter plants it will force the remaining to increase energy prices to a frightening degree because of Federal regulations.  A subpart of the same scheme will redirect much of the money collected to the poor so they will not be inconvenienced in any way by these crushing energy taxes.  The rich could care less, they can afford to pay the freight and not change one iota.  These taxes will be born by the vanishing middle class, which the left could care less about.", "score": 5}, {"body": "In reality this advances the discussion about how to implement an alternative energy policy.  Out with carbon.....onto wind and solar.  We progressives welcome the discussion to join with the rest of the world in moving past filthy energy sources and Koch Brothers income streams.  Maybe it is time you wake up and smell the pollution in your air and acknowledge the damage to come from global warming....", "score": 1}, {"body": "Jordan -- do I have a right to come on your property to dump my waste?  Do I have a right to force you to eat and breathe poisons so I can make money? Why do you think the coal companies have these rights? Have you ever been to China or India?  That's what America would be like if the pollution weren't controlled. Coal isn't really dying due to \"liberals\" or solar energy -- it's dying because of natural gas, and the Saudis forcing the price of oil down.   It's reality that is killing coal.", "score": 1}, {"body": "All true, but you leave out the biggest (though hardest to quantify) 'hidden cost' of all: TRILLIONS of dollars in losses this century and forever due to climate disruption, and spent in mitigation of the damages from climate change. Burning coal no longer makes any sense at any price. ", "score": 1}, {"body": "O.M.G. A couple of lawyers are about to decide the fate of Planet Earth. Dinosaurs will behave as in the past. But in the past dinosaurs were not responsible for their own demise.", "score": 33}, {"body": "Greed is a mental illness, and corporate America needs to be committed. This is insanity.  ", "score": 383}, {"body": "Efficiency, which is driven by profits, is the engine of progress that brings each generation more wealth, health and happiness. Why do you believe mankind has reached its pinnacle in 2015? As a conservative, I have more faith than you do in our fellow man and his or her ability to improve the lives of my children and grandchildren through capitalism.", "score": 0}, {"body": "Loving big government and wanting the government to rule you is mental illness. That is insanity.", "score": 0}, {"body": "But this is C-A-P-I-T-A-L-I-S-M ! The great economic GOD of the American Dream.", "score": 0}, {"body": "What about Obama's PROMISE of clean coal?  What's he going to do for the PEOPLE of the coal industry who he puts into poverty?  What are liberals going to step up to the plate? You made this mess liberals, you clean it up.", "score": 8}, {"body": "The \"clean coal\" nonsense was scrapped after billions had been poured in a project to \"scrub\" CO2. And natural gas — cheaper and cleaner — has been the driving force behind the decreasing demand for coal. But don't worry. There a lot of countries in Africa and South America that will jump at the chance to import coal and savage their environment.", "score": 0}, {"body": "\"You made this mess liberals, you clean it up.\"..... Even if you ignore the ugly slash and pollution caused by strip mining, it is estimated that pollution from the existing power plants adds about $100 billion dollars a year to our annual healthcare bill. Do you remember the recent coal ash spill in North Carolina and the MCHM leak in West Virginia that fouled the drinking water for hundreds of thousands of people? And how about the cost of acid rain, and we haven't even yet touched on global warming - even if droughts and extreme storms don't happen, defending our costal cities from rising sea levels will be enormously expensive. So tell us again, who made the mess?  ", "score": 1}, {"body": "\"\"As president, Barack Obama will establish an Energy Partnership for the Americas. This partnership will increase research and development in clean coal technology, the next generation of sustainable biofuels and in wind, solar and nuclear energy. The partnership will also look for ways for nations to coordinate to transport green energy across national borders.\" http://www.politifact.com/truth-o-meter/promises/obameter/subjects/energy/ rates this as \"promise kept.\" Walter -- the lawsuit is about the coal companies NOT wanting to use clean coal technologies ... what about this is hard to understand?", "score": 3}, {"body": "Doesn't the initial phrase, \"President Obama’s most far-reaching regulation to slow climate change...\" presume the CO2 regulation will actually slow climate change? Why isn't this article in the editorial section?", "score": 7}, {"body": "There is a very high probability that although climate change is very real, there is probably nothing whatsoever that human beings can do to slow it, let alone reverse it. We'd do better to sit down and make serious plans about COPING with it, rather than futile efforts to fight with Mother Nature.", "score": 0}, {"body": "The science is clear, overwhelming, and compelling that CO2 emissions by burning fossil fuels are raising the levels in the atmosphere and oceans.  CO2 is the primary GHG according to direct and experimental measurements. Your comment is merely ignorant at this point.", "score": 0}, {"body": "If a court can rule on a proposed regulation, how long before they decide to hear and decide on proposed legislation?   The courts need to wait until a final regulation is ready to be enforced.         What the court can't decide is how our planet will survive if greed is allowed to prevail over the health and safety of our citizens.  When they eventually do hear this case they should side with the EPA.", "score": 12}, {"body": "Most, if not all liberals talk the talk but NEVER walk the walk.  You want to move away from fossil fuels?  Great!  But you've actually no clue what that means.  If you did, you wouldn't be able to comment here on this, or any website.   It's time liberals put their money where their mouths are and stop using fossil fuels altogether.   Before you tell everyone else what to do.  Hypocrites.", "score": 9}, {"body": "Are you inferring that being Conservative means clinging to the past no matter how destructive?  Everyone knows that CO2 are destructive to the Earth, but it is more patriotic as an American to keep producing CO2's and destroying the environment?  ", "score": 4}, {"body": "So maybe you haven't heard that fossil fuels are a limited resource that will eventually run out. What are you going to do then, freeze in the dark? Alternative energy is both essential and inevitable. You don't have to be a dreaded Liberal, anyone who is half way intelligent plans for the future.", "score": 6}, {"body": "Well, my money is where my mouth is.  I use hydro-electric power combined with natural gas.  I drive a car that get 30 mpg.   I heat my house with wood. Coal is a money maker because US and local laws not only give it a tax break put pay the mines to dig it out of the ground.  It's called a \"Depletion allowance.\"  It the Coal Industry wasn't heavily subsidized by the government, it would go out of business. ", "score": 5}, {"body": "President Obama is waging a war against coal pollution and global warming, things that will save human, animal and plant lives. Senator Mitch McConnell of Kentucky is waging a war against the lungs of Kentucky's citizens and the Earth's lungs. This country's water and air would resemble China's national gray skies and gray water without the EPA. These legal entertain bringing back the 19th century and the right-wing thinking that goes with it. Free coal ash arsenic and mercury for everyone ! Drink up ! Big Coal, Big Koch and Mitch McConnell in a race to the environmental bottom.", "score": 243}, {"body": "Thanks, Socrates, for pointing out the untrammeled pollution in China and what it has done to their environment.  In the past year I have seen dozens of videos of the terrible smog in major cities in China, with pedestrians wearing masks to provide some protection.  Thanks to the EPA regulations we don't have that in most of our major cities.  But there is still a lot of health and life-threatening pollution in areas dependent upon coal-fired power plants.  It isn't as visible as in China, but all atmospheric tests show it is there.   Do you, your children or your grandchildren have asthma or other breathing issues?  If so, you should support the EPA regulations to reduce some of the pollutants you, your children and your grandchildren are presently forced to breathe. ", "score": 4}, {"body": "Why are Democrats so lumpheaded?  Half of the country will freeze to death or go broke trying to pay heating bills if Obama gets his way.  He really needs to spend a winter in the UP with a chainsaw and a wood burner, and a pile of government regulations to read.  I bet he'd burn them all.", "score": 10}, {"body": "I've been to the UP plenty and am not enthralled with the fate of the world resting on its livability.  ", "score": 1}, {"body": "I have relatives in northern Michigan who heat their home almost entirely with wood they cull from their own land (which is not huge). Otherwise, they use heating oil. They use electricity to run lights, etc. They get this power through the local electric company which combines sources from natural gas and coal. So, while reducing or eliminating coal would have some impact on them, it wouldn't be huge.  Listen, change is always difficult, especially for some people. But inventiveness is supposed to be key American trait, no? Look at all the changes our grandparents and great-grandparents experienced! My great- grandmother marveled that she was born into a world of horse-drawn carriages and lived to see men walk on the moon.  Instead of moaning all the time and resisting innovation, I wish we could recapture some of that spirit of foreword thinking. ", "score": 1}, {"body": "Here in CT (likely the whole Northeast) we have advisories on how many fish can safely be eaten when caught from our local waters - due to the high levels of mercury they contain.  Hunters are advised not to eat deer livers that might contain high levels of mercury.  The major source of this mercury?  Coal fired plants in the Central states that built their smokes high enough to carry the smoke and its toxins far enough away from their own states.  We get it as a constant fine precipitate onto all our lands and waters, where fish and deer and us become the repositories.  It's long overdue for all Northeasterners to raise Holy Hell - and righteously so.  Yet, we barely make a peep while the coal industry raises Holy Hell against President Obama for daring to lessen their profits.  If roles were reversed we'd see the Republican Party and coal states seriously talking secession. ", "score": 148}, {"body": "Anti-coal proponents are usually also anti-nuclear proponents. Not to mention anti-oil proponents.  In that regard, pray tell, how does a single mother of three get through the day? Bicycles (manufactured parts in factories), wood burning stoves (smoke and particulate pollution) and breathing and moving more slowly ( still generating CO2 emissions) ?", "score": 0}, {"body": "It is again the case that the most backward states are impeding progress and holding the rest of us down. I have to say that I am getting really sick and tired of this dynamic. I realize that wealthy energy companies are paying for this lawsuit, but without the support of West Virginia and other state governments, politicians, and yes, voters, they wouldn't carry the same punch. As a nation - indeed as a planet - we are not going to survive if we are always overwhelmed  by those who are mired in the past and lack any sense of vision for the future. ", "score": 67}, {"body": "It's not so much the state as the energy business interests that run it. This poor place is more like a third world country than half the well-meaning commenters realize.Timber and and coal barons from out of state took it all away, as the Prine song says, and left the American Kool-Aid behind. Wake up everyone--it's systemic; it's greed. The energy goes to you and your big big way of life and you think it's due to backward hillbillies or something.", "score": 4}, {"body": "Nationalization is the only answer for ending the life these giant corporations that lust for ever more profit and power. They are fueled by insatiable greed with no care for the planet or the people they are destroying. Radical measures are necessary if we are to survive as a civilization.", "score": 22}, {"body": "West Virginians would not care about coal mining as a employer or industry, if they had other really good jobs to go to. So instead of worrying about coal companies, how about we nationalize Apple Inc., and force them to bring back all iPhone and iPad manufacturing from China, and instead assemble these items in West Virginia? Maybe move their whole base of operations from Palo Alto to Parkersburg, W.Va.? What? they wouldn't like that? it wouldn't be fair? Don't mess with your precious iPhone?", "score": 1}, {"body": "Yes, thank you impedimentus. You are absolutely correct. I have been reading and thinking about fossil fuels for about 50 years; I have a Ph.D.in the sciences which helps me analyze the data.  There is  no way politicians are going to tackle the fossil fuel/global climate change crisis which is upon us and has been upon us for many years. We need not debate the cause or reality of climate change; that is now a waste of time. It will need to be a bottom up \"revolution\" of some sort and nationalization of energy will be needed-- our capitalistic system has failed us in this regard. We need a new economic model for surviving. I will be joining the revolution; let us all hope it is a peaceful one. As the all powerful fossil fuel companies are forced to expand into more dangerous and destructive extraction techniques (fracking, tar sands, horizontal drilling, the natural gas myth, etc) more and more people and communities will feel, smell and taste the pain and see the climate changing and costing them plenty. Let's get the revolution started. Remove your politicians who do not discuss energy, the filthy fossil fuels and climate change. ", "score": 3}, {"body": "Or, at least, we need laws establishing unique and discrete procedures for enacting environmental reform. There is no time for these issues to remain mired in politics. The pressing need for reform deserves better. We need somehow to isolate these issues from the obviously and unabashedly selfish influence of monied interests in the energy sector. It is absurd that our planet's health has come to be cast as a left vs. right issue. It is not. It is the struggle of a few very wealthy people to hold onto their bloated incomes before they leave the earth, and we are paying for this each day with life of our planet.", "score": 0}, {"body": "Is there anything in this country that does not go to court? Having scientific issues debated by lawyers in kind of scary. ", "score": 40}, {"body": "So, what are you saying, that scientists should be above the law? Are they superhuman, and therefore less prey to human failings, than mere mortals?", "score": 0}, {"body": "If Obama was in favor of the argument in behalf of the coal industry, the GOP would oppose it and claim that Obama is a polluter .", "score": 43}, {"body": "How many of you who side with our President and truly want to mitigate global warming drive gas guzzlers and live in drywall palaces. My point is that it's up to us to start the change and we can't rely on corrupt judges. We can all drive highly efficient vehicles but all I see are SUV's and pick ups, some of which cost almost as much as a Tesla. We can all demand housing that uses a tenth of the energy to heat and cool as presently constructed homes. Obama is the best president of my 60 years on this polluted planet, but it's still our resposibility to affect change. ", "score": 90}, {"body": "Why don't you go look up some actual facts and get back to us on that?", "score": 0}, {"body": "While I think Obama is the worst President of the last 45 years, I otherwise agree. Lefty liberals talk the talk, but rarely walk the walk. They pollute like crazy. They buy expensive Apple products made by slave labor in CHINA. They take vacations by airplane every year. They eat luxury food products imported from far away. They live in large, expensive homes and drive expensive cars -- yes, SUVs and Jeeps and huge minivans if they have kids. They are not giving up their hipster enclave in Brooklyn, in order to go live in West Virginia, just because it would be good for the national economy or more fair. They are not going to stop vacationing in Aruba or going to Paris or cut out that ski vacation. Basically their idea of \"economic justice\", is to stick it to everyone else. That's how we got the horror of Obamacare.", "score": 1}, {"body": "My Honda hybrid is great.  Plenty of energy efficient on the roads in my state.  We GET it and clearly you are still ranting and blind to reality.", "score": 4}, {"body": "The coal companies are optimistic that the judges will rule in their favor because they're Republicans?  I can only hope the judges have grandchildren that they love and that they read the latest scienctific reports about Greenland's ice sheet melting into the North Atlantic, then vote against coal.  Because if we keep burning coal, our grandkids' futures are not very optimistic.", "score": 315}, {"body": "Very few judges have any scientific literacy at all. It is highly unlikely that these judges, or any judge on the U.S. appeals courts, have anything more than the sort of rudimentary, \"scientists disagree\" confusion encouraged by most newspapers and TV networks in the nation.  One hopes that climatologists have filed amicus briefs in the case in an effort to educate them. However, being lawyers, the judges are likely to be excessively sure of what they know, too, and may well be inclined to disregard what scientists say about Earth's climate and its ongoing changes.  Besides, all three of those who heard the case today were appointed by Bushes. That does not inspire confidence that any of them would care what scientists know or that they would stand in the way of the industry's desires. Throwing out the regulation would mean that our civilization's headlong rush into atmospheric conditions unlike anything Homo sapiens has ever experienced will continue apace, with devastating consequences rapidly becoming more apparent. I am not optimistic that lawyers, whether in Congress or in the federal courts, will get over themselves enough to take it seriously. Especially Republican ones.", "score": 1}, {"body": "Actually, yes, we are most likely now in a unit of geologic time known as the Anthropocene precisely because our species is so incredibly dominant over this planet that its natural processes are being severely impacted by our numbers and our activities. Earth's climate is prominent among the noticeable areas of our influence. As has been known for well over one hundred years, the addition of carbon dioxide, as well as methane, to the atmosphere will cause the heat-trapping tendency of that envelope around the planet to increase.  And, yes, Republicans show no concern for the ecological function of this planet, no concern for the fate of other organisms, not even much concern about what is in store for humanity as human-caused warming of the atmosphere continues. They are irresponsible, reckless, and anti-science, and the GOP view on environmental issues, especially climate, is appallingly immoral and ignorant. Volcanoes, the sun's energy output, and \"wobbles' are not responsible for the change in our climate now underway. Deal with reality, Sunny 20.", "score": 1}, {"body": "Better yet would be for the judges grandchildren to read, in full detail, all the health problems of those who live near to or work in the coal mines.", "score": 0}, {"body": "An article about an important case to appear in the courts. This is a case that will depend on the wording of parts of the Clean Air Act and how the EPA interprets that wording.  Yet The Times couldn't cite the wording in the act? The Times couldn't explain the basis of this case? Why confuse people with the facts or the background when unfounded politically biased bloviating is much more entertaining...  Has The Times sunk to the level of \"He Said, She Said\"?", "score": 9}, {"body": "No conservative takes 1% of what is written in comments here very seriously.", "score": 0}, {"body": "Every household and business, other than Big Carbon, must pay for waste disposal. Big Carbon is claiming a divine right to use our shared atmosphere and waters as it's own, private, free, toxic waste dump. ", "score": 78}, {"body": "It's very difficult to even begin to try to get one's head around the fight of monied interests against the very survival of the human species.", "score": 289}, {"body": "CR, Solyndra defaulted on a loan because they could not compete with the Chinese. Has that ever happened to a US company before?! Gasp! Instead of trotting out your tired, Fox News false equivalency, why don't you wake up and see that we all need to work together to save the air we breathe! That would be much more helpful.", "score": 7}, {"body": "This just show how dangerous out of control greed is. Our culture simply worships the golden calf, and values money over life. It is an addiction like any other, and if that isn't recognized, we will continue our downward spiral.", "score": 5}, {"body": "Hyperbole does not help.  The problem is bad enough, but a 200 foot rise in sea level will not wipe out humanity.  ", "score": 0}, {"body": "West Virginia is leading the charge against life as we know it on planet Earth?  Really, West by God Virgina?  What's wrong with this picture?  What's wrong with our political system that the greed and rapaciousness of mountain removal coal mining companies trumps the reasonable protections that the government seeks to provide to all its citizens.  How is this even a question worthy of the court's time?  This would seem to expose the truth that it is no longer the people who control the government but the corporations who have bought the leaders and judges and now seek to pull on their puppet strings.", "score": 335}, {"body": "West Virginia is a making a science and fact based decision. The non-scientific and emotion based attacks and extreme hyperbole (a favorite tactic of the left) are pathetic.", "score": 1}, {"body": "Opponents or the regulations are optimistic about the outcome because the three judges hearing the appeal  were appointed by Republican presidents. There, in a nutshell, you have the heart of the problem, with a politicized judiciary that goes all the way up to the  Supreme Court. What happened to those blindfolds on all those statues?", "score": 232}, {"body": "I see this as a good thing, since I believe the coal lobby will lose.  The U.S. courts -- even the right-leaning Supreme Court, which sided with the EPA in 2007 with a ruling that CO2 is a pollutant -- have been consistently on the side of science on this issue. ", "score": 20}, {"body": "I thought that about the Hobby Lobby decision....", "score": 1}, {"body": "It's 2015.....time to move away from fossil fuels.  I'm with President Obama on this.", "score": 178}, {"body": "More negatives against the POTUS; is there nothing else to work on, no other problems to solve...I mean really, the resources put up to simply bash President Obama is incredible", "score": 79}, {"body": "If these corporations are fighting to pollute, they should be held accountable for the damage done to the environment and to people's health. States should bulk up their Environmental Police units and make cases where they are to be made. It's only fair if corporations want free license to do as they please, spend as they please - like a person without a conscience - so to should they be legally liable for the harm they cause. ", "score": 79}, {"body": "If the big oil/coal companies paid for the true cost of their products they wouldn't be nearly as profitable.", "score": 1}, {"body": "I totally agree. However, we are fast approaching the tipping point where the damage to the planet can't be stopped and won't be recoverable. It's time to stop it, not simply compensate for it monetarily after it's done.", "score": 0}, {"body": "The coal-fired Mount Storm power plant in Tucker County, WV should be converted to high effeciency combustion of local natural gas, or closed down. Short-sighted policy doesn't create jobs and and technological innovation.", "score": 27}, {"body": "So the opponents of the rule are counting on partial judges, put in place by Bush pere et fils, to rule according to their politics rather than on the legal merits.  That's what the penultimate paragraph of this article tells me. Does anybody still not understand why the Presidency is important?  Or why the Republicans are refusing to vote on Obama's nominations?", "score": 163}, {"body": "And why, all other thoughts/feelings/misgivings/etc/etc/etc aside, it is absolutely critical Clinton is elected in 2016. ", "score": 1}, {"body": "good question. too many people don't know the question much less the answer. the electorate is neglecting it's role in our democracy and the effects are all too obvious.", "score": 0}, {"body": "Is there any issue that the GOP has foresight and vision for our future?", "score": 133}, {"body": "Hardly surprising. The right-wing opposition-to-the-mat approach has marked pretty much everything the president has proposed since being elected in 2008. When they lose politically, they take it to the courts. These are the same people, of course, who oppose \"legislating from the bench.\" What baloney.", "score": 111}, {"body": "It is not baloney, it as a crime!", "score": 2}, {"body": "The coal companies can kick and squirm all they want, but the fact is renewables can now produce energy as cheaply as fossil fuels, if not cheaper. The writing is on the wall for these dirty fuels and nothing can stop the renewable revolution from continuing apace. ", "score": 126}, {"body": "Mark, like you I am a huge fan of renewables, and actively support \"going solar\" in my community, and supporting wind power development off our coasts and on our ridgetops.   We do have to invent a better currency of comparison though, than cost per kWh, or power industry people will not take us seriously.  Power sources have attributes:  some sources (gas turbines) can be called upon quickly by grid operators, some cannot but are extremely steady (nuclear, coal), some are steady but mean century-duration alteration to rivers (big hydro).  And so on.  Coal is cheap when we measure the fuel alone.   These attributes mean you cannot substitute one for the other in an unthinking way.   So yes, wind and solar are now cheap per kWh, but wind is not predictable and solar is not steady.  They are cheap because they are \"subsidized\" in a sense, by the existing grid.   Reminds me of all the bicyclists on the road and their subsidy from cheap asphalt (cheap because its a waste product of oil refining, to make gasoline for the cars some bikers despise!)  The point is, to really scale up renewables requires other components, storage, and significant modifications to the grid, to allow them to replace existing sources.   The current price per kWh does not tell the whole story.    ", "score": 1}, {"body": "Except is they obstruct renewables. Don't put it past them. They will, and have.", "score": 3}, {"body": "Eric, you are a smart guy and that was a beautifully constructed comment. Please resubmit it hourly, maybe it will sink in.", "score": 0}]