[{"body": "When I was first asked to perform the National Anthem for Phil Berger’s inauguration as NC’s Senate Pro Tempore, I was honored. I grew up in Eden, NC, about one block from Phil Berger, and considered both him and his family close friends.  Had I known the destruction Phil and other Tea Party leaders would wreak in the coming years, I might not have been so enthusiastic. The systematic devaluation of personal freedoms rammed through the state senate under Phil’s leadership has negatively affected my entire family, including me and my two brothers, all of us gay, and my mother, who's career as a lifelong teacher has been devalued under Phil's leadership. This national spotlight on my hometown is hard to read, but at least the conversation is changing, albeit very slowly. I am who I am today because of the people of Eden that pushed me to heights I never could have reached on my own. These are good people that I respect a great deal. I'm hopeful that the people I grew up with and who are quoted in this article – as well as those who might share similar opinions elsewhere - can one day realize the issue of gay rights to be one of equal rights.", "score": 4}, {"body": "I admire Mr. Kallam and his colleagues for having the courage to step down from jobs that would require them to do something they strongly disagree with. I'm not commenting on the correctness or appropriateness of those beliefs, just the way they have acted on them. They did not refuse to do a job while trying to stay in it, they have not embarrassed or humiliated gay couples coming to them, and as far as I can tell, they are moving on with their lives rather than using their experience as a platform to go to court, hold rallies, appear on talk shows, etc. Once a person begins to make a living by providing a public service, they should provide that service to the entire public, not just the segments they like. If they cannot, they need to find another line of work. Mr. Kallam appears to have taken that route, and I appreciate that.", "score": 6}, {"body": "There is only one opinion that matters. One place He wrote was the Epistle of Romans chapter 1 verse 18 to the end of chapter.  God goes on, also, to define Christian behavior in great detail throughout the New Testament. There is one message, LOVE. Love God and love your neighbor. God gives us free choice and unconditional love. He then calls us to the same standard. When you net it out God set some standards and calls us to act accordingly. He actually empowers us walk it out. Interestingly nowhere in the New Covenant relationship are we told to base our relationships to non-believers on the conditions of their behavior.  God says he can handle the world. We can speak the truth of the Bible and walk in unconditional love. This is not contradictory. We did not write the Bible and the author can defend it. Our mission is different. It is to communicate the love of God to all. So our tone should reflect that love.  Mutual respect does not mean a need to agree with all behavior.  Nor is there a need for militant reaction on either side of the issue of same-sex marriage. ", "score": 2}, {"body": "These \"Christians\" flock to their Bibles for their self-proclaimed \"Sacrament of Marriage\" and throw them on the junkpile when they turn to civil law to get the \"Sacrament of Divorce\".", "score": 7}, {"body": "Interesting to see that those who claim that gay marriage is somehow sinful don't seem to understand the Bible they hold so dear.  The first gentleman claims Sodom and Gomorrah shows what happens if you allow gay marriage.  Sodom and Gomorrah is about not giving hospitality to strangers and never once mentions gays.  Jesus, of course, never mentioned gays at all. These same people will be fine if divorced people marry.  Divorce is clearly labeled a sin many times in the Bible. The same with people who have tattoos, eat shellfish, shave their beards, wear clothes of two cloth types, and aren't virgins.    How conveniently they ignore their own sins .", "score": 6}, {"body": "The only people with gay marriage are the closet gays or borderline gays.  This is what I tell people:  If you are a man and see two man kissing each other and think it is attractive then you are gay.  If you see a man and a woman kissing and you look at the woman and ignore the man than you are straight.  If you look at the man then you are gay.  I have no problems with gays because I am straight even though I wish I was gay.  However, if you are religious and you are around gay people it makes it harder for you to live your lie, I mean your life.   ", "score": 0}, {"body": "Mr. Kallam at least did the right thing by resigning. That was his choice. But his devotion to some man-created age old text shows his naivete. The world is changing, and if Mr. Kallam doesn't want to accept change, fine. He resigned. But his ilk are on the waning side - I do hope that some of his relatives, grandchildren or the like come out as gay. It will serve him right.", "score": 2}, {"body": "it's amazing how people will allow their rationality to become subservient to a book they must think was written by a supernatural being.  and then be willing to impose the book's dictates upon other people.", "score": 6}, {"body": "Mr. Kallam is apparently is ok with drunken incest, though.  His citation of Lot's story in Gen., Ch. 19 leaves out the aftermath of the destruction of Sodom and Gomorrah.  Once the angels save Lot, his wife and two daughters from the destruction of the city and Lot's wife is turned to salt, the three traveled as strangers to a cave near Zoar, where the older daughter said, \"Come, let us make our father drink wine and we will lie with him, so that we may preserve offspring through our father.\"   Anything buy gay sex, I guess.", "score": 7}, {"body": "The Pentateuch is nothing more than a touch of history elaborated with tribal mythology.  It is not substantially different from Norse, Celtic, Slavic or any other tribal mythology.  Teaching tribal mythology as God's word is one of the greatest possible sins, if God indeed exists.", "score": 7}, {"body": "Three cheers for the true Christians.  Mr. Thigpin is a true believer, they are few and far between, sadly.", "score": 1}, {"body": "Could someone clarify this for me - are magistrates only here to marry Christian couples? Why is John G. Kallam Jr. not in legal trouble for wielding a bible and using it to justify his inability to perform the duties of his office? How shameful!", "score": 9}, {"body": "The traditionalists claim that marriage has always been between a man and a woman. Not so. Marriages in the ancient world were often polygamous - not between one man and one woman but between one man and many women. When there was but one formally recognised wife, a man might have several openly acknowledged concubines – and enter into complex arrangements with other powerful men that do not fit neatly into the one-man-one-woman narrative. We see this in the story of Abraham, Sarah and Hagar, where Abraham hands over his wife Sarah, who is also his sister, to Pharaoh for Pharaoh's sexual purposes. From this transaction, both Abraham and Sarah subsequently prosper greatly, setting them both up nicely in Canaan, with slaves, cattle and other booty extorted from Pharaoh as the price of leaving the unfortunate fellow alone. Then, at Sarah's urging, Abraham mates with Hagar, Sarah's slave, who was likely part of the pay-off that the long-suffering Pharaoh had given Abraham and Sarah on the condition that this early-day Bonnie and Clyde pair would stop plaguing him. Further, in North Carolina today, under the provisions of Chapter 51 – 'Marriage' of the North Carolina General Statutes, a boy and a girl, both aged fourteen, thus not a man and a woman in the accepted sense of the terms, can get married if the girl is pregnant [1].  So much then for the one-man and one-woman doctrine. 1)  http://www.ncga.state.nc.us/EnactedLegislation/Statutes/PDF/ByChapter/Ch...", "score": 8}, {"body": "Why is this so complicated?  If someone is either elected or appointed to public office, they are expected to follow the Constitution of the land, not the Bible.  If they find they cannot do so, they certainly do have the option to resign and allow the seat to be filled by someone else.  I'm all for freedom OF religion, but even more, I'm for freedom FROM religion.  Somehow, the words, \"Congress shall make no laws...\" keeps running through my head.", "score": 10}, {"body": "Don't worry, anti-gay marriage Christians, all SCOTUS can do is make civil marriage legal. Your sacramental marriage will remain Old Testament-compliant until the second coming, when Christ will refuse to rapture you up into heaven for being spiteful to your fellow man.", "score": 11}, {"body": "“I don’t want to force my religious views on someone else,” she said. “If they can prevent people from marrying who they want, they can keep me from going to the church I want.” Kristina Bailey gets it.  Unfortunately, a few of the people commenting here do not and all those pushing to maintain laws against same sex marriage or to allow government officials to refuse to carry out their duties because of their beliefs do not either.  They equate allowing other people to have the same rights that they have as having their religious liberty \"trampled on\".  No, having their religious liberty trampled on would be, as Ms. Bailey realizes, when someone tells them they may not attend the church of their choice.  Or when the church of their choice is not allowed to hold services in their town.  Or when they are put in prison for being whatever religion they are.  Or when someone wants to murder them because of their religion.  Their religious liberty is 100% intact when two men or two women marry each other.", "score": 8}, {"body": "A few thoughts: a) Sorry, but Sodom and Gomorrah is about males raping males. b) Since so many States previously allowed Same-Sex Unions with     the right to adopt, and now States allow Same-Gender Marriages     which allow for adoption/children born to one of the Spouses. The     Courts is going to rule in favor of States being mandated to allow     Same Gender Marriages. c) No the Constitution does not mandate Same Gender Marriages any     more than it mandates Polygamy, or a 12 year old marrying 30 year old.     But you can bet that Federal Courts will face those issues and be     hard pressed to turn down the couples/groups if they use the same     argument the Federal Judge used to rule agains Proposition 8:     The couples were happy, the children - adopted or not - were happy,     society did not seem adversely effected, the State had no compelling     reason to deny the marriage... d)  It is sad that this issue could not have been resolved over time,      by State Legislators/Popular Referendums instead of being      imposed by Federal Judges on very weak Constitutional Grounds      that wholly violate the 10th Amendment. e)  Yes, there will be laws forcing those who rather not have to      provide services to Same Gender Weddings/Anniversarys      to do so or be fined. A wonderful violation of the Freedom of     Association.", "score": 0}, {"body": "Marriage is a legal contract between consenting adults.  That's not going to change. No religious organization has ever had to perform wedding ceremonies that they don't approve of.  The Catholic Church has always refused to perform ceremonies for divorced people and no one challenges that in court and if they did they would lose. You appear to be remarkably uninformed.", "score": 6}, {"body": "Kallam quit his job.  That's acceptable.  As for this Berger bill... that's only acceptable if it also allows any homosexual in the state to opt out of paying any state taxes.", "score": 4}, {"body": "The bigots just won't give up. We straight people must realize that others deserve equal rights. Used to be that it was illegal for blacks to marry whites.  I guess the bigots want to go back to that era.", "score": 9}, {"body": "We are a secular nation. Everyone has a right to sit at the counter of their choice.", "score": 9}, {"body": "These winds of change carry a stark example of our country's beauty.  If only Syrians could poke fun at the religious extremists in their midst, and send them pouting into retirement.", "score": 2}, {"body": "Opponents seem to confuse gay sex with gay marriage.  They have very little correlation. The state does not really care if you are having gay sex in or out of marriage.   Sex will continue whether or not they are married.  Alternatively, lots of married people have little sex. So, quite regardless of whether they think gay sex is a sin, it has absolutely nothing to do with whether or not gay marriage is a sin.  The state does not care whether or not you love your intended spouse or whether your are or will have sex with them, or raise kids with them. Not to mention that none of that has any bearing on whether of not gay marriage should be legal and whether a public official should be required to carry out a legal administrative procedure.", "score": 4}, {"body": "The phrase, \"out of touch\", appears in some of these responses. Not only is the nation split (with 56% in favor of marriage equality; 44% opposed or indifferent), the drop out in our churches (and in our clerics) reflects being \"in touch\".  Hence, we are no longer resemble the English colonies of hypocritical, as well as neurotic, Puritans.  Thank God.", "score": 3}, {"body": "Same-sex marriage opponents are their own worst enemy. Years ago same-sex couples were trying for civil unions, just being able to have the same rights as heterosexual couples. But conservatives fought against it, and won. So same-sex couples gave that up and went directly for marriage rights, and are winning by a mile. Now conservatives are already talking about what to do when it's legal everywhere, passing \"religious freedom\" laws. And I'm calling it right now, all they're going to accomplish is bring the anti-discrimination fight to the public eye. It won't be long before sexual orientation and gender identity are protected classes in the United States as well (as they should be). All thanks to a few people who hate gays and don't know when to quit. ", "score": 10}, {"body": "Many people are surprised at how rapidly opinion has changed on same sex marriage--they should not be. Nearly a century of contraception has paved the way. Morally there is no distinction between a gay marriage and an opposite sex marriage which is intentionally rendered sterile through contraception. This fact has slowly dawned upon the general population as well as the realization that,consequently, the definition of marriage has de facto changed. The homosexual mantra \"Love makes a family\" is now well established.", "score": 3}, {"body": "Hey Christians, I am confused. What do you stand for again? Is your religion all about gay marriage and abortion? That's all I hear about from you besides the annual \"war on Christmas\" stuff. What is your stance on perpetual wars, growing poverty, destruction of our \"God-given\" planet, GREED, and materialism? If you want to be taken seriously, why don't you try to focus on the true evils in the world instead of trying to get in the way of people wanting to have a ceremony celebrating their love and commitment? You may just find that we would all be on your side after all. ", "score": 36}, {"body": "I would argue that it is unlawful for government to be involved in marriage at all.  Marriage is clearly a religious activity and as such is none of the government's business.  Governments should neither issue marriage licenses nor records them. Now clearly that would create problems, but I suggest that the proper activity of government would be to issue and record only \"civil union\" licenses as it has issued marriage licenses in the past.  Every place the law discusses marriage should be amended to civil union, and everyone would be happy.", "score": 1}, {"body": "Marriage is a legal contract.  When a couple gets divorced and needs to divide assets etc. they go to a lawyer not a member of the clergy.", "score": 2}, {"body": "\"Marriage is clearly a religious activity\" Does this mean atheists can't marry?  I married my wife as an affirmation of our love and commitment to one another.  No deity was involved.", "score": 5}, {"body": "I have never read the Sodom story (Gen 19) until today.  First what a horrid tale, demeaning to woman (conniving), and a justification of incest!  The interesting part regarding the US South is the scene where the mob comes to Lot's house and demands his guests.  This is the part that supposedly implies homosexual intent, but to me rings of mobs surrounding jails in the South, demanding a prisoner and then hanging the prisoner, who always seemed to just happened to be black.  Perhaps this is why the story has such resonance in that part of the world. A much simpler reading of the story suggest that Xenophobia is what drove the mob, as there is much mention of woman and children in Sodom. As a geologist I must add that the fire and brimstone that rained down on the city sounds a lot like a volcanic eruption, and given the suggestion that Lot's wife was turned to a pillar of salt is not surprising as there are many salt volcanos in the region.  Two more examples of where natural phenomena were given supernatural explanations before scientific studies proved their true nature.   ", "score": 19}, {"body": "I've got news for whoever made up that map of where gay marriage is legal - if it's legal in NC, then nobody knows because gay weddings haven't been reported in the papers.  Instead, government employees, paid with tax money, may be allowed to opt out of performing weddings or issuing licenses. Gay people pay taxes, too - you can't accept their money in your paycheck but refuse to serve them.", "score": 14}, {"body": "I see no reason for a conflict on this issue. Lets institutionalize reality. On this of all issues we should be completely libertarian. No government needs to regulate marriage. Once there was a faith-based reason for marriage. That is no longer true, and neither are marriage laws enforced. Privatize marriage. Shred all records, lift all licensing, and remove all mandated benefits and protections. Let all define marriage as they wish, and let all recognize marriage as they wish. The one and only interest and duty government has is for children. Let the government establish a new civil right; that every minor child has a right to the material support of the parents or sperm/egg donors that constitute the child's genetic inheritance.", "score": 0}, {"body": "I hope the Supreme Court decides that if government benefits are extended by a state to heterosexual couples those same benefits must be extended to homosexual couples.   It has to be all or none.    At the federal level this may already be the law.    And all states must honor the laws of another this is basic fair faith and credit.   Denying state benefits such as tax estate etc to hetero couples if not also extended to homosexual couples will get this issue resolved quickly once and for all.   This doesn't mean \"sacred\" church sponsored marriages are impacted.   That's beyond the scope of the civil tax and estate laws that apply to everybody.  If you're a church member have a church wedding.   Just don't expect special treatment as a result.", "score": 6}, {"body": "John G. Kallam disappoints me. For someone who carries a Bible and believes Scripture is unequivocal, he sure doesn't know his biblical facts. In Sodom and Gomorrah, sex was used as an instrument of violence, not pleasure. It has nothing to do with \"God hating on gays.\" Even if people point to Leviticus, God said only gay male sex is a sin ONLY for the people that were about to enter the land. Does that mean God only hates half of the gay population? What about the female gays? And in that same chapter, he calls all women on their periods unclean, and therefore a sin. Does that mean women are sinners? Why do people think they believe Scripture is \"unequivocal\" yet pick and choose which lines to live by? ", "score": 18}, {"body": "I'm a Christian. This article reminded me how deeply offensive it is to call other human beings' loving relationships a \"sin\" ... I don't even categorize it as a \"belief\" but a pathology.", "score": 16}, {"body": "Thank you for speaking up.", "score": 0}, {"body": "God/Jesus didn't write anything in the bible. The apostles did. My God abhors comments such as those which deny the rights of All of his children.", "score": 10}, {"body": "Sodom and Gomorrah had nothing to do with same-sex marriage, it was a story of a cursed people who treated strangers with disdain, even threatening strangers with rape. Some people will go to any length to justify their bigotry. ", "score": 16}, {"body": "Kristina Bailey is a smart woman.  She has realized something that many Americans sadly never do-- the meaning of Liberty.  Liberty means that I get to be who I want to be, because I help to ensure that others get to be who they want to be.    Remember that next time you're feeling intolerant of someone's decisions about their lives, that really have no bearing on your own.  If you attempt to limit their personal liberty, you have invited others to limit your own. This simple truth is founded in the Golden Rule, which itself is the foundation for all major religions.  Advocate for personal liberty-- yours, and everyones.  ", "score": 16}, {"body": "So they don't believe that gays should be married and want to impose their beliefs on others? Fine.  I believe religion is nothing but a scam and should be banned. Get it now Mr. Kallam Jr.?", "score": 17}, {"body": "Why don't those who want to impose their beliefs on the rest of us just take care of their own business and stay out of mine?  Religion can be the root of all evil in the world.", "score": 5}, {"body": "Someone needs to tell Mr. Kallam what the story of Sodom is really (and obviously) about -- radical inhospitality in the form of sexual violence.  Perhaps then he'd feel OK about marriage equality.  Seriously, does he really equate gang rape with marriage?  And as for that other oft-trotted-out verse in Leviticus, does he really think gay men \"lie with\" men as with women?  Or that lesbians do?  But no matter his particular interpretations of the particular bible of his particular religion -- legal marriage is a civil, secular matter, not a religious one.  If county clerks and other employees of civil government can't keep their religion out of their jobs, perhaps it's best that THEY be out of their jobs.", "score": 13}, {"body": "The law of the United States of America is the Constitution of the United States. Along with this we have the Bill of Rights. The Bible is neither of these documents therefore it does not apply . Period. ", "score": 17}, {"body": "\"An appointed county magistrate, Mr. Kallam was obligated to perform civil marriages whether they were same-sex or not. So he resigned,\" That was the idea. Bye-bye, Mr. Kallam.", "score": 15}, {"body": "Great comment by Kristina Bailey, a Christian: “I don’t want to force my religious views on someone else,” she said. “If they can prevent people from marrying who they want, they can keep me from going to the church I want.”", "score": 16}, {"body": "Superb writing by Erik Eckholm. I've lived in Greensboro. Many country roads are named from a church. If one bikes a country road, he or she will climb a hill to a crossroad with nothing but the church there.  In towns named like \"Eden\". Erik has well described the environment.  In that light, there are liberal enclaves such as Greensboro or Chapal Hill that have held their small liberal establishments since the civil rights protests of the '60's.  And, truth to be told, in the small towns in the outskirts, there live same sex couples.  And the communities accept them, in their own ways.  In Erik's fine article, simply substitute the word \"black\" for \"same sex\".  Christians will once again accept the true message of Jesus Christ instead of using it to discriminate to support their own selfish fears. The time is now. ", "score": 7}, {"body": "All this because uneducated rubes base their reasoning on a book that is mostly fiction.  The idea of a constitutional amendment to protect the sanctity of marriage does intrigue me, however.  It should clearly state that divorce is illegal.  What do you think, Newt?  Rush?", "score": 7}, {"body": "Perhaps it's because I'm still stinging from my tax bill that I thought of this. But it seems to that if gays cannot take advantage of the same rights as straights, then they should only be taxed a representative lesser amount.  Anyone who  can be legally treated like a second class citizen should not pay full fledge citizen rates. ", "score": 7}, {"body": "I believe that there are many of our fellow citizens like Mr. Kallam who would be shocked to learn that the Constitution contains more than two amendments.", "score": 11}, {"body": "“Sodom and Gomorrah, that story alone tells you what God thinks of same-sex marriage,”. from this dude, you see how dangerous it is to literally interpret the bible as if it were a story book. The issue with sodom and gomorrah back in the BC days was about hostility,  violence and rape by savage people which inlcudes gang raping both men and women to fully demean and humiliate their enemies. Where did he come up with the story being about same sex marriage? Same sex marriage   didnt even exist back ", "score": 12}, {"body": "Marriage is a legal construct and is only a religious one if people choose to make it so.  Mr. Kallam, and people like him, need to learn the difference.", "score": 6}, {"body": "I really do not understand how anyone can say \"what God said is...\"", "score": 9}, {"body": "Mr. Kallam seems prepared to do the right thing according to his conscience by resigning.  Mr. Griffith also seems aware of the difference between marriage as it will be (I hope) defined by law and marriage as he and his church understand it.  ", "score": 2}, {"body": "If we start allowing people to opt out of providing goods and services to people whose sexual orientation isn't the same as theirs, where does it end?  Can an elected representative refuse to meet with or help constituents because they're gay?  Can a hospital refuse to treat them?  Can a cemetery refuse to bury them?    Each of us has a constitutional right to our own religious beliefs.  None of us has a right to require others to follow those beliefs.  That's in the US Constitution, which governs all of us rather than whatever version of the bible we choose to believe. ", "score": 10}, {"body": "As a conservative I oppose intimate relations amongst promiscuous gay people, and insist they be in a committed relationship, preferably marriage. While heterosexual partnerships can be casual, homosexual marriage should be strongly encouraged. ", "score": 3}, {"body": "Why? Please elaborate why you feel that way. That's your personal opinion based on your personal values, and has nothing to do with the concept of liberty. Substitute your words for \"black\" and \"white,\" or \"Anerican\" and \"European\" and see how ridiculous your statement is.", "score": 0}, {"body": "It is interesting that as I look at the picture of this dude I note that he is violating two dictates in  Deuteronomy 22:11 - \"You shall not wear a material mixed of wool and linen together.  (King James Bible - Thou shalt not wear a garment of divers sorts, as of woollen and linen together. ) \"You shall make yourself tassels on the four corners of your garment with which you cover yourself.\"    I don't see the tassels . I also would hazard that he probably has a combination of cotton, polyester in both his pants and shirt.  I am aghast that with his commitment to the literal word of the Bible that he would stray so far. ", "score": 12}, {"body": "tanks for the much needed humor  - it makes the point", "score": 0}, {"body": "Well said, I too am aghast!", "score": 0}, {"body": "John G. Kallam Jr., 67, and his ilk who believe \"Scripture is unequivocal\" cheerfully ignore Bible passages that forbid them from eating shrimp, demand that they stone to death daughters who disobey them, that say that women should remain silent in church, etc., et., etc., etc. but become apoplectic at the idea of same gender marriage. Bigots will be bigots, but this is a land of laws and our Constitution upholds the separation of Church and State. They can believe all the nonsense they want but they can't force other people to live by their ignorant, idiotic Bible induced world view.", "score": 9}, {"body": "Mr. Kallam sounds rather behind the times, so that one has to wonder what it meant to be married by him. Every marriage that Mr. Kallam presided over should be annulled as a sham marriage.", "score": 3}, {"body": "Lack of respect for religious views, or ascribing to oneself a \"truer and deeper\" reading of scripture than that held by people of faith, is sadly, for those who favor homosexual marriage, hardly persuasive. It does not matter that you subscribe to religion or respect those who do.  It does not matter that your interpretation of religious texts comports with that of others.  What matters, presumably, in a society governed by a Constitution, is that the freedom to practice one's faith is protected, while the freedom to marry whomever one chooses, is most certainly not.  Al Gore referred to that sort of thing as an \"uncomfortable truth.\"   So the \"evolved\" members of society can continue to look down their noses at the faith community and mock their \"supersititions.\"  It will matter little if the Consitution is determinant.  And if it is not, well then Heaven help us all.", "score": 1}, {"body": "\"What matters, presumably, in a society governed by a Constitution, is that the freedom to practice one's faith is protected, while the freedom to marry whomever one chooses, is most certainly not.\" Freedom to practice one's faith is protected, whatever faith that may be. You cannot force someone to practice your faith, that's the entire point of the First Amendment. Also I would like to direct you to the 14th Amendment, guaranteeing equal rights to all citizens. We are talking about civil marriages here, which confers certain rights and benefits such as tax incentives or hospital visitation. Denying those rights to a group of people is in violation of the Constitution. If you research the Supreme Court Case Loving v. Virginia you will see that it was decided that bans against interracial marriage were unconstitutional. The same applies to bans against same-sex marriage.  You are correct in saying the Constitution is determinant. Which is exactly why same-sex marriage will soon be legal in all 50 states. ", "score": 2}, {"body": "Which religious beliefs would you prefer that we \"respect\" and use as the basis of laws?  Christian beliefs, presumably.  But which Christian beliefs?  Catholic ones which prohibit divorce?  Evangelical ones which require a woman be subservient to her husband?  Ones which require beating a disobedient child--and maybe disobedient wives, too?  Ones that accept slavery?  Ones that require their members to refuse military service? Refusing to  impose the beliefs of any one religion on all those who are not of that religion is in no way the same thing as having a \"lack of respect for religious views\".", "score": 2}, {"body": "Always end with a threat - always end with a threat. Religious threats don't scare us anymore. This is why your power is waning. Boo!", "score": 4}, {"body": "Christian and Biblical views on same-sex marriage are irrelevant: our nation is governed by the Constitution of the United States not Sharia law. This does not mean I am without empathy for those who hold sincere faith-based beliefs and I am just as outspoken on their Right to hold such beliefs-----at least until those beliefs attempt to limit the Rights of others. ", "score": 36}, {"body": "Isn't it ironic that the secular people I know practice humanity, which basically embodies the teachings  of Christ, while \"Real Christians\" practice and promote hatred and bigotry. ", "score": 1}, {"body": "When gays get the right to marry in the Bible belt, Southerners will likely pass all kinds of laws to restrict the right, just as they have done with abortion rights and voting rights.  There are substantial economic benefits to marriage.  But harassment of gays will not ease.  Possible anti-gay reactions include job discrimination, obstruction of adoptions, denial of service by private merchants, restrictive school curricula, and increase in hate crimes.  Abstract rights are one thing.  Real acceptance is another.  It is not clear whether winning marriage rights in Mississippi and Alabama will improve the lives of LGBT's or not.  Abstract rights are of great importance.  But, absent popular support, gays may win the battle while losing the war.", "score": 2}, {"body": "That might be true for a time but the war for equality is being won.  The opposition to equality is literally dying out.", "score": 0}, {"body": "Mr. Kallam was stunned that the law came into conflict with his notion of biblical truth.  What I find stunning is that there is still a significant portion of this country (let alone the world) that accepts that the moral \"truths\" propounded by a nomadic tribe of sheep herders and traders are, in fact, laws that we, thousands of years later, must be compelled to live by.  And all the demonstrations over the years of the many, many contradictions within that body of lore fail to sway them in the least.  Somehow, the parts that they pick and choose are the Word of the Lord, but we can conveniently overlook the other parts.  ", "score": 8}, {"body": "Good, let them opt-out and get out....of public office.  ", "score": 9}, {"body": "John 13: 23 & 25 KJV... 23: Now there was leaning on Jesus' bosom one of his disciples, whom Jesus loved. 25: He then lying on Jesus' breast saith unto him, Lord, who is it? If these passages, and those from the crucifixion, depicting the physically tender and intimate relationship which Jesus had with the disciple whom he loved is any indication... Jesus was certainly not as homophobic as so many of these conservative Christians seem to enjoy fantasizing that he was.  But as Science has recently shown us, homophobia is not a defense from what is external but rather from what is internal.  What these Christians fear the most is right inside the Bible.  This is why many conservative Christian translations have simply edited out this physical tenderness from this male, same-sex, love relationship which Jesus had with the disciple whom he loved.  Now why anyone would want to remove something from the literal and inerrant word of God I have no idea?  Unless there is some kind of problem with the text?  Of course these actions are rather futile in the long run as this male love relationship is still in the original Greek text.  And always will be. There is no future in hating love.  Certainly not from a Christian perspective.", "score": 6}, {"body": "Word to evangelicals from someone raised in the faith: What your Bible tells you means nothing before the law, which is exactly as it should be. Feel free to worship as you see fit, but keep it out of the public sphere. Marriage is a contract granted by the state. Holy Matrimony is of the church and carries no weight before the law. Ministers of all faiths utter the phrase \" by the power vested in me by the state/commonwealth of ______\" because marriage is a civil act of the state- not the church. No person has asked that people grant church blessing to a union in violation of their beliefs. Likewise, civil society should not be afflicted by your religion.", "score": 11}, {"body": " “God said that homosexual behavior is a sin and that marriage is between a man and a woman.”  Well, no, the Bible is full of examples where men have multiple wives.  It is NOT true that there is just one kind of marriage and has always been in all societies -- a course in anthropology will demonstrate the variety of possibilities.  But if you think it's wrong to marry somebody of another sex, then don't do it! You have no right to interfere in the private lives of other people.", "score": 9}, {"body": "Sodom and Gomorrah.....say,  isn't  that  the  story  where  Lot  \"gave\"  his  daughters  to  an  angry  crowd  of  men  looking  to  satisfy  their  lust.  And didn't  Lot  himself  have  \"relations\"  with  his  daughters?  So   moral  lessons  are  drawn  from  such  a  story ?  It  sounds  more  like  \"I  don't  understand homosexual  people,  I'm  afraid  of  homosexual  people,  so  I  hate  homosexual  people.  And  does  god.\"  At  least  try  to  find  a  more  coherent biblical  narrative  to  justify  the  bigotry,  if  indeed  any  exist.", "score": 19}, {"body": "To all the Mr. Kallams of this country I say, \"Please stop confusing your theology with my democracy.\"", "score": 17}, {"body": "Rabbi Dov Lesser, one of the leading teachers and authorities on Torah at Beys Medrish Gevoha, Lakewood, NJ, the Harvard of American Orthodox Judaism, told me in the 1970s that no where does Torah ( Old Testament to non-Jews) condemn homosexuality. He explained that leading commentators long ago said that if lesbians were not mentioned, and no where in the Old Testament are they, then the issue being discussed was not homosexuality. Torah considers homosexuality to be as natural as left-handedness or the color of one's eyes or skin. No one is preferred in the eyes of God who deliberately created diversity in this world. He also told me that most people in the Jewish community , people who should know better and are victim to common prejudices, are very ignorant on these topics but that in no way justifies condemnation of gays and lesbians as people or their expression of love and devotion to each other from a religious Jewish perspective. In Judaism, halakhic ( decisions based on the laws of Torah) are often qualified according to context and this is just another one of them, he explained. It is not a sin per se. He was quite supportive of me as a gay man in a relationship with another man ( now  going on for 30 years) and also my devotion to worship and life as a Jew.  Several other orthodox rabbis including Shlomo Freifeld, alov hashalom, head of a yeshiva in Far Rockaway, NY, which I attended, and others I now know, think the same way.", "score": 17}, {"body": "As many on here have already said, if a public official does not want to honor the marriage laws in his/her state, then he or she needs to resign.  They are in the wrong job.", "score": 16}, {"body": "It is a sad state of affairs in our country when there are individuals who work hard to find ways that they can discriminate against people.  ", "score": 14}, {"body": "Let your god strike down those who cross her/him.  But, until that happens, who is anyone else to provide unrequested advice to gays or lesbians?  What ever happened to live and let live?  Or, how about do unto others? http://thetruthoncommonsense.com", "score": 8}, {"body": "Another comment wrote about this. It deserves repeating. High school students organized an anti-gay day and made their Christian faith a prominent part: http://m.nydailynews.com/news/national/pennsylvania-high-schoolers-organ... I weep. I imagine Jesus weeps too.", "score": 10}, {"body": "For those that believe that God' is infallible why would he create children with inherited deceases, Blindness, Deafness, Mental disorders, or humans who did not choose to procreate with the opposite sex, & with the desire to murder & the inability to live in peace.If this is Gods idea of humanity, why would anyone want to worship him.No human is the same as another, we are are very diversified, in our thinking, beliefs & sexual orientation,However, as far as our Laws are concerned we are all equal & are entitled to live & love within the Law.  ", "score": 9}, {"body": "As an LGBT person, the conservative rallying cry comes to mind: Don't tread on me!", "score": 8}, {"body": "Seems to me that the establishment clause means that government employees can't use their government positions to force their religious beliefs on other people.   But I could be wrong. . .", "score": 15}, {"body": "What strikes me about this entire issue is that we overlook the fact that marriage is a purely legal contract. As a small town mayor I married a number of couples in non-theistic ceremonies. Marriage only becomes religious if the participants choose to make it so but, even then, the propicient must have legal authority to marry a couple which is granted by the state to certified ministers. Let's separate the legal from the religious aspects. Religions are not being required to recognize same sex marriages, only the state (legal) entities can do so.", "score": 28}, {"body": "How sadly ironic that states with the least judicial resources (i.e., primarily in the deep south) are devoting enormous resources to fighting marriage equality.  The financial, administrative and human resources that the state of Florida wasted on fighting marriage equality would have been much better spent elsewhere---and now Alabama leads the charge (again, in the wrong direction).  A friend advised me years ago \"Choose your battles\"...wise advice when resources are limited. ", "score": 16}, {"body": "We've traveled this road before.  When the federal government made desegregation the law of the land, many restaurants in the southern states became \"private clubs\" rather than serve black patrons.  Many private schools and academies popped up, so that white children did not have to go to school with black children.  (Many of those schools still exist and it is why we should oppose education vouchers, which would serve to keep them in business with our tax dollars.) Private clubs retain the \"right\" to determine their membership, and thereby discriminate -- look at Boy Scouts of America v. the State of New Jersey, which gave them the legal grounding to exclude gay members and gay leaders. BSA has that \"right,\" but it doesn't make it right.  We'll go through all of this again, and it will take another generation for our culture to truly change.", "score": 11}, {"body": "\"I breathed a sigh of relief,” he recalled. “I thought that was the end of it.” So a bigot thought he and his bigot friends could  vote a bigoted law into life and the rest of the world would just say, okay, since all you folks voted, that settles it.  Sometimes I wonder if southerners have played the fool so long, it's become an irreversible condition.", "score": 17}, {"body": "Put away your bibles and keep religion out of politics.", "score": 19}, {"body": "How many marriages did Mr. Kallam perform for couples who had been divorced before?  Or couples who were not virgins?  That frown on his face makes him look like a miserable man.", "score": 22}, {"body": "Look, there will forever be \"somebody\" that will be against it, but eventually it will be so overwhelmingly accepted, that they won't matter.  Eventually all old folks who are against it will die and go away.  Eventually, I will die as well but I know that I did the right thing fighting for it and couldn't be happier that I saw it come to pass during my lifetime.  It's here now and forever. Let us all rejoice to our own beliefs for it has created happy people and families.", "score": 12}, {"body": "Let's talk divorce and give custody rights of those \"opt-out states to the Native Americans that settled them originally?    Would a Republican/Dixiecratic Congress accept their proposed version of the Missouri Compromise?   Yet another national embarrassment!", "score": 6}, {"body": "It's all so simple: if you don't believe in same-sex marriage, then marry someone of the opposite sex, or don't marry at all.  The thought that one person can determine who his/her neighbor can marry is beyond the pale. This country was founded on freedom, and freedom means \"freedom for everybody,\" to quote the former Vice-President.", "score": 16}, {"body": "States can't \"opt out\" of granting equal constitutional rights to all US citizens.", "score": 17}, {"body": "Officials who feel uncomfortable with the law should be encouraged to resign.  There is no shortage of people who are willing to support the Constitution.", "score": 1}, {"body": "Mr. Kallam was right to resign his public post rather than perform marriages which he believes violate his faith. That is the principled thing to do. But no sitting governmental official should be permitted to pick and choose who they will marry. It wasn't that long ago that some religious organizations preached that inter-racial marriage was a sin--some still do. Would we let a sitting magistrate refuse to perform inter-racial marriages in this day and age due to their religious beliefs? I would hope not. Same rule applies here. Religion belongs in the home and the place of worship and has no place in providing governmental benefits or services. ", "score": 14}, {"body": "There are really two dimensions to marriage: civil and religious. The heart of the same-sex marriage issue concerns only the former: i.e. the benefits conferred by the state such as tax benefits and making medical decisions for a partner.  The religious side is protected by the First Amendment. If the Supreme Court rules in favor of recognizing same-sex marriage—the court  probably will because there isn’t a compelling argument for why same-sex couples shouldn’t be allowed to get married—churches, synagogues, mosques, and other places of worship will retain their right to not recognize same-sex marriage. ", "score": 9}, {"body": "What an oddball entanglement: religion, sex, civil law.     Regarding the legal aspects of marriage, why not let anyone at all establish this kind of partnership? Health insurance, tax breaks, inheritance, etc: I can envision siblings at some point in their lives, or nonromantic friends, choosing to parter in these ways.     Regarding other people's sex lives, as long as it's adult and consensual, who cares? What political group wants the government involved with people's sex lives?     Regarding same-sex marriage, I remember a New Yorker cartoon, a middle-aged man-woman couple saying, one to the other, \"Haven't they suffered enough already?\"    This weird mix of government and religion is certainly a cause of suffering. With any choice, I'd keep these things separate in my life.", "score": 5}, {"body": "Civil rights shouldn't vary by ZIP code.", "score": 18}, {"body": "Then do you believe that having different age of consent laws, or different consanguinity laws, from one state to another is also unconstitutional?  I fail to see where the federal government was granted the power to decide on marriage laws anywhere in the Constitution.  That being said, I fully support the second, less mentioned part of this case.  A state is required to recognize a legal marriage from another state under the 'full faith and credit' clause, even if that marriage could not  be legally performed in that state. Finally, I fully support the right of any number of adult people of any gender to enter into a committed relationship.  I also believe that the ninth and tenth amendments are not given enough credence in this era of ever expanding Federal law.", "score": 0}, {"body": "It's called separation of church and state for a reason. I love how they always talk about the \"homosexual agenda\" yet they push their own religious agenda onto others. ", "score": 94}, {"body": "Magistrates, priests, pastors,  rabbis do not marry anyone except their own mates.  The couples marry each other.  The magistrate acknowledges it for the state.  A cleric blesses the marriage that he has witnessed although he could simply witness it and wish the couple well.  I suppose the cleric could witness the marriage for the legality and then curse the couple although that seems a bit mean spirited.", "score": 6}, {"body": "Although the way their luck is going (the bigots), their curse just might be a blessing.", "score": 0}, {"body": "Aren't these the same people who claimed interracial marriage was against the Bible? It's disheartening how many ways the bible has been and is used to discriminate against fellow American citizens.", "score": 17}, {"body": "Marriage in this country is not a religious but a civil act, which some people choose to mark with a religious ceremony _as well_. (Marriage as a sacrament, by the way, was invented by the church in the middle ages, and met with a good deal of resistance to the idea of investing what was considered a civil contract with the valence of the church). You do not have to be married by a priest or a preacher or any religious person to be married, and a marriage performed by a religious person without a license is not a legal contract.  The idea that the sacrament of marriage is somehow tainted by the use of marriage by non-heterosexual couples is really a fall-back position by people who would really prefer to legislate away the \"sin\" of homosexuality. Such people don't perceive that the Bible is not the authority for those for whom it is not their chosen guide. Here's a question: if you, a magistrate, belonged to a particular sect that considered that all other brands of Christianity were damned, and a couple came before you, one party of which was of your sect and the other party not, could you refuse to marry them on the grounds that you would be emperiling the soul of the like-minded believer? Or in another situation, if you knew that a couple was not planning to have children, could you refuse them on the grounds that God said to increase and multiply? Can a person in a position of civil authority use his authority to impel others to live by his creed?", "score": 57}, {"body": "Randall Henderson: Yes, it's a shame a paper like the NYT cannot articulate the case for traditional marriage, but Google is your friend.  Visit a reputable conservative website.", "score": 1}, {"body": "\"NYT cannot articulate the case for traditional marriage\" The tradition where daughters are traded into marriage as chattel?  That of polygyny as in the bible?  The serial monogamy, derived from polygyny, popular with the \"modern family values\" GOP? So many traditions from which to choose. ...Andrew", "score": 1}, {"body": "Even more interesting would be to know if a justice of the peace would give a civil marriage license to a heterosexual Presbyterian couple but refuse to give a civil marriage license to a same sex Presbyterian couple who belonged to the same church as the first couple.  Presumably both couples would have the same religious beliefs. . .", "score": 6}, {"body": "The bottom line is that certain religious people believe that gay marriage is a \"sin\".  That's what they believe.   People who don't believe in religion, sin, etc., will have zero tolerance and can argue until they are blue in the face -- and hurl insults until they have completely denigrated the religious -- but that person will not willingly commit a sin until he has resolved it with his own conscience. It's a shame so many people have so little empathy for people who are simply trying to follow their consciences and do what they believe is right by their faith.  That is not a crime, and they should not be subjected to such hatred.  ", "score": 3}, {"body": "You  know we're  in  trouble  when  public  policies  can  be  influenced  by  books featuring  talking  snakes  and  donkeys,  voices  coming  from  clouds  and  burning  plants , and  believed  by  certain  people  to  be  real.  And  these  books are  a  bit  sketchy  on  morality  as  well.  Part  of  the  problem  is  the  people  who  profess  to  believe  in  these  books  haven't  even  read  them.", "score": 7}, {"body": "You can believe whatever you want. It's how you ACT in the public sphere that is under discussion here. I know it is sad for you but you CANNOT legally discriminate against people who do not share your beliefs. Sorry but that ship has now sailed.", "score": 6}, {"body": "I just absolutely cannot fathom how a gay couple getting married has any impact whatsoever on the lives of those who are not gay and therefore presumably have no need for/interest in entering into gay marriage themselves. Religious or not, what in the world difference does gay marriage make to their lives? Please by all means marry who you want, and I hope you and your religious brethren are blessed with loving, meaningful, happy lives and relationships.  I promise, your world will not crumble if you leave others alone to do the same.", "score": 11}, {"body": "Didn't all of us actually think that this issue of whether or not to be married and/or to produce or care for children has always been voluntary? Has anyone been as angry about forcing women and even children into marriage as they seem to be about whether same-sex couples should be allowed into such relationships? I think the underlying motivation for that outrage from conservative groups is simply another vicious kind of prejudice.", "score": 9}, {"body": "A system like France where a legal marriage is performed by the State and any religious ceremony is held by believers does not ensure that all French people approve of same sex marriage, but removes the issue from religion.  US says it has separation of church and state, but permits clergy to conduct marriages recognised by the State.", "score": 14}, {"body": "\"US says it has separation of church and state, but permits clergy to conduct marriages recognised by the State.\" Marriages performed by clergy are recognized by the State if and only if those marrying have first received a license from the State.  Once that license has been obtained, a variety of people--including in some states the couple themselves--may then perform the marriage \"ceremony\".  For most of us, it makes the process more convenient and also removes the reduncancy of having two events, one of which is carried out by government employees with other responsibilities to fill their time.  Unfortunately, it does help muddy the waters for all the bigots, but, no, it isn't doesn't contradict the separation of church and state.", "score": 1}, {"body": "The legal designation or status of being married recognized by our laws is conferred by the state, not by religious institutions. The states issue marriage licenses, and people can become married whether or not they have a religious institution officiate their marriage. There is no requirement that a religion bless their union. Therefore, how religions define marriage is not relevant to the right to marry. A state official who refuses to issue a marriage license to a same sex couple after a ruling by the Supreme Court of the United States in favor of same sex marriage would be denying a legal right to a citizen, and violating their official duties. They should be subject to dismissal.  To do otherwise, and protect those that for 'religious reasons' do not wish to issue a marriage license to a same sex couple, would invite other refusals by religiously motivated governmental officials to refuse to do their duties in their official capacities. Perhaps racially mixed marriages offend the religious sensibilities of  a county clerk, could they likewise refuse to issue the license? Maybe the county building commissioner doesn't like mosques because his religion views the adherents of Islam to be heretics or heathens, can he refuse to issue a building permit for their place of worship? Perhaps a Planned Parenthood clinic that dispenses birth control will be refused licensing due to the religious views of a state official? Opt-out laws are dangerous & unconstitutional follies.", "score": 20}, {"body": "You may have not noticed that Planned Parenthood in some places has been pretty well put out of business because of the religious beliefs of some legislators.", "score": 1}, {"body": "It's one thing if officials of a particular religion choose not to perform same-sex marriage ceremonies. That is a right that is absolutely guaranteed by the Bill of Rights, and to have it otherwise would constitute interference of government in religion. It's an entirely different story when the officials in question are part of that government, whether local, state, or Federal. You can hold whatever personal beliefs you choose, but you absolutely cannot use those beliefs to selectively provide the services of your government office. So yes, Mr. Kallam and others of his beliefs, if you simply can't see a way to fulfill all your duties, then we simply can't see a way for you to hold a public office.", "score": 18}, {"body": "Mr. Kallam was not being asked to perform religious marriage ceremonies.  He was asked to perform civil marriages.  As a civil servant, that is part of his job.  If Mr. Kallam had read the Constitution of the United States, he would realize that there exists a separation between church and state.  While I understand Mr. Kallam's decision to step down, I believe his feelings are misguided.  Whenever I read about this type of thing, I always want to ask - do you REALLY want to inject faith into a public / government situation?  If so, what happens if you happen to be Protestant, but the community in which you live is Catholic? Hindu? Muslim?  What then?  What then?", "score": 17}, {"body": "What these people are demanding is the freedom to discriminate based on their own personal religion or preferences. Substitute the word \"men\" for gays\"  and you get comments like \"I don't want to perform weddings for men,\" or \"I should have the right to not serve men.\" No, poor pathetic people -- you can hate all you want, in the privacy of  your own minds, your own homes and your own angry churches -- but the law of the land in the U.S. is that you cannot discriminate.  Let's face it -- there are millions of people who hate men or don't like women, but they still have to serve us. And what's really ironic is they say their Christianity is what drives them -- and yet, many of these weddings that they loathe are being performed in Christian churches, by Christian ministers, joining practicing Christians together. If we flipped it -- if the Presbyerians and Unitarians and Episcoalians were insisting that everyone has to act according to their beliefs -- or that they would not serve these far right \"Christians\" -- how loud would the screaming be??", "score": 14}, {"body": "Mr. Kallam needs to read more of the Bible than Leviticus 18:22. He might learn something from Ezekiel 16:49: \"Behold, this was the guilt of your sister Sodom: she and her daughters had pride, excess of food, and prosperous ease, but did not aid the poor and needy.\"", "score": 17}, {"body": "Mr. Thigpen said he's a Christian \"who began to see that my faith was not an impediment to loving my neighbor.\"  I was put through the Anglican Church Catholic-lite Sunday School brainwashing as a kid, and one of the first things we were told was that as a Christian, you were to 'love thy neighbor'.  Where's this guy been, under water?  I guess as a Christian, you can 'love they neighbor' as long as 'thy neighbor appeareth as thou appeareth, cometh to thine Church, believeth as thou believeth, and fornicateth not with thy fellow man.'", "score": 7}, {"body": "When was it ever a good thing to abuse the trust of another human being? I say that question is begging to be asked of everyone.", "score": 2}, {"body": "Since there's no end to the number of people purporting to speak on God's behalf, that assertion will have to be overridden by civil law, giving equal rights  to all citizens.", "score": 8}, {"body": "If we're not going to give gay people and their children full legal rights and full citizenship status, we ought to have the decency to charge them less in taxes as compensation.", "score": 13}, {"body": "Nothing is less interesting than the details of the sex life of a person to whom one is not attracted. Anthony Powell. Why do these people care? What ever happened to minding your own business? Yes, I'm an old man. Remember keep your hands to yourself?", "score": 14}, {"body": "I dunno, although they say they're not attracted, many conservative antigays do seem AWFULLY attracted to the whole issue of gay marriage, and, I'm afraid we must assume, to the issue of gay SEX. It's all oddly reminiscent of spite, or envy - the old \"If I can't have it why should you?\" (\"I know, let's make it illegal! Think we could get away with stoning them?\")", "score": 0}, {"body": "The First Amendment, which despite what many people believe, states that the government shall remain neutral regarding religion, neither supporting any religion nor forbidding the practice of it. Allowing religious institutions to be in a separate category regarding their tax exemptions was a grievous error, which has been compounded by SCOTUS, as decade after decade religions demand and are given more and more special treatment. 'Special treatment' always leads to a sense of entitlement, as those who receive it soon begin to think it is their due, so that any restrictions are seen as anathema. It would be a good first start to change the law so that religious institutions were treated exactly the same as any other charity. Nothing else will stop people like Mr Kallam from believing they have the right to force others to live according to his religious beliefs.", "score": 11}, {"body": "Call it a gay union or some other name.  It should not be called marriage or have all the rights married people have.", "score": 4}, {"body": "Marriage is marriage, why call it something different just because of who is married, when it is the same essential marital relationship?    ", "score": 4}, {"body": "ah the bills of this country. filled with hate, self righteousness, and the idea that it's ok to deny to others what i myself enjoy. this and greed is what is tearing this country down and making us look like idiots to the rest of the world. not that these small minded people care what others in this country or the world think.", "score": 7}, {"body": "One rather feels these peevish responses are more about what you think YOU should have. Are you feeling threatened?  Look, to the antigay crowd: Do you think someone's trying to take something away from you? Did you misunderstand? You're still allowed to get married too. It doesn't change your marriage a whit. You'll be left totally alone in the marriage you already have. Honest. Is there something you find unsatisfactory about that cus you seem pretty resentful, and its un-Christian like to have such spite, envy, contempt and petty resentment for your neighbors.", "score": 1}, {"body": "Anyway you look at it, the fight against equal rights is a losing battle.  Even measures taken within states, like in Indiana (among others) are subject to overruling by the Supreme Court, not to mention the court of public opinion, which is increasingly accepting of gay marriage. Maybe the \"winning strategy\" is to keep their homophobia to themselves and let others live in dignity. ", "score": 13}, {"body": "I wish religious conservatives were as fervent about not killing people as they are about preventing same-sex marriage.  ", "score": 28}, {"body": "AACNY - We have tried having that discussion many times before.  Every time legislation that would put restrictions on late term abortions up for discussion, conservatives will not allow for cases when a mother's life is in danger, rape or incest.  They apparently would rather see a woman die than allow her to have an abortion.  What you think is a 'problem with liberals' is, it appears, simply lack of knowledge on the topic.", "score": 6}, {"body": "Nonsense, nymom, liberals avoid the issue by focusing on rape and incest, the exceptions.   They would rather hide behind the privacy shield than explain how it is that a baby is unprotected while inside the uterus and at risk of being \"terminated\", but fully protected once outside the mother.", "score": 1}, {"body": "The \"exceptions,\" aacny, rather prove that your \"concern\" for the little cluster of cells is a sham. Oh, the poor little  cluster of cells! Poor little mass of quivering microscopic pink tissue! It might never grow a whole brain and live to see the light of day. ::stifles fake sob:: What? Raped women? Girls who are forced to have sex with their fathers? Whatever. Don't bother us. We were talking about the poor widdle fetus!", "score": 1}, {"body": "I have never been a devotee of the 'backlash' concern.  The Court's job is to interpret the Constitution, including especially when it has the opportunity to ratify the legitimate interests of those who will never constitute a majority.   The Court's job is Not to wring its hands over the civic popularity of its judgments.  Brown and Roe were properly-decided opinions, by Justices who did not rely on their fingers in the wind to guide their jurisprudence.   Let's hope this more timid bunch of Supremes has the courage of actual Constitutional convictions -- the Equal Protection argument has been clear from the outset.   ", "score": 8}, {"body": "Life begins at birth and birth begins at marriage. Do not be fooled into thinking this battle to change the definition of marriage is about equal rights; this is a movement to normalize and mainstream homosexuality. Otherwise, why the need to destroy the institution of marriage between a man and a woman with the potential of furthering life. Not to worry. Religious people and those who still believe in family values are the one's having children and continuing life, while the majority of those choosing to live with a same sex partner (as opposed to many gay men and women who have married each other and are having children of their own) are dropping out of the future altogether.", "score": 1}, {"body": "Have you spoken with any gay or lesbian people?  It is not our goal to \"normalize\" or \"mainstream\" ourselves.  Rather, it has always been our hope that discrimination, violence, shame, ridicule, and the denial of basic rights will one day no longer be considered \"normal.\"  In fact that day has come.  None of us want to take anything away from you, except perhaps your right to claim superior status.", "score": 5}, {"body": "ERA, you may want to check every poll for the last ten years.  Those with a narrow, fairy-tale based view of marriage are now the minority.  Put differently, the good guys are winning.", "score": 1}, {"body": "\"Otherwise, why the need to destroy the institution of marriage between a man and a woman with the potential of furthering life.\" As a happy participant in a cross-gender marriage, I speak with some authority when I explain that my marriage is under no threat of destruction by the elimination of bigotry against those joining in same-sex marriages.  This is just another in a series of feeble excuses to justify bigotry. ...Andrew", "score": 5}, {"body": "As per usual, I was reading this article with a powerful combination of frustration and disappointment that people hypocritically use FAITH to justify discrimination. But then I was incredibly moved by the part of the story that described the woman's softening on the issue after (probably unwittingly) befriending a gay couple at the pet store. That's all that's required, in my opinion -- to humanize the issue for people who might be afraid of it, and who haven't been exposed to it in their daily lives. I'm so encouraged that when 'gay rights' evolves beyond a concept and into the form of a living, breathing person -- maybe even a friend -- people get in touch with their tolerance and humanity. I think there will continue to be tremendous healing around this issue as it becomes normalized, even in small towns and conservative areas.", "score": 17}, {"body": "Yes, that's often what does it - realizing that these are just people you know. That's when you realize you were silly to fantasize that they mean you harm.", "score": 0}, {"body": "I never thought I would quote Charles Barkley but I heard him on the news saying, \"Every time they want to hate on someone they blame it on the Bible.\" Not everyone is Christian, certainly not everyone is Southern Baptist. But all of those good citizens pay taxes for public services including county magistrates regardless of their religious affiliation. The laws regarding public accommodation were adjudicated decades ago. It may take further law suits but religious freedom cannot be used to \"hate on\" anyone's civil rights.", "score": 26}, {"body": "Apostasy is a sin yet I am sure Mr. Kallam would issue a license to a lapsed christian.  Believing in a \"false\" god(s) is a sin but I have never heard of a magistrate refusing a license to a Hindu or a Buddhist.  Why is it that homosexuality is singled out as THE unforgivable sin?  I have a feeling it has less to do with the sin and more to do with the bigotry of the magistrate.  Regardless their opinions on sin have no bearing on their official duties as representatives of the state.", "score": 26}, {"body": "Numerous people wonder why conservative Christians worry about gay marriage, specifically, how could it possibly affect them personally? Why do these believers feel personally threatened by the choices of others? It is important to realize that their faith also teaches collective punishment. Their God incinerates entire cities if only a few transgress. This was common in the ancient world. A family member transgressed, the entire family was sold into slavery, \"down to the xth generation.\" Indeed, that is the entire logic behind the doctrine of Original Sin. One man sinned millennia ago, but the sin was so great, all of his descendents for thousands of generations, are just as guilty as he was. This \"justice\" does not make sense to the modern mind, but to believers in these old Late Bronze Age religions, it is baked into the cake, as it were. They fear the indiscriminate wrath of their God.", "score": 6}, {"body": "I agree with the sentiment.  But I believe the Hebrew Bible (parts of which are termed the Old Testament) was actually considered to have been written (or at least significantly revised) in approximately 700 BCE, give or take a century or so.  In the Middle East, this was the Iron Age.", "score": 1}, {"body": "Some God, if he plans on punishing the guilty and the innocent equally.  ", "score": 5}, {"body": "Maybe heterosexuality isn't normal, just common. - Dorothy Parker", "score": 26}, {"body": "He's old enough to collect Social Security & have Medicare.  Probably has a nice state retirement pension too.  He can sit on his porch now & thump his Bible.", "score": 8}, {"body": "I wish the opponents of gay rights could see that their mean spirited attitude and bigoted views affect more than themselves.  Just this last we saw high schoolers in Pennsylvania have an 'Anti-Gay' day.  With crosses showing how christian they were on their hands, they went around to the lockers of the gay students and posted cruel and intimidating posters.  This is the culture of hatred these \"Christians\" are breeding. Please, live and let live.  If someone is gay, it doesn't affect anyone else.  Let them be themselves and find happiness.  Stop the hate.  ", "score": 15}, {"body": "I'm sure Jesus wept. Hatred was not something He preached.", "score": 9}, {"body": "Ignoring all the moral argument, biblical hypocrisy, etc. for a moment, imagine if the situation were reversed: a gay man or woman who owned a flower shop refused to provide flowers to a mixed-sex couple for their wedding, claiming it violated their closely-held religious beliefs. They'd be taken to court, and laughed out of town. Or what if a Muslim pizza place refused to serve Christians? The South would be apoplectic. How is their stance any different? Reading about these people gives me a headache. ", "score": 24}, {"body": "It gives me a pain, too, in another part of my body. But I also feel your pain.", "score": 2}, {"body": "Mr. John Kallam is to be congratulated on his decision to resign if he cannot perform public business that is non-discriminatory and Constitutional.  Let us hope that others follow his example.", "score": 10}, {"body": "So, if you cannot perform your ALL of your duties as a magistrate, judge, etc., then you should either resign or expect to get fired.  We do not get to choose which aspects of our chosen profession/job we get to perform.  We do what we are told.  And, if we do not like what we are told, then we can quit, but workers do not get to tell their bosses (the government to which they have sworn an oath of duty) what they will & will not do as part of their job responsibilities.", "score": 5}, {"body": "I read the entire article looking for the follow up question, \"Mr. Kallam, Jr., how do you feel about divorce? Or when a child talks back to a parent? Or a woman who is raped by her brother, or has intercourse outside of marriage?\" All sins, all punishable by death in the \"Scripture [he] believes is unequivocal.\" I get so sick and tired of this cherry picking. As for appointed county magistrates wishing to not perform the jobs they are paid for, get another job, resign, move on. I've left many jobs and turned down projects I \"didn't believe in\" and you know what? I didn't get paid either. If these people spent a little time being compassionate on earth they wouldn't have to worry so much about \"living\" happily ever after once they're dead and gone. ", "score": 10}, {"body": "AACNY, I don't see why he is being \"forced\" to engage in any sin by following the laws of his country. I'm pretty sure the Bible doesn't discuss the sin of approving homosexual marriage. It does condemn a lot of other things, including, for example, backbiting and lack of charity toward others--and divorce, too, for that matter. Jesus (and not the OT, which Paul said we could ignore, anyway) was explicit about not allowing divorce, and the church managed to deal with that. If he chose not to marry divorced persons, he'd have a better biblical authority, but somehow that doesn't bother him.", "score": 3}, {"body": "And Jesus said, render unto Caesar what is Caesar's and unto God what is God's. I believe that is your God telling you that you can do your duty to your God and to your country, and that he is fine with it", "score": 1}, {"body": "AACNY:  In what sin is he personally being forced to engage??? He is not marrying another man/woman.  He is just being asked to perform his job, for which he is paid by the state - aren't you annoyed that he is not doing his job???? EW", "score": 4}, {"body": "The last I heard, we don't live in a Christian caliphate.", "score": 14}, {"body": "You could have fooled me.", "score": 3}, {"body": "I can appreciate the fact that things are moving awfully fast for a large number of people - especially older conservative Americans.  But the thing that scares me most of all is when someone puts his or her religious beliefs, such as Tami Fitzgerald and the North Carolina Values Coalition, above the law of the land.  That's just not what this country is about.  If the Supreme Court rules in favor of same-sex marriage (and I hope it does), then that's it.  These die-hards will either go along or be lawbreakers.  Interesting possible turn of events.", "score": 6}, {"body": "\"I can appreciate the fact that things are moving awfully fast for a large number of people - especially older conservative Americans\" I don't feel sorry for them. Aren't they the ones who have been torturing many of us for so long? They tortured us when we were children with their punitive beliefs, their hatred for anyone whose sexuality they felt threatened by, or hell, even anyone whose HAIR color they felt threatened by, their general intolerance and officiousness, their oddly prurient interest in the sex lives of people they deem inferior to them, and their general loathing for life. They won't give up till their last gasps. ", "score": 0}, {"body": "\"Opt-out's\" would provide transition time just as \"Don't Ask, Don't Tell\" provided time for the military to transition.  It turned out to have not been a problem at all.   Except for those who were vehemently against it and claimed that rights were being trampled and would never be fully realized.  They were wrong, and are likely wrong here as well.   Society is catching up.  Going after people with strong religious views is a poor strategy.  It is damaging to the country and just leads to rancor.  ", "score": 2}, {"body": "Yes AACNY, they survived. As will our Christian brothers and sisters, once they accept that equal rights apply to all...", "score": 4}, {"body": "\"I hope someday you have the same empathy for religious people as you do for gays.\" Oh, for god's sake, what does that even mean? I can have empathy for the fact that some religious people are sincerely disturbed by the fact that behavior they consider almost uniquely sinful is now becoming widely accepted and even legally permitted. However, I have no empathy whatsoever for any belief among those people that their religious beliefs and their upset give them any right to dictate the behavior of others when it is in no way harmful to anything other than their feelings.   You claim to have empathy for both groups, but you are kidding yourself if you really believe that you do. Denying people their civil rights is far more consequential than tiptoeing around someone's religious beliefs so that they don't feel upset. And, yes, we can argue about baking a cake. If you are so empathetic to the concerns of gay people, try for one minute to put yourself in their shoes and imagine what it's like living in such a way that you know businesses may deny you their services simply because of who you are. No, you have \"empathy\" only for the baker or caterer or florist who singles out gays as being the only \"sinners\" for whose marriage he or she will not provide their product or services. When you find me such a business person who refuses to provide wedding cakes for divorced people or for non-virgins or for inter-racial couples, then I'll take your claims of empathy seriously.", "score": 0}, {"body": "Aacny ... It's over. Its time to accept it it and move on. No, there isn't going to be an \"opt out\" phase. You have to go on living with gay people. They won their fight against discrimination - at least this one.", "score": 2}, {"body": "“Sodom and Gomorrah, that story alone tells you what God thinks of same-sex marriage,” he said.\"  Too bad that's about as relevant to this question of respecting your fellow man as what \"Harry Potter\" or \"Captain Ahab\" thinks about anything.  Human rights are human rights, regardless of your taste in fiction. ", "score": 18}, {"body": "I am not 'Gay', too old for abortion, but I feel strongly that \"one size does not fit all\".  This is a diverse country.  I choose no church, keep my own council on my beliefs, and respect others the same option.  Where I draw the line is: if you have a business, serve all.  If you run for an office where you need to officiate weddings, serve all.  Your religion, your views are personal, your own.  You have no right to impose your religious beliefs or views on anyone else.  If you are uncomfortable with this, get out of your business, or role in performing marriages.  This is not necessarily a Christian country.  This is a diverse and supposedly democracy.  Please live up to your Democratic principles, and keep your religious efforts to reform others separate from those of us who choose a different path.", "score": 32}, {"body": "kkurtz, Why would you think that your religious beliefs should be more important that basic human rights.  I don't want to hear about your religion at all in the public sphere so please don't tell me what christ would make you do or not do.  As long as you are not hurting anyone else please keep christ to yourself at out of any and all government policies that effects every citizen not just the one who are religious.", "score": 1}, {"body": "But, again, that is your belief. It is not fact, it is only your belief that it is true to you. The bible is fiction based on a group of people's interpretations of many different things. Unfortunately too many people belief that the Bible is non-fiction. ", "score": 4}, {"body": "I don't think that my religious beliefs are more important than basic human rights, although purporting such nonsense does dovetail with the narrative that you WISH would be adopted by every American. I see zero evidence of human rights being trampled. Every man, and every woman has ALWAYS had the right to marry (men, to women and women, to men). Many so called \"of birth\" and \"immutably gay\" people have re-oriented themselves, and married opposite sex partners and, in doing, cast jaundiced light on the fictions \"I was born gay\" and \"my gayness is immutable.\" Now, the Supreme Court has ruled that same sex unions, or partnerships (they are not, and never will be \"marriages\") must come with every right and privilege afforded a TRULY MARRIED man, and woman. This is not a human rights issue, but those that falsely insist that it is are the ones bringing it into \"the public sphere\", I'm perfectly content keeping my beliefs to myself, and following what God has said on this while maintaining my right to serve whomever I please, and NOT go against God's Word by pretending that what he has clearly called sin is not propagated. That people will continue in sin is a fait accompli that concerns me not at all... it is my right to NOT be an accomplice to it.  ", "score": 0}, {"body": "In America, church weddings and wedding cake baking are about to go underground. A trickle could become a torrent. Migration is beautiful.", "score": 2}, {"body": "Re: \"church weddings ... are about to go underground\" Not for the ever-growing list of faiths that perform same-sex marriages. Want that list?", "score": 5}, {"body": "A church wedding does not make you married, that cake doesn't either.  ", "score": 1}, {"body": "Too often people who understand the Holy Bible and other spiritual books on a surface level only use it to make judgments that contradict the very evidence of evolutionary thought contained in the books.  This appears to be what has happened here with some of these folks.  The Holy Bible declares the equality of all people \"don't you know that you are gods?\" we can read in the Old Testament and The Torah and then it is repeated affirmatively by Jesus in the Gospels.  Our \"kingdom of God is within\" but the belief that there is a God that judges us as mankind does will cause us to never realize it.", "score": 30}, {"body": "Bravo, Rev. Bates!", "score": 0}, {"body": "Thank you Rev. Bates for possibly the wisest comment I've seen in quite a while. Your understanding is perfect.", "score": 0}, {"body": "There are many advantages conferred on married couples by society, employers and government. Marriage is coming to be accepted very rapidly as a commitment between two people to . . .well, not sure exactly, what -- live together? have children? \"love\" each other? There is a subtext to marriage that it is a \"romantic\" relationship or one which involves sexual intimacy even though many marriages include neither. Is marriage a business relationship (i.e. owning property together)?  I have no idea what legal marriage means, practically speaking, other than it confers tax breaks, employer benefit extensions, legal authorities to speak for or represent another person and the like.  As a single person I think it's time for society to allow the very same benefits to any two people who agree to join forces in any of these vague ways we define marriage. Why shouldn't I be able to couple up with a friend or even a relative in place of a \"traditional\" marriage and reap the same benefits? Why shouldn't a single person be allowed to have their employee benefits extended to another person as a married employee can? Why can't any two people enjoy the same tax breaks, shared benefits, etc. without legally declaring they are romantically involved?(And who's checking?) I'm always surprised there is no public conversation about this as so many of us are \"single\" and clearly disadvantaged by the government, employers and society as a whole.  ", "score": 7}, {"body": "Marriage is a pledge of exclusivity, be it sexual or otherwise.", "score": 1}, {"body": "And yet, it's not for people who are in open marriages.", "score": 0}, {"body": "Was just looking at the Federal Income Tax tables the other day and noticed something really unfair.  Widows and widowers are treated the same as married joint filers.  Aren't widows and widowers also single?  So it's advantageous to have been married at some point to someone who died.  Thereafter you will get a big tax break for the rest of your life.  Who knew?  Public policy discriminates against people who do not marry.", "score": 1}, {"body": "When are going to stop allowing people to choose what laws they should not abide by, on the basis of their particular brand of superstition? Yes, superstition. ", "score": 10}, {"body": "When we get those dishonest oath-takers in Congress to revoke all those unconstitutional laws they enacted respecting establishments of religion.", "score": 1}, {"body": "If these Christians want to quote Torah and cherry pick provisions they say are still applicable after 4,000 years of human progress, why don't they obey the dietary laws? ", "score": 17}, {"body": "As so many others have pointed out, clearly few of the fundamentalist Christianists who decry the example of Sodom and Gomorrah have actually READ the story. Just a couple of points. First, it's blindingly obvious, even to the intentionally blind, that the intention of the townspeople was NOT consensual sex. Second, while it was nice, I suppose, that Lot offered to let the crowd gang-rape his daughters, it is not at all clear whether he asked their opinion. But I suppose they didn't mind that the crowd didn't take him up on his offer. In fact, later on (Genesis 19), living in a cave, they got so horny that on at least two separate occasions, they got their father drunk to the point that, as they wanted, he knocked them up. Now, THOSE are certainly examples to be emulated. I can't help thinking that there is probably a significant overlap between people claiming they should have a \"religious liberty\" right to discriminate and people hostile to the establishment of mosques and of others exercising THEIR religious freedom right to exercise some civil aspects of sharia. I suspect also that there is a strong overlap between people wanting a right to \"opt out\" themselves and people who see nothing wrong with forcing their own religious views on people who effectively can't opt out when they begin official proceedings with prayers, festoon public property with religious images, and even have school and college football players effectively endorse religious points-of-view.", "score": 12}, {"body": "Towards the end of the article, Sandra Vernon is quoted as saying, \"'I’m not in favor of gay marriage, it’s a sin, but there’s not much I can do about it.'\"  According to the Catholic Church, divorce isn't allowed and you cannot remarry.  But states allow divorces and re-marriages.  So how is same-sex marriage any different?  If your religion doesn't allow it, fine.  But your religion cannot dictate what the government does, the same way that the government cannot dictate what religion we must follow or how to worship. Remember that old thing from 5th grade civics class, separation of church and state?  ", "score": 20}, {"body": "Half a century after the passage of the Civil Rights Acts, a century and a half after the Civil War, one would think American optimistic naivete might have learned by now the lesson that bigots and bigotry do not obligingly wither away because there are laws, court rulings, and a \"national consensus\" against them. Say whatever good you will about humanity, one thing is certain: fear and hatred are among the most potent, reproductive of human emotions. Bigotry can abide for generation upon generation, for century upon century, for millennia. Best get set for the long haul.", "score": 3}, {"body": "I have no sympathy whatsoever for these unthinking, biblical literalists.  Despite what televangelists insist on preaching, the U.S. is a secular society, not a Christian theocracy or a \"god-given\" special nation.  These people can either stop hiding behind their faith and come out as the hypocritical bigots that they are or embrace the modern, secular world, warts and all or vote for the right-wing extremist of their choice in the next election.", "score": 13}, {"body": "I wish these \"religious\" people would respect our constitution and why we have separation of church and state.  If they don't like it then go find another country to live in, rather then pushing your views down the throats of Americans.", "score": 9}, {"body": "There is no ifs ands or buts where Tax Paying Americans are concerned, regardless of your religion, race, sexual preference, , as long as you do not infringe on the lives of others you have the same rights , as anyone else in this country.For those that take the scriptures literally, you have a right to abide by your religion, as long as your religion doesn't infringe on Civil Laws.Get used to it  Civil Laws trump religious laws.The Party that upholds the separation of Church & State will get my vote.", "score": 12}, {"body": "If the unintended, but still salutatory, effect of the Supreme Court making gay marriage legal is that folks like John Kallam, Jr. and Rev. Steve Griffith resign, that's great. Keep it coming with the opt-out laws as these homophobes can be weeded out, one by one, by their own self-selection as violators of the law. When you allow scripture, any scripture, to tell you what your morality is instead of being responsible for your independent thoughts then you need to own up to the consequences.  So, If Messrs. Kallam and Griffith, and those who believe similarly, want to take an anti-gay marriage stance, that's their right. On the other hand, they can't be employed anywhere where they pledge to observe non-discrimination laws. Oh well guys.   ....", "score": 7}, {"body": "I always wonder if those who decide to \"opt out\" of performing a marriage will also turn away women with expensive wedding dresses, women who plan to keep or have careers after marriage, those on second or third marriages, couples who don't share the same faith, those who've had sex before marriage, and brides or grooms who are bankers. All are considered sins in the Bible and so one can only assume the animosity shown towards gays and lesbians by offended pastors, priests, bakers, etc. will also be shown to the above groups. If not, then their decision has less to do with their religion and more with your average, run of the mill homophobia.  ", "score": 16}, {"body": "Do these silly people not perform marriage ceremonies to couples where one, or both, were previously married and divorced?", "score": 13}, {"body": "I seriously doubt they even INQUIRE as to the 'sin-status' of any other couple asking for a civil marriage in the first place.", "score": 5}, {"body": "People tend to confusion the legal status of marriage with the religious sacrament of marriage.  Being legally married provides certain legal and financial protections to those who enter in a union.  When magistrates, justices of the peace and other government officials perform a marriage ceremony, they are helping the people involved to enter in to a new legal status, not administering a sacrament or religious ceremony.  This change in legal status has nothing to do with religion. The religious sacrament of marriage is conferred by a minister, priest, rabbi or other religious leader and shows that the particular church or religious group that the newlyweds belong to is blessing or recognize the union. If magistrates and other officials who are paid by the taxpayers who fund local, state and federal government organizations are unable to see the distinction between administering a change in legal status and a religious ceremony, they are free to resign their post.", "score": 152}, {"body": "The fight for gay marriage has always been the fight for legal marriage -- in other words, for the piece of paper from City Hall. At the federal level, marriage confers over 1,000 benefits, rights and protections. Atheists can get a legal marriage, people who cannot have children can get a legal marriage. Church marriage is not legally binding and, therefore, confers no legal rights. Furthermore, we already have access to church marriage -- for example, the Metropolitan Community Church has been performing religious same-sex marriage ceremonies for decades -- and because of the separation of church and state, churches that do not want to perform same-sex marriage ceremonies will never be forced to. I am an American, I vote, I pay taxes, I am gay, and I deserve the same legal rights as everyone else. We are excluded from legal marriage solely to stigmatize us as something less than straight people, and that needs to end.", "score": 1}, {"body": "The Sodom and Gomorrah story is the one with God punishing those who are inhospitable to strangers. It's a story that is commonly misinterpreted by the laity, and often misunderstood by the clergy, as well.    ", "score": 17}, {"body": "So Mr. Kallam believes that God has ruled on \"homosexual behavior.\" Good for him — he can believe anything he wants. But the Constitution says that, as a public servant, he is not allowed to impose his religion on anyone else. So he resigns. Good, That's just the right move. Anyone whose religious beliefs won't allow them to carry out the civil law of the land should have nothing to do with government service. All the fundamentalists who advocate for the Christian version of Shariah law should stay in the private sector and espouse their beliefs to their hearts' content — they can exercise their first amendment rights and leave the rest of us alone.", "score": 14}, {"body": "Judge not less you be judged, Let someone without guilt throw the first stone, Abraham slept with his daughter, God commanded all the Israeli soldiers to go back to a battle scene and kill all the women and children, There were two sets of commandments and the one replaced  is the one most Christians follow even though they were the old thrown away ones.  Any one with a clean shaven face or body markings cannot enter a house of worship,  A unwed mother should be placed on her fathers doorstep and be stoned.  The possible rules and commandments and stories go on and on.  This is the mythical book called the Bible. This is what these  folks believe. Another group that has another mythical book called the Koran also has a bunch of rules to be followed.  Both groups are willing to kill to prove their myths are the right ones. ", "score": 7}, {"body": "Constitutionally, only YOUR STATE should accept another state's marriage.  THAT is how the U.S. is intended to maximize freedom.  Some state allow people to marry at 16. Because that state allows it, your state must accept it.  Marriage should probably only happen once in a lifetime, so if you have to drive a few hours or take a plane ride, it may make you realize the commitment. If you need an abortion and don't like your states' access you are free to travel to another state for the procedure.", "score": 0}, {"body": "Since the passage of the fourteenth amendment, equal protection of the law has been more important than the treasonous assertions of sovereignty by states.", "score": 0}, {"body": "Mr. Kallum, one of the NC magistrates who was photographed for this article, looks to be a mightily unhappy person. His inflexibility shows in his face, his posture, and will surely make itself felt elsewhere. When one chooses to be intolerant or bigoted, expression of these attitudes frequently come at great personal cost. His could have been a life well-lived. ", "score": 9}, {"body": "If someone's religion is so fragile that it can't stand the exposure to other points of view and other ways of life it can't be a very good religion.  If a religious official, namely a priest, a minister, a rabbi, an imam, whatever, doesn't want to marry me because they are personally opposed that's fine.  They don't have to and I don't expect them to.  However, a public official is obligated no matter what his/her views are on the subject of same sex marriage or heterosexual marriage.  The reason same sex couples want the protections of marriage is because domestic partnerships do not offer the same protections.  Same sex couples may have children to care for.  They are planning for the future.  Their families may try to interfere.  Legal same sex marriage makes it harder for the families to go against the will of the couple when it comes to medical, child, personal, and legal matters.   Last but not least, they might just love each other and want to express it the same way straight couples express it:  with a ceremony that has words to make the bond official.", "score": 25}, {"body": "This feels to me like a parent disapproving his/her child's choice of a boyfriend/girlfriend.  Some might cut the child off from the family.  Some might try to accept the bf/gf.  In the end, the child does what the child does.  The parent's action only defines what kind of a relation the two has.", "score": 3}, {"body": "I can appreciate that Mr. Kallam would not want to officiate at a same-sex marriage because of his beliefs. However, when he says that \"he breathed a sigh of relief\", he lost me. If he does not believe in same-sex marriage, fine. My advice to him is not to marry a man and that should satisfy his fundamentalist belief. However, I do not understand what he feels the impact would be on his personal life if two same-sex people in his community got married! I am sure that gay people do not deny him the right to marry a woman, so why should he worry about two people of the same sex getting married. As I see it, it is none of his business. As for the pundits on Fox News and other right-wing media and fundamentalist ministers predicting the end of America if we allow \"gay marriage\", are they aware that there are 18 nations that have legalized same-sex marriage and that those countries are doing just fine, thank you?  All of the Scandinavian countries for example. Maybe people like the Rev. Pat Robertson is not aware of the existence of countries other than the United States??", "score": 34}, {"body": "Pat Robertson has not been an ordained clergyman for over a generation.   He resigned his formal ecclesiastical status to run for President and was never reinstated afterward. No surprise at all you didn't know, as many of his still-devoted followers don't seem to jump right in very often to correct media using the erroneous honorific.", "score": 0}, {"body": "Wait -- this is from the party that wants government out of people's lives, right? OK, just checking...", "score": 57}, {"body": "After over twenty years of living together--and owning two condos together--my \"domestic partner\" became my husband on the first day we could legally do so here in Florida (early January). We have been greeted with only positives. Of course we do live in a liberal part of the state and don't have any associations (and don't want to have any) with Bible Belt types whose theology is not based on the teachers of Jesus (even though they say otherwise) because Jesus embraced all people, not just a select in-crowd! We are in our seventies. So we have experienced it all, way back to an event young gays, on the whole, know nothing about: the Stonewall \"Revolution.\" Wow! Talk about coming a long way in less than a half century! ", "score": 23}, {"body": "Congratulations!", "score": 4}, {"body": "Congratulations to both of you, and may there be many more years.", "score": 2}, {"body": "Congratulations on your nuptials!", "score": 2}, {"body": "\"pray-tell\"... would someone please explain how any of these proposals are any different from the Jim Crow laws that \"legitimized\" segregation-by-skin-color? these 21st Century manifestations are simply mutations seeking to utilize some \"religious\" conviction in order to discriminate against \"another\"... Mr. Kallam, as with state licensed pharmacists and others, is sworn to serve all of the public in all things legally allowed within their jurisdictional specialty...to do otherwise is to invite the vilest type of injustices. is this an americanization of Sharia Law? the separation of church and state is one of the key reasons that Europeans formed our constitutional democratic republic. the state is not insisting that Mr. Kallum change his religious beliefs, only that the practice of such beliefs cannot be forced upon his unwitting and likely unwilling fellow citizens. the legalization of applied bigotry is summarily denied.", "score": 20}, {"body": "Because simply being black is benign it’s neither active nor passive. Whereas consummating a marriage is an overt act, an act these people believe, in the case of gay marriage, is a sin.", "score": 1}, {"body": "Some people just need to get their minds off other people's \"overt acts.\"", "score": 1}, {"body": "If some \"Christian\" baker thinks that providing a cake for a same sex marriage is a violation of religious principles, then what does a \"Christian\" sporting goods store owner think when he sells a firearm to someone who commits a murder? Be very careful what you wish for and do not forget to be consistent in your beliefs. ", "score": 23}, {"body": "Actually,   I'm pretty sure that if you _knew_ that the person was going to commit a murder with the firearm, the ethical thing tp do would precisely be to refuse to sell it.    I'm not endorsing the view that same sex marriage is unethical, but I'm not sure your example shows what you think it does.    ", "score": 2}, {"body": "The way to unite a group of people is to always have a common enemy that can be used to unite the flock. Unfortunately these happen to be minority groups who are weak to fight back. Gays are an easy target as are women. Both are favorite targets in most religions including Christianity, Islam and Hinduism. Gay sex is still a crime in India thanks to the Moghals and the British who converted a liberal country into a country where the morals of religious people are forced down everyone else's throats through laws.", "score": 7}, {"body": "First off this guy isn't even practicing Christianity. What he has done is set himself above god and went through his bible and decided which of Gods words will apply to him and which will not. It is amazing which sins he has decided to recognize and the many that he is guilty of get a pass. Working on the Sabbath, the bible declares that we must stone him to death. Wearing a blend of materials, yup that is a sin as great as the one he is decrying. Just remember these people have created anew religion that is only loosely based on Christianity. Not too many years ago these people would be branded as heretics.", "score": 22}, {"body": "Will these same officials refuse to perform marriages for people who have been legally proven to have committed adultery?  What about people that have stolen?  Are these not also considered sins?", "score": 15}, {"body": "Re: \"“Sodom and Gomorrah, that story alone tells you what God thinks of same-sex marriage,” he said.\" If and when America becomes a theocracy, 'what God thinks' will be relevant to a discussion of the secular institution called civil marriage. God does not sign either the marriage license nor the marriage certificate. If Bible-thumping is their best \"strategy\", it's a pretty poor one, especially in a country that promises everyone the right to believe as they wish.", "score": 25}, {"body": "First of all for those who say step down if you don't want to do your job. Look up Moral law! Under this law we have a right to govern behavior in a social stance.  JUSTICE is blind but she holds scales if one group of people chose to come together and not accept a person's way of life they also are protected by the pursue of happiness.  What is being brought to the courts is simply a request to force one groups opinions apon another. Each state has decided if they would like to allow gay marriage. Those choices individually are currently upholding our democracy.  While I understand the gay agenda to have equality the current endeavour is not equality is is tyranny and this is against not only our Constitution but our United Nations.  Has for Thigpen, the scripture about who is a neighbor is one who is willing to help another. Moreover, we are to express our knowledge of God in rightious dignation. God sees same sex has a sin. If a particular person does not listen then you take them to your brother if they won't listen you take them to the church if they still will not listen you wash your hands of them.  Why don't you think about it in affect of your willingness to be casual.  Has for the states that have chosen to allows this behavior forcing a position on people is unconstitutional can you not provide some jobs and  create a gay friendly phonebook?", "score": 0}, {"body": "You said, \"JUSTICE is blind but she holds scales if one group of people chose to come together and not accept a person's way of life they also are protected by the pursue of happiness.\" The Rights of the People in one dish of the scale (those that can marry) heavily outweighs the Citizens' Rights (or lack thereof) in the other dish. The People in either dish are all American Citizens. Thus, our Highest Court must \"weigh\" all the facts, irregularities and obstacles of access to Rights so the Scale of Law can be fairly balanced so one set of Peoples is no longer outweighing the Other. \"Fair and Balanced,\" as a particular news network likes to state.", "score": 1}, {"body": "No one is forcing straights to marry the same sex.  And traditional marriage is not affected.  Same-sex couples don't want to change that -- they only want to be a part of it.", "score": 2}, {"body": "I find it interesting that you view the right to discriminate, the right to impose one's personal views on others, as the \"pursue(sic) of happiness.\" As vile as such a thought is, it only helps prove what many of us believe is the true motivation of the anti-gay point of view: sheer bigotry.", "score": 1}, {"body": "“And those who oppose it will find out that the sky doesn’t fall.” --------------------------------------------- I suppose the sky won't fall if a man married multiple women or a woman married multiple men. That is not a good reason to allow such aberrations. Government and courts should not be in the business of legislating morality. ", "score": 5}, {"body": "AACNY Really quite shocking when you use religion to be intolerant, that other will want your religion to go away.  See how bigotry works - you being intolerant of the rights of others has created an intolerance in your intolerant religious views. You can try and hide behind your religion but many religious people I know don't rationalize their hatred of the other behind the bible - truly shocking", "score": 0}, {"body": "DR New England: Which religious beliefs are you referring to?", "score": 1}, {"body": "Should we presume that you were perfectly happy when the holders of religious beliefs kept us horrifying deviants in the closet instead? Because if you weren't crying out for gay rights twenty years ago while the majority was content to grind them under the heel of their jackboots, then I'm pretty sure the whining now just marks out someone's status as a sore loser. I'm not exactly sure what to call the party opposing the \"tolerance brigade\" -- I'm tempted to say the \"God posse\", but that would paint the good Christians in the world the same color as the One Man One Woman crew, so I'll avoid that particular pith... In any case, to said crew: you've lost already, 'It is finished, the battle is over.' Amen. Maybe you'll have better luck fulfilling your retrograde fantasies if you abandon the constitutional arena and go back to trying to outlaw Rock and Roll; or disband the speakeasies; or forbid all nudity, ever... you know, that sort of thing.", "score": 0}, {"body": "The conflict over gay marriage is ironic in that the institution of marriage, as we know it in the West, is an anachronistic product of theocracy. Now that we have separation of church and state, there is NO reason for government to be involved in marriage. The gay marriage issue would disappear if ALL marriages were private commitment ceremonies, religious or secular. It may be that we're headed that way, and in a generation or two, the \"right to marry\" will be seen as a symbolic, but no longer exigent, victory for gay rights.", "score": 5}, {"body": "Now that we have separation of church and state, there is NO reason for \"the church\" to be involved in performing civil marriages. The issue should disappear since ALL marriages are civil marriages, no 'God-talk' required. Civil marriage is a civil right governed by civil laws. We let ATHEISTS marry.", "score": 4}, {"body": "If we are talking about tax payer funded jobs like those that issue marriage licenses or judges and justices of the peace who perform marriages, they have no choice. They work for the public and their personal beliefs have no place in performing their requested duties. If they refuse, they should be fired - simple as that.", "score": 25}, {"body": "That is exactly what we're talking about here in NC.  These are state or county employees.", "score": 2}, {"body": "Used to be -- in the good old days of the United States Constitution -- political decisions would be made in the rough and tumble field of political disagreement, the legislatures of the states or Congress of the United States.  That gay marriage and marriage in general is political should not be disputed.  But those good old days are gone. The United States Supreme Court has be come the political  legislature of last resort. Well-financed minority (or tinority -- a tiny minority, as I like to say) factions with big megaphones do convince the Justices, who themselves are no longer appointed based on experience or intelligence, but solely on ideology, political. No longer is the Constitution valid according to the president of the Democrats and his ideological allies. So the political issue of homosexual marriage is no longer in the hands of \"We the People.\" Http://www.periodictablet.com", "score": 1}, {"body": "So if you lived in the 1960's, you would have been ok with Jim Crowe?  Segregation?  Apartheid in the 19080's in S. Africa?  The truth is if a same sex couple chooses to get married it has zero effect on you.", "score": 1}, {"body": "Had it been left up to \"we the people,\" Jim Crow laws would still be in effect in the South.  You're truly not up on the concept of a constitutional republic, are you?", "score": 1}, {"body": "Why should someone's basic rights be left to the tyranny of the majority? Should we get to vote on your human rights?  I think that if you want to take away their rights then yours are fair game as well. No Marriage for TED", "score": 1}, {"body": "If Mr. Kallam was seriously true to his religious beliefs, how can he in good faith work in any job dealing with people when he'd be serving convicted felons, child molesters, unwed mothers, thieves, and everyone's a sinner?  Is it only the sin of gayness that he abhors, but all other sins are ok?  Hypocrisy much Mr. Kallam? ", "score": 39}, {"body": "That is a question that nobody on that side of the equation wants to answer", "score": 2}, {"body": "President George Washington was married without a marriage license, and licenses didn't become a requirement in every state until 1929.  The authority to license implies the power to prohibit.  Marriage licenses became a way to make it illegal for Caucasians to marry non-Caucasians.  It's time to stop this nonsense dictating who can marry whom.  The 1967 Supreme Court decision deemed anti-miscegenation laws unconstitutional.  Hopefully, the U. S. Supreme Court will settle this issue with gays being able to marry, as I wouldn't hold my breath having marriage licenses all together abolished.   ", "score": 11}, {"body": "When are we going to wise up and realize that our current interpretation of \"states' rights\" is in conflict with the the genuine idea of the law of the land on this and way too many issues? One nation, one rule of law!", "score": 8}, {"body": "\"States' rights\" was never anything but the rallying-call of the prejudiced.", "score": 2}, {"body": "I think that racists and anti-gay bigots have every right to believe -- and say out loud -- that their god disapproves of the wrong kind of marriage. But, why is it that journalists never ask opponents of SSM why they believe that their brand of religion should be the law, and be enforced (as in establishment of a religion) by government? How is this different from sharia law's being enforced by the state?  Do they believe that the latter is a different (evil) god whose laws are wrong?   Or do  they do they actually just think that it's a matter of their right to enforce their particular brand of religion over others ... simply because they can?   I question the reasoning here ... and strongly suspect that journalists are allowing their respect for freedom of speech to trump their awareness that the law is not supposed to be the mouthpiece for any religion.", "score": 22}, {"body": "It really isn't different from Sharia law! But try to make the Ted Cruz-types admit it!", "score": 7}, {"body": "We as a country have more important things to be concerned about - it diminishes us to have this be a defining issue, as a question for candidates, a supreme court case, and the amount of media and interest it occupies. For gays who would get married, it is at least a personal issue, and my understanding is that there are some legal issues (state by state?) that are still different between a civil union and marriage - survivor benefits, hospital access to be with a loved one or make life/death decisions etc.; beyond such important issues, considering the high divorce rate and that a committed relationship does not require a name or ceremony, it is emotional fluff. For those against, it doesn't affect them from the perspective that they wouldn't know unless someone tells them about it; some are also confused and think that they will be forced to be \"okay\" with the whole concept or conflating it with their religion having to sanction it - nobody and no religion has to be \"okay\" with anything, no religion is being or will be asked to perform gay marriages.", "score": 8}, {"body": "Dignified surrender is always an option. This battle is over and these conservatives are simply wasting resources on a fight they not only cannot win but that makes them seem hopelessly out of touch with today's (and tomorrow's) America. \"Opt-out\" proposals that attempt to excuse bigotry won't work, either, as we have seen with conservative retreats in Indiana and Arkansas. You shouldn't have to know a same-sex couple to support same-sex marriage, but there is no question it helps. And if you are happy for your friend(s) on \"a personal level,\" why should others be denied that right simply because you don't know them? It is honorable that Mr. Kallam resigned his position as magistrate; one could think of a certain judge in Alabama who would have done well to do the same. We await Justice Kennedy's opinion with much anticipation; it will be interesting to see if Chief Justice Roberts signs it as well, or if he is determined to remain on the wrong side of history. One suspects Justice Scalia's dissent will be interesting reading. As is well known, he turned out to be a bit of prophet.", "score": 111}, {"body": "Many Court watchers predict that Roberts will join the majority because if he does, it is his prerogative to write the opinion.  He could then craft a much more narrow opinion than Kennedy or the others would write.  I also expect Alito to be in the majority as he has not sided with Scalia and Thomas on the issue of staying lower court decisions.", "score": 0}, {"body": "Dignified?  That's a good one.", "score": 0}, {"body": "I note that most of the comments being posted against same-sex marriage right now fall somewhere between shrill desperation and outright delusion.  It seems that the people with more moderate thoughts regarding opposition to same-sex marriage have (a) realized the battle is over, and they have lost, and that (perhaps more significantly) (b) it really doesn't affect them. I mean, really.  Think about how strange a person must be to sit in his or her home and obsess over the fact that, somewhere, two people of the same sex that he or she does not know are getting married.  That is really disturbingly nuts.", "score": 1}, {"body": "Religions want only the upside of marriage, and disappear when couples want a divorce.  They they dump the couples entirely back onto the state to have the courts determine alimony, child support, child education, visitation, money distribution, retirement accounts, and property disposition.", "score": 14}, {"body": "Excellent point.  Religion, regardless of the brand, has never been particularly fond of consistency, rationality or even observable, scientific fact. Nor need it be.  But given its insistence that it not be judged for its disinterest in matters rational, it's opinions on public policy that impacts believers and non believers alike should be given little if any weight.   ", "score": 0}, {"body": "Opponents of gay marriage might benefit from some sort of conversion therapy. The conversion therapy could perhaps involve actual face-to-face conversations with members of the glbt community where the goal would be to un-demonize and humanize a sector of the population that the Christianist right has long demonized--largely because wedge politics around issues like homosexuality have proven so incredibly effective in swaying un- or under-educated Christian voters to vote against their own economic self-interest, thereby lining the pockets of the one percent. Jerry Falwell's moral majority began making an art of this nearly four decades ago and it's long past time for it to stop.  Most bigots--including the county magistrate mentioned in your article--don't strike me as \"evil\" so much as they strike me as \"unenlightened.\" As a 55 year-old gay man who was raised Catholic and has been forced to cope with being on the receiving end of a plethora of \"unenlightened\" bigotry throughout my lifetime, I have thought often of what may perhaps be Jesus Christ's most famous utterance, which comes from the gospel according to Luke: \"Forgive them father, for they know not what they are doing.\" Perhaps in the conversion therapy I am (facetiously) envisioning, the patients would be forced to read Luke rather than Leviticus. Enlightenment is the goal. One might also attempt reading a science textbook from time to time, as well.", "score": 36}, {"body": "Aren't these the same folks who advocate expelling student who exercise their right to \"opt out\" of saying \"under God\" as part of the Pledge of Allegiance?  Funny how the right wingers feel that only the Right has rights.", "score": 31}, {"body": "The simple historical fact is, the notion of \"rights\" is a rather modern invention that stems from the institution of law. This notion is and has often been in conflict with the more piecemeal and far less precise and rigorous idea of what is morally acceptable as developed by religions. The two parties will never see eye to eye, or even understand each other very much, because the languages are different, as well as the standards of what can count as a binding rule.  Law by its nature tends toward universality. The likely fatal flaw of religion is that it has forever claimed universality despite the absence of any real consensus outside of coreligionists, ie, people who share that particular religion. Religion has never been universal, because that is not its original impulse. It's interests have always been tribal, its sometimes lofty rhetoric notwithstanding. In most conservative religious circles, the word \"ecumenical\" is a used with derision. And as always, the nature of things then play out accordingly. The law tends toward the universal, and so shall address the universal. Religion pretends to address the universal as it actually serves the tribal. Those who wish to live a tribal life will always have religion; but the rest of us shall be happy it is being supplanted with the idea of universal human right.", "score": 114}, {"body": "I can't recommend this enough.  It gets down to the essentials.", "score": 0}, {"body": "The \"language is [only] different\" because the religionists don't speak in legal terms, and the issue is a legal, civil matter.", "score": 1}, {"body": "Except that laws do protect religious rights.  For example, you cannot discriminate against a person based on his religion.  Contrary to most people's beliefs, you cannot demand that religious people keep their religion \"hidden\" and out of the public domain.     Many people also seem to mistakenly believe that other groups' rights automatically trump the rights of religious persons.", "score": 1}, {"body": "“I don’t want to force my religious views on someone else,” she said. “If they can prevent people from marrying who they want, they can keep me from going to the church I want.” Oh, how I wish those who oppose abortion could be as tolerant and generous as Ms. Bailey.  ", "score": 15}, {"body": "I live in NC, and Phil et al have over run this state with all manner of religious (let me correct that- christian flavored sharia) nonsense.   Their hatred knows no bounds and they have taken this state along with ALEC devotees in other states on a race to the bottom.  But you know what - way too many sat on their for one lame excuse or another not voting last cycle and this is what we got.  It was not a landslide , it was a bilious trickle of the few that voted, that brought these guys in.", "score": 20}, {"body": "I'm right there with you, neighbor.", "score": 0}, {"body": "Marriage rights extend tax benefits to gays.  Gays earn considerably more than those opposed to gay rights.  So, from a taxing standpoint, recognizing gay marriage is economically regressive.  That is no reason to deny equal marriage rights.  But it is yet one more reason to support redistribution of income to the poor.    ", "score": 1}, {"body": "Michjas....welcome to the Cherry Picking Nonsense Hall of Fame. There's plenty wrong with America's 72,000-page income tax code, which is used mostly by the 0.1% for 'legal' tax evasion (redistribution upward), but homosexuals are not the problem. What's really regressive is religious spite and bigotry.", "score": 7}, {"body": "You are wrong. According to the latest statistics, same-sex parented families earn approximately 10% less than their heterosexual counterparts. They suffer because of the lack of certain benefits, such as family insurance policies, family memberships and other perks.", "score": 1}, {"body": "You apparently haven't heard of \"the marriage penalty\". I recommend you read up on it.", "score": 2}, {"body": "I am just baffled that intelligent people still fight this battle upon what seems to me some truly irrational grounds. I'll leave aside religious beliefs, which are as varied and malleable as people want to make them  - and technically unprovable, but the notion (which I've heard repeated by very intelligent people) that marriage is the only word in the history of the world that is fixed, is just bonkers. That's doubly so because it is a legal word and legal words change all the time. Only slightly less irrational is the notion that gay people are so by choice. Are the attackers heterosexual by choice or do the genuinely feel something for the opposite sex?  There is a good chance I will root for the Republican candidate to beat Clinton or whoever is the Democrat nominee (but likely vote 3d party). Nevertheless, the conservative position is capable on its own of convincing independents and moderates that Republicans are too wrapped up in cultural dramas to lead the country, regardless of how bad a job Obama does by election time.", "score": 0}, {"body": "If you are so happy with a do nothing religious reich Republican Congress, and want their views empowered by a Republican President, be prepared to reap what you sow.", "score": 0}, {"body": "Mr. Kallam should have enough education to understand there are many religions and therefore many beliefs.  For him on his job to impose his own personal beliefs on all others and their religions is beyond comprehension.", "score": 19}, {"body": "Kallam stepped down from a position in which he no longer felt that he could, in good faith, perform what was required by law. So he didn't impose his beliefs on anyone.", "score": 0}, {"body": "Working great when it comes to taking rights away from women. Why not? By the time they're through we'll be executing people for sodomy again. ", "score": 5}, {"body": "The conversation is rapidly changing. Until very recently we were debating the fitness of the LGBT community for inclusion in the public sphere. Now we’re talking about the people who oppose equality, what motivates them, and what kind of character would do this mean-spirited thing to their fellow Americans. As the religious might say: “Hallelujah!”", "score": 7}, {"body": "Cherry-picking biblical verses to support one's social positions is an old game.  Leviticus 25:44-46 and other passages were once used to teach that Scripture supports the practice of slavery; now biblical scholars use other passages to teach that Biblical commentary on slavery should be seen as a product of the times. So it shall be some day with God's teaching about marriage.     ", "score": 23}, {"body": "Why our governments - federal, state, local - are still in the business of marriage is beyond me.  Governmental involvement with marriage and sanctioning relationships is an artifact from the days when Kings and Queens were head of both state and religion. The best course of action for those who object to gay marriage is to advocate for our governments to stop performing marriages and leave it to religious institutions.  Of course, this would mean a complete overhual of our tax code but that is long overdue as well.", "score": 56}, {"body": "So you instead advocate what, marriage no longer being a legal status with all of that entails: filing taxes together, making medical decisions (or in some cases even being able to be with your spouse if he/she is in the hospital), and many other things? Wouldn't that be a tremendous step backward for everyone?", "score": 0}, {"body": "On the contrary, sir. Considering that the marriage is legally just a binding contract establishing the mutual rights and duties and also what will happen in situations like divorce, inheritance, determination of next of kin for medical consent and so on, it´s the State (at whatever level) who has the right and not any self appointed cleric. Would you support a religious marriage stating that the man shall give all his income and property to his wife with no right to decide where or when to spend it, no legal rights over their progeny and no right to hold a bank account of his own? No? But why, it´s just the rule in their religion!", "score": 0}, {"body": "@Rick Hunose in Chatham: Actually, many of us in the religious \"business\" (i.e., clergy) think just the opposite. In much of the world the actual marriage (before or without religious ceremony) is a legal contract. The legal is necessary for all kinds of reasons having to do with finance and child protection; the religious is not, in the same way, necessary. Since the current system makes clergy instruments of the state (I have to sign the state's license when I officiate), many of us believe that the two should be separate. Let the state do a civil marriage consisting of the signing of the civil contract. Folks who desire a religious celebration/ceremony/rite can do it afterward. ", "score": 0}, {"body": "If you can't tell the difference between a contract and a religious rite, then perhaps you are unfit to hold an office that requires application and interpretation of the law anyway.", "score": 34}, {"body": "I think I get it. If I belong to the Americans for cultural purity, values, liberty and justice coalition, I have rights. The laws are written by man and the supreme court is not infallible. What God says, and how I interpret it is all that counts. God tells me that gays should not marry. He tells me that abortion is wrong in all circumstances. He spoke to me awhile ago and told me that interracial marriage was wrong. It doesn't matter what the law says, no one should eat meat on Friday, you should stone people for sins. How do I know? God told me. Rubbish. Thank goodness there's only one religion recognized in the US, and its god speaks thtough John G. Kallam Jr.", "score": 5}, {"body": "The attempt by anti-gay proponents to create 'opt-out' legislation that allows certain businesses to maintain discrimination is analogous the the Jim Crow laws passed after the South was defeated in 1864. In both cases the bigots lost their wars, but they are determined to perpetually remind others that their hatred still burns bright. ", "score": 16}, {"body": "The subject Clerk of this article doesn't even understand his own bible.  Sodom and Gomorrah was not about homosexuality, but about not being hospitable to visiting travelers.  Thumpers make up their own stories, discard the ones they don't like, and lord it over others as being better than everyone else.  We live in the land of the free -- not a theocracy of various religions.", "score": 15}, {"body": "Here's a thought: If public employees such as Mr. Kallam prefer to opt out of performing gay marriages, let them also opt out of the percentage of their salary that is paid by gay workers' tax dollars.  ", "score": 13}, {"body": "@ Steve in West Palm Beach - I LOVE IT !!!", "score": 0}, {"body": "Sorry, that's not good enough. They have to opt out of the percentage of their salaries paid for by the taxes of everyone who upholds the rule of law and the separation of church and state!", "score": 0}, {"body": "If I refuse to do what is required for my job, my employer will sack me.  I don't get to pick and choose those aspects I like and dislike.", "score": 6}, {"body": "What I don't understand about those who consider the Bible to be the ultimate authority is how they decide upon which verses to convey importance.  What about the prohibition against shellfish (Leviticus 11:10)?  Do they enjoy Shrimp Night at the local Red Lobster?  How about pork (Leviticus  11:7-8)?  Talk about unclean!!  Anyone giving up bacon?  OK, that's the Bible/Torah.  Want to look into New Testament?  How about the rest of the 1st Corinthians 6:9 quote:  \"Or do you not know that the unrighteous will not inherit the kingdom of God? Do not be deceived: neither the sexually immoral, nor idolaters, nor adulterers, nor men who practice homosexuality,...\"  See what's listed last?  Excluding adulterers from the ranks would surely limit the field of judges, politicians, etc.  Why is one part of a verse quoted, but not the rest?  I think we all know the answer.", "score": 16}, {"body": "OK, as a red-blooded American guy, why is MY gender singled out as denied the right to practice any kind of consensual sex I want? 1st Corinthians 6:9 discriminates against me and my pals. I'm confused, angry and -- yes -- just a little bit hurt by this.  Just sayin'. The New Testament has lost my vote!", "score": 1}, {"body": "I'm most confused by their apparent redefining of the size of camels and needle eyes.", "score": 0}, {"body": "I've always found it interesting that there appears to be no prohibition against lesbians.", "score": 3}, {"body": "Here's the difference and why fifty or a hundred years from now people will wonder why there ever was segregation in the United States, but still be strongly opposed to abortion, euthanasia and \"gay marriage.\" Racial prejudice and its practices were and are contrary to reason; whereas, the humanity and dignity of the unborn, of the sick and elderly, and the non-equivalence of anal intercourse and sexual intercourse will still be obvious to the majority of thinking human beings (as it is true today, despite judicial fiats). Only by the continual application of threats and civil power will these contrary to reality \"rights\" be maintained in society.", "score": 2}, {"body": "Bruce: Very rarely is an intelligent argument presented in favor of traditional marriage.  It goes far beyond the position portrayed by the Bible \"thumper\" typically trotted out.  Unfortunately, this is pretty much all that the media musters up.  Because the media covers issues it supports in a very specific way. The media doesn't want to delve into the deeper moral and ethical questions underlying the issues it considers \"settled\" and so it simply avoids going there. How else can you explain the media's fixation with demanding an answer to whether a candidate would support baking a gay wedding cake but ignoring the question of whether a candidate would support aborting an 8-pound baby?", "score": 2}, {"body": "AACNY - The definition of marriage has changed a lot over the years.  You might want to study a little history. The media points out correctly that marriage is a legal contract between two consenting adults.  For some people it is also a religious ceremony. If you want to be preached at go to church.  If  you want facts read a credible news source.", "score": 0}, {"body": "DR: Marriage is a \"sacrament.\"  You might want to educate yourself as to the significance of the word.  I suggest a credible source.", "score": 0}, {"body": "Mr. Kallam needs to to check whether he can comprehend what he reads. The story of Sodom and Gomorrah is about the sin of the abuse of power (rape). The story does not imply that consensual loving homosexual acts are sinful, but rather that rape of any type is contrary to God's teachings.", "score": 9}, {"body": "Unequal protection of the law by states seems to be the most sacrosanct feature of the world's most oxymonically named nation.", "score": 6}, {"body": "Sodom and Gomorrah is about rape not homosexuality.  Have Mr. Kallam reread the passage.", "score": 11}, {"body": "The emperor has no clothes.  And same-sex unions aren't marriages.", "score": 2}, {"body": "We'll see after the ruling.", "score": 0}, {"body": "Of course they are marriages. A marriage certificate is a civil document that confers all sorts of rights and priviledges to the parties involved. And civil rights should apply equally to all citizens. ", "score": 2}, {"body": "\" And same-sex unions aren't marriages.\" Of course they are. We changed the definition of marriage.  Didn't you get the memo?", "score": 5}, {"body": "It's good when people can meet their gay neighbors and see they're just like them. They want the same things out of life, someone to love, cherish, and grow old with. Maybe raise a family, maybe not. But what's really great is when they can figure this out without having to have a concrete example in front of them, having the empathy to realize this in the abstract, and act accordingly. ", "score": 10}, {"body": "Jesus never once mentioned gay relationships neither are they mentioned in the 10 commandments but yet that's the only take away from the Bible some Christians seem to have. They would get a measure of my respect if they instead focused on actual words Jesus spoke: \"And again I say unto you, It is easier for a camel to go through the eye of a needle, than for a rich man to enter into the kingdom of God.\" Of course this contradicts with their mission to lower taxes on the wealthy so it's doubtful you'll hear it mentioned.", "score": 15}, {"body": "It's a shame that a debate that directly impacts about three percent of Americans  is going to overshadow issues that affect the majority of Americans. I wish federal and state governments would get out of the marriage licensing business altogether so we could move onto other issues.", "score": 3}, {"body": "There's an easy solution for that.  Conservatives can stop poking their noses into other people's private lives.", "score": 3}, {"body": "And what percent of the population were slaves?  Where do we draw the line?  If it doesn't affect at least 51% of the population, then we can ignore it?", "score": 1}, {"body": "Even if your obviously low percentage was accurate (and it is NOT) that still means nearly 10,000,000 people.  No small number. How many people have to be included before you stop hating?", "score": 1}, {"body": "As a former devout Christian who has read the Bible from cover to cover THREE times, I am amazed at how people read the story about Sodom and Gomorrah--a story in which a LOT is happening sin-wise--and come away with the idea it is about God hating homosexuals. In this story, Lot even offers up his daughters to be raped with nary a blink of the eye from religious readers who strain at the gnats of homosexual lifestyle. Moreover, as another reader points out below, a scripture in the Bible later states, in very plain language, that Sodom and Gomorrah were destroyed for how they mistreated the poor and disenfranchised.  Of course that is straining at gnats of my own. The central point of the story is neither here nor there. These proponents of religious freedom fail (or refuse) to see the freedom of gay marriage doesn't affect them in the least, but their so-called \"religious freedom\" does prevent many of us from enjoying the liberties they take for granted. ", "score": 38}, {"body": "Dear Mr. Kallam: The Bible's Sodom and Gomorrah story also conspicuously failed to criticize Lot's daughters, when, after his wife died, they slept with their father and bore his children.  Are you good with that? Personally, I don't expect the Court to rule that all states must conduct gay marriages, but I do expect the Court to rule that states are free to conduct gay marriages and that all other states must recognize those marriages under the full faith and credit clause.", "score": 7}, {"body": "There can be no religious exemption if it  interferes with the functioning of the office, pure and simple. If the clerk in question is the only one who does marriages, he cannot claim an exemption, you cannot say \"well, just drive until you find someone who will\", it would be a clear violation of the equal protection clause to do so. If another clerk could do it, then that is fine, it is an allowable exemption. Especially in states like North Carolina, this could mean a same sex couple would have to be put out of there way to find someone to marry them, and that puts a major burden on them. Despite what the religious droolers believe, the first amendment does not outweight others or the rest of the constitution. And as the article points out, the real reason here is in trying to delay the inevitable, as the article shows, those who most strongly object to same sex marriage are dying out, the younger generations simply don't care. This is done more to be honest out of political theater, to highlight how 'people of faith' are under attack and the like, trying to carve out religious based bigotry as a right. ", "score": 8}, {"body": "I think it is important to salute the decision of John G. Kallam, Jr.  He resigned his position as county magistrate because his sense of his religion forbade him from carrying out his civil duties in that office.  He has the right not to participate in gay weddings, if he wishes, just as individual ministers and churches are free to make similar choices.   However people in such positions are NOT free to redefine the responsibilities of their jobs according to their private religious beliefs.  The American people and the courts have decided and/or are deciding this issue.  That makes it the law, no matter what you may think of it personally.   I applaud John G. Kallam Jr.'s decision and his recognition that he could no longer fulfill the civil duties and obligations of his job.  Such people who stand up for their beliefs at significant cost to themselves are to be admired, IMHO, whether I personally agree or disagree with their beliefs. ", "score": 5}, {"body": "If Mr. Kallam was seriously true to his religious beliefs, how can he in good faith work in any job dealing with people when he'd be serving convicted felons, child molesters, unwed mothers, thieves, and everyone's a sinner?  Is it only the sin of gayness that he abhors, but everyone else if ok?  Hypocracy much Mr. Kallam? ", "score": 1}, {"body": "As a rose by any other name is still a rose, defining bigotry as a religious belief doesn't alter the fact that it is still bigotry.  ", "score": 2}, {"body": "As with the ongoing undercutting of abortion rights through state legislation and legislative manipulation, so will these zealots find a way to chip away at same-sex marriage if and when the Supreme Court places its imprimatur on what should be the law of the land.", "score": 8}, {"body": "Public officials cannot refuse on religious grounds.  If they could, they could impose the requirements of their religion on all marriages, including forcing people to convert to their religion, not marrying people previously divorced, etc.  The fact that they don't do this but only refuse in this particular instance shows they are not doing this because of the tenets of their religion, but because of a personal preference.", "score": 22}, {"body": "It's called discrimination. ", "score": 1}, {"body": "Change is the norm....some states (South, Midwest) want to stop the clock on a number of social issues...the demographics mitigate against it....as time goes on some will hang on and continue to fight it...these fights will become less and less important as both younger and more diverse generations move into the workforce and positions of power....let's hope the ridiculousness of racism, sexism and gay hate become extinct.", "score": 4}, {"body": "You could have left out the parenthetical, and the meaning of your comment would have remained exactly the same - without needless generalizing.  I live in Minnesota.", "score": 1}, {"body": "I have travelled and lived in the midwest....it is not generalizing but based on experience.", "score": 0}, {"body": "John G. Kallam  Sr.  might not have liked it when people of colour were allowed to marry  white people.   And John G. Kallam's great grandfather  probably thought that women voting was against scripture teaching as well.  By the way,, it IS against scripture teachings.   But those same teachings are almost all old testament.  They are NOT Christ's teaching.  Some of those old testament teachings are barely Christian at all.  In fact,,, they were not Christian.  That is 4 to 6 thousand years ago. Ya know,,, we,,, all of us,,, learn,, grow,,, become better, stronger for it.  Tolerance.  Love thy neighbor, as thyself.     All your neighbors. Let's learn.    ", "score": 10}, {"body": "You've made a very good point. I learn or am exposed to thinking every day that never occurred to me before. Since I have no Christian background whatever it never occurred to me to draw a line between the New and Old Testaments of the Bible, but where does one end and the other pick up? If issues are not addressed in the New Testament, how doe a Christian decide which \"instructions\" of the OT are valid?. I have to say that I feel very luck that I don't care, but it is interesting.", "score": 2}, {"body": "I should have added that I think it unfair, Deanalfred, for you to denigrate Mr. Kallam's ancestors. That is rather unfair and intolerant, and shows a prejudice that puts your good points in jeopardy.", "score": 1}, {"body": "In fact, Mr. Kallam might not have liked it when white people were allowed to marry people of color, either. (It works both ways.) And, as DeanAlfred notes, many of the scriptural teachings that people cite are NOT Christ's teachings.  In fact, Jesus himself never said a word about same-sex relationships. Most of the arguments in the New Testament supporting slavery, the subjugation of women, and a number of other matters that decent people in the 21st century reject were promulgated by St. Paul, who notoriously suffered a nervous breakdown, did not think anyone, gay or straight, should get married, and boasted of the fact that, for whatever reason, he himself had never married. At least in 1 Corinthians 7:25, Paul states explicitly that the exhortation he is about to give to virgins is his own personal opinion, not Jesus', but people should take his word for it. In any event, no one whose diet likely includes the multiple abomination of bacon cheeseburgers has any business citing Old Testament scripture as a justification against other people getting married.  ", "score": 5}, {"body": "The evil of the cities of Sodom and Gomorrah was not sexual license but a turning away from God, who allowed Lot to talk him down from saving 50 righteous souls to 10. The issue was always an offshoot of the First Commandment: \"You shall have no other god than me.\" Christian fundamentalists have taken holy scripture and cast it into an unforgiving mold, molten with hate and self-righteousness. The Founding Fathers were wise on their ground and a true conservative shouldn't have a problem with Constitutional guarantees of civil protection. Unless, of course, they seek to impose injustice on the rest of us.", "score": 11}, {"body": "Slight correction.  It was Abraham who pleaded with God for mercy, not Lot. Lot offered to let the crowd gang-rape his daughters. It is not clear whether he asked his daughters what they thought of the idea.", "score": 1}, {"body": "Perhaps former magistrate John G. Kallam can now pursue a career in religious tent revivals rather than clogging up the courthouse with the teachings of his personal medieval religious textbook. It appears that the opening of this wonderful civil rights window for so many Americans is a dark day for many so-called 'religious' people. With 'religion' like that, who needs spite. misanthropy and ill will toward others ? ", "score": 108}, {"body": "Suppose a traditional couple shows up, and the groom sports a suit made of wool and linen? Would Mr. Kallam refuse to marry them as well? (Deuteronomy 22:11)", "score": 34}, {"body": "I would like to opt out of paying taxes that go to wars.  I would like to opt out of seeing people I don't like on public buses.  I would like to opt out of seeing gum stains on public sidewalks.  I would like to opt out of other people's ignorance and intolerance and hatred.  I can do none of this.  I live with it.  And I try to live with it with an open mind and heart.  And anyway, who would want to be married by such hateful people?  ", "score": 22}, {"body": "If we are to believe the New Testament, Christ would be appalled at the things that are said and done in his name.", "score": 22}, {"body": "Whether it be the Koran, Torah, or the Old Testament, our Constitution does not permit the imposition of religious doctrine on a free citizenry, no more than it allows unreasonable searches or the quartering of troops in private homes. The framers were well aware of the concept of \"tyranny by the majority\" which is why the Supreme Court exists as the final arbiter when the people speak, either by plebiscite or through their elected officials. Should the Supremes find that a right to marry exists in the Constitution, those who choose to ignore the ruling will of course cling to their bigotry by passing still more laws trying to legalize discrimination which are doomed to be struck down. Those who still feel that marriage equality should not be permitted are free to mount a campaign for a Constitutional Amendment.   Good luck with that.", "score": 11}, {"body": "What if \"tyranny by the majority\" represents the Supreme Court. Then what do we do?", "score": 0}, {"body": "The Bible is a holy book that is valid only for those who believe it is. The same is true for other holy books, such as the Koran, the Torah, and so many more that I cannot name for my ignorance. I am not ignorant, however, that there are other holy books and other religions. When your religious beliefs conflict with the civil society in which you live you have to find a way to live your life. Mr. Kallam did the right thing by resigning his position. I look forward to more such resignations so that we can put the job of the civil government in the hands of those who are willing to carry out the requirements of their positions. Good luck to  you Mr. Kallam in your future endeavors.", "score": 27}, {"body": "These are the same people who rant about the coming imposition of Sharia law in the United States. My advice to them:  be very careful when citing the Bible (especially the Old Testament) to manage your lives.  If you do so, you must be consistent in your observation of those laws.  You don't get to pick and choose which ones you get to follow, or else thinking people might accuse you of being a bit hypocritical.", "score": 29}, {"body": "Sure, opt-out of specific duties of your gov't job, and let your boss not do anything about it...until your boss's boss's boss, aka POTUS, fires you all for not doing your job, which he has the power to do. With no Unemployment Insurance approval, and no Food Stamps since folks in these states seem to hate on food stampers so much.", "score": 9}, {"body": "I find it strange the same people who cry freedom and liberty at the slightest hint of gun control legislation kick and scream when it comes to another's right to marry whomever they choose.", "score": 25}, {"body": "John G. Kallam Jr. seems not to understand his role as appointed county magistrate.  His role is to perform civil marriages - i.e. marriages recognized by the state.  The state is non-denominational; people have the same rights no matter their religion or lack thereof.  County magistrate is not a position from which to project your own personal religious convictions. It's disturbing to think that any civic official would be 'stunned' that when it comes to the rights of minorities, having 'the people speak' isn't the end of the matter.  I can only imagine his befuddlement at Brown v. Board of Education.", "score": 244}, {"body": "You must have read a different article. John Kallam's actions were entirely consistent with a full understanding of both his role as magistrate and his obligation as a member of his religious community. He recognized the conflict and removed it. John's actions were entirely consistent. You, much like the character referenced by your moniker, are conflicted perhaps out of the same kind of ignorance Sam experienced in his story.", "score": 0}, {"body": "I think not, Random Sample. The Lord God of Christianity, Judaism, and Islam is singular. That He created woman for man, and man for woman and NOT man for man, and woman for woman is not in doubt in any of these religions.  As for marrying atheists, as clear as God is about the sinfulness of homosexuality, He is equally clear that He has provided each of us with free will to continue on in sin, or turn to Him. It could be one encounter, one life experience (and often is) that turns a non-believer into a believer. No reason not to marry a man, and a woman whose faith is not yet fully formed... there's time. I would suggest to all that taking too much time is inadvisable. ", "score": 0}, {"body": "You know, I have to laugh at the adjectives so routinely thrown about by the \"Annies\" of the world. Words like intolerant (as if we can't tolerate the existence of sin when we know it's ALL AROUND us), and bigoted (with its implication that we find our beliefs superior), and homophobic (as if we fear homosexual behavior). Mr. Kallam's beliefs have God's Word as foundation. God's Word is clear that homosexuality is sin, and His Word is clear that Christians should turn away from sin, certainly NOT encourage it, or propagate it. He did the right thing by resigning, however, putting one's faith in God's Word exempts one from being bigoted, hateful, intolerant, or homophobic. People, for their own selfish purposes, can continue to label us with those incorrect adjectives, but it will always be a lie. God's Word speaks to the \"fallen\" sinfulness of mankind, those that choose to follow God rather than engage in that sinfulness are well aware of of what God describes in His Word will surround us on this planet. We are tolerant of it, and loving to all. ", "score": 0}, {"body": "Can you opt out of the Constitution?  That is basically what these people want to do.", "score": 27}, {"body": "Just wondering if anyone though that the majority opponents of same sex marriage are not opposing it because they want to discriminate against LGBT but rather calling it marriage in the first place- a word that they think has to be preserved for man-woman union only. I am wondering if we call LGBT marriage a \"civil bond/union\" instead would solve this issue all together. ", "score": 2}, {"body": "Civil unions exist but my understanding is that there are still some legal differences that prove to be important if one or the other dies or is hospitalized or can no longer make decisions. I believe that varies state by state and maybe even exists at the federal level (social security, medicare).", "score": 0}, {"body": "Let's be equitable and label ALL state-sanctioned marriages \"civil unions.\" \"Marriage\" would then be defined in religious terms, allowing each group of believers to define it as they chose. Makes sense to me. Some people don't even want to be married, though they do want to be \"bonded.\" In the end, though, marriage is so central to our culture that most people want to be recognized as worthy of that option. I don't think your suggestion is going anywhere. People have been making it for decades, but it hasn't gained traction.", "score": 1}, {"body": "Alas, no. Calling what has for years been called \"marriage\"  a \"civil bond/union\" when applied to LGBT couples who wish to unite and enjoy the benefits accorded to those heterosexuals who are \"married\" will not do. Calling that institution a \"civil bond/union\" smacks of second-class status for those so joined. For Christians who find the \"marriage\" issue a hard pill to swallow, if not an abomination there is no simple answer. Perhaps re-reading Matthew 7:1-5, Luke 18:9-14, and John 8:1-11, pondering the point of each and praying fervently will help.", "score": 4}, {"body": "The United States is a nation that believes the rights of all of its citizens should be protected. If you don't believe that, maybe the United States is not the nation for you.   Before you proceed, think before you secede!", "score": 6}, {"body": "Do 2 twin brothers have the right to have legal marriage?", "score": 0}, {"body": "John Smith, Thanks for the false debate (Fallacy of exclusive premises).", "score": 0}, {"body": "Mr. Kallam was right to resign from the role of a county magistrate if he is unable to separate his church beliefs from the government work he performs. He is wrong to impose his religious beliefs on others. ", "score": 15}, {"body": "This is a distraction stoked by those in power (and I don't mean the politician sock puppets) to keep working people from realizing how badly off and insecure they are financially, and how the country is circling the drain while the wealthy party. \"Look! Over there! Something you need to seriously get riled up about even though there's nothing you can do about it! Get indignant! Write op-ed pieces! Occupy yourself and family with this so we can continue looting the treasury!\"", "score": 10}, {"body": "Civil rights are not a distraction--they are part of the foundation of this country.  Unfortunately, being human, we are only slowly stumbling our way to making them a reality for all citizens.  Come on, most of us are able to take a stand for more than one cause at the same time.  I'm a long-time supporter of gay rights and gay marriage AND I'm someone deeply concerned about economic injustice at the same time.", "score": 1}, {"body": "Too bad some of the folks who believe the bible is the literal word of God fail to get the message. In Ezekiel Chapter 16, the \"sin \" of Sodom and Gomorrah was that those who had plenty were uncharitable to the least among them.  Their greed was their sin. Now, we have people who claim a  religious high ground and act in a spiritually  uncharitable manner toward others. What sort of thinking is involved in an \"opt out\" approach ?    Discrimination is discrimination no matter how it is sliced.", "score": 15}, {"body": "I'm sure the same cries against were heard in 1967 with Loving v. Virginia, the Supreme Court ruled that bans on interracial marriages are unconstitutional. These same \"christians\" pointed to their Bible justifying slavery, too. It's time for the religious wars to end. They are causing 95% of the misery in the world today as they have for the past 5,000 years.", "score": 14}, {"body": "You're correct.  NPR did a comparison of the arguments in Loving v. Virginia with some of the arguments used in court against same sex marriage and the similarity was very striking.", "score": 0}, {"body": "In Missouri we voted down the right to carry concealed weapons. It was the Missouri legislature that overrode the vote.  So I say tough... you can't always get what you want. Deal with it.  ", "score": 1}, {"body": "Let's keep religion & government separate. Perhaps the mistake is calling it marriage instead of civil union. Presumably the intent is to have the rights and benefits of marriage despite individual opinions of the definition and purpose  of marriage. Instead of everyone getting married why have civil unions across the board? ", "score": 3}, {"body": "I am sure there were a number of magistrates in Virginia that refused to marry interracial couples after the Loving vs VA decision a generation ago.   After they left someone more willing to follow the law stepped up.   Good riddance.", "score": 7}, {"body": "I know the polls say that young people are for gay marriage but I'm not witnessing that sentiment among my younger brother and his teenage buddies. They seem to view male homosexuality much like myself and buddies did 20 years ago, which is to say not favorably. Looks like there are pockets of resistance in the land even among the young. http://www.buzzfeed.com/davidmack/mcguffey-high-anti-gay-day#.wy25bjNl2G", "score": 1}, {"body": "I hate to break it to you but your family doesn't speak for the rest of the country. ", "score": 0}, {"body": "It's time to end the Special Privileges enjoyed by self proclaimed \"religious\" people.Churches don't pay taxes,therefore don't participate to the enhancement of the communities where they live. In too many cases the word \"Religion\" is an euphemism for Bigotry. To Use \"Sodom and Gomorrah\" as justification for discrimination is laughable in the 21st century.", "score": 14}, {"body": "I personally stopped being a church goer when I realized I was an atheist many years ago.  Nevertheless, I have to say that I know many religious people who do indeed enhance their communities because of the role that religion plays in their lives.  Yes, some religious people are bigots and/or are people who wish to impose their beliefs on others, but it most certainly is not true of all people who are religious and many churches do a great deal to help people who are poor or suffering.", "score": 0}, {"body": "I thought that the best statement of the issue was contained in this sentence from this article:  He describes himself as a Christian “who began to see that my faith is not an impediment to loving my neighbor.” The Second Great Commandment given to us by Christ is that we should love our neighbor.  For any Christian, that Commandment should supersede any and all other religious views.", "score": 9}, {"body": "Marriage as a union between two people as defined by government enables those people to share responsibilities, incomes, and expenses.  That is all we are talking about. As a 'sacrament' within a church it means much more.  If you belong to a church that allows gay marriage and don't agree with that, quit that church or petition to change the rule within your church --- That is IT nothing more - I am sick and  tired of the time and energy wasted by the press and politicians over a tiny minority of backward looking people.  And I ask them, as good christians: what about 'thou shalt not kill' - 'feed the hungry' - 'house the poor' - If you choose to follow religion in an 'a la carte' manner don't come to government to help you feel good about yourself - ", "score": 14}, {"body": "Would we go the other way? Make all personal contracts joining two people void. Marriage becomes a sacrament to some, and personal/private agreement to others. Make all citizens navigate all of life as single entities. Take away all legal connections between two people, such as participating in end of life decisions, the joint tenancy of property, joint tax filing, joint legal responsibility for offspring. Sounds cumbersome, doesn't it. Why cannot the Christian faithful get the point that marriage in a modern society is BOTH a contract between two adults AND a contract between the couple and all other legal entities in the country (government and companies and corporations). Let Christians and other religionists own whatever that sacrament means to them. Acknowledge that equal access under the law means EQUAL ACCESS UNDER THE LAW. Other than to biologically related adults, the marriage contract must be accessible to all adult couples.", "score": 10}, {"body": "Don't tar all Christians with the same brush.  Several denominations perform gay marriages and many Christians in those denominations that do not accept gay marriage and would approve of their church changing its position.", "score": 0}, {"body": "A reasonable strategy for opponents of gay marriage might be to admit defeat and to sue for peace. As a gay man, all I ask from them is tolerance---not \"acceptance\". American society has already accepted me and as far as I am concerned it is time to move on.", "score": 6}, {"body": "Didn't the Confederates states already try opting out from federal law?  How did that turn out?", "score": 13}, {"body": "The conflicting views expressed by Kristina Bailey are reflective of what happens when an abstract assessment collides with an immediate experience.  The same thing has happened with views about abortion: it may seem unpalatable, but when you know someone going through the experience, your view becomes more nuanced.  And that is how attitudes about same-sex marriage will change, too. ", "score": 8}, {"body": "“As more couples marry, more people will know people who are married,” said Michael J. Klarman, a legal historian at the Harvard Law School and author of a 2012 book on earlier gay marriage rulings. “And those who oppose it will find out that the sky doesn’t fall.”  Maybe the sky will not fall.  But it will sink, slowly but surely.  A child who is not reared by his biological father married to his biological mother is more likely to end up in a single-parent household.  A single parent household is more likely to depend on government handouts.   Gay marriage and child rearing will promote the growth of our collectivist, confiscatory, coercive government.", "score": 2}, {"body": "Cite your sources please.", "score": 1}, {"body": "Sherman, do you think that adopted children are more likely to end of in single-parent households?   ", "score": 2}, {"body": "Sherman , Where did you learn your logic? Slippery slope straight off a cliff.  The sky will definitely fall when we don't address real issues like inequality and global warming not fictitious ones that you are spouting.  ", "score": 5}, {"body": "\"What God thinks\" is a moving goalpost, depending on your religion and its particular denomination. Dozens of Christian religions, including Presbyterian, Quaker and Episcopalian perform same sex marriages, and quite a few synagogues too, so there is no rational way all these conflicting gods can be one and the same entity.  It follows therefore that religion is a designer product at best and bastion of judgmental hatred at worst.", "score": 13}, {"body": "The Equal Protection Clause may not apply to private actors like bake shops, but it does apply to state actors, like county clerks.  For a state official to refuse to marry a couple because of race or sexual orientation would violate the Equal Protection Clause. ", "score": 9}, {"body": "Logically I still can't wrap my mind around why some people, mostly religious people, are so opposed to gay marriages. Religion and gay marriage are not mutually exclusive. Homosexuality has always existed, and now days gay couples do in fact legally marry. Similarly, religion has always existed, church attendance still occurs, and is in fact protected by law. So gays get married in civil ceremonies, and churches, whether they allow gay congregation members or not, go on holding services; the one does not interfere with or impede the other, and the world simply goes on undisrupted. If some gay person doesn't want to go to church, no harm done. Similarly, if a church doesn't want gay congregation members, or to perform a gay marriage ceremony, again, no harm done. The legality issue is another issue altogether. Churches are protected by the constitution. Gay citizens in America are gaining ground in terms of civil rights, but more legislation is still required before real parity becomes law, which must be realized to avoid a separate but equal violation of the fourteenth amendment.", "score": 3}, {"body": "One person's civil rights cannot be subject to the next person's distaste.  It's time for equal rights for everyone, everywhere. ", "score": 34}, {"body": "So personal proclivity (and no, you weren't born a Christian) trumps equal treatment by society? Then what is \"the rule of law\" that you Conservatives are always crowing about? ", "score": 18}, {"body": "Andhra pradesh is one of the most vital education boards of India. The students who need to check the AP SSC results 2015 they recommend to login the suitable website and the website help to get the AP inter 1st year results roll number wise, name wise. To obtain the AP inter 2nd year results, students suggested to log on the website and they need to click the suitable link, after that they requested to open a new tab. Secondly, they need to enter the hall ticket number in the blank box, it is the main factor to get the AP SSC results 2015 result.   Assam board is also one the board which release its results in May 2015. Assam SEBA HSLC results 2015 and Assam HS results 2015 are usually released in May 2015. So You would be able to google and search for the results.", "score": 0}, {"body": "\"Sodom and Gomorrah, that story alone tells you what God thinks of same-sex marriage,\"  Mr. Kallam said.  \"God said that homosexual behavior is a sin and that marriage is between a man and a woman.” I am very tired of reading quotations like the above.  The story of Sodom and Gomorrah indeed tells the story of sin, but not of homosexuality.  The Bible itself refers to the story as depicting the sin of inhospitality.  The Prophet Isaiah, in Chapt. 1, condemns Judah, likening it unto Sodom.  However, he accuses Judah of rebelling against and deserting the Lord, of being ignorant, of being unjust and oppressive to others, of engaging in idolatry and meaningless religious ritual, of committing murder, of being insensitive to the needs of widows and orphans, etc.  No where is there mention of homosexual activities!  Jeremiah 23:14 reads:  \"among the prophets of Jerusalem I have seen something horrible: They commit adultery and live a lie. They strengthen the hands of evildoers, so that no one turns from his wickedness. They are all like Sodom to me; the people of Jerusalem are like Gomorrah.\"  Note that he talks about adultery and lying.  Homosexual activity is not mentioned.   In Matthew 10:15 Jesus states “Truly, I tell you, it will be more tolerable for the land of Sodom and Gomorrah on the day of judgment than for that town.”  The implication is that the people of Sodom were inhospitable.", "score": 43}, {"body": "Moses took the name of God in vain to issue his ten commandments, evidently hoping to close the door behind him with the commandment not to take God's name in vain, which really means not to purport to speak for God at all ever.", "score": 0}, {"body": "I'm sorry but your reading of that passage sounds like the entire Republican party to me.", "score": 6}, {"body": "@M E R - I'm sorry, but I don't get your meaning.  You seem to be criticizing Rev. Jim Bridges--for pointing out that the Biblical references to Sodom and Gomorrah, frequently used to condemn homosexuality, do no such thing.  In what way does his \"reading of that passage sound like the entire Republican party\"?", "score": 0}, {"body": "Well, hey, I think I'll no longer pay that portion of my taxes that go towards the military and national security departments of the government, since these agencies of death and deceit violate the very core of my religious beliefs in brotherhood and peace.  ", "score": 142}, {"body": "No matter how they try to \"frame\" it, the main mission here seems to be mean-spiritedness.  At its core, the purpose is to be \"against\" people, even if they try to persuade themselves otherwise.  I imagine that at long last, this opposition is painted into a corner.  I am sure it will not be pretty as they continue to lash out (like Mike Pence.)", "score": 38}, {"body": "Ever since the US put itself \"under God\", people have resorted to God to put themselves above the law.", "score": 1}, {"body": "What happens if SCOTUS doesn't rule as expected? Seems to me Kennedy would have to contradict himself in order to vote yes.", "score": 1}, {"body": ">> Seems to me Kennedy would have to contradict himself in order to vote yes True.  But has the Supreme Court ever truly worries about contradicting itself?", "score": 0}, {"body": "Quoting Kristina Bailey: \"I don't want to force my religious views on someone else. If I can prevent people from marrying who they want, they might prevent me from going to the church I want\". May God bless Kristina for this beautiful thought. Tolerance in any form is way too rare these days. If more people thought, and lived, like Kristina, the world wound be a much better place. ", "score": 55}, {"body": "As long as \"exercise of religion\" means \"worship\" there is no conflict between the free exercise clause and the establishment clause in the first amendment.", "score": 0}, {"body": "“I don’t want to force my religious views on someone else,” said Kristina Bailey. That's really the crux of the matter. Many other opponents of same-sex marriage, as well as those who want things like the 10 commandments and nativity scenes in public places, DO want to force their religious views on others. It makes you wonder if they've ever studied about our founding fathers or heard about the U.S. Constitution.  There are many evils in the world, and there are many sinners, too. Attempting to shun LGBT people is such a waste of time and energy. Give it up, already.", "score": 310}, {"body": "If only more Americans were educated about the Catholic/Protestant divide that took place in the 16th century in Europe, and in particular, England.  If they understood the tyranny of the state in establishing a religion, and the extreme violence that ensued as a result, they would understand the origins of our own Constitution.", "score": 0}, {"body": "It is about evangelizing.  These people feel they have the right to try and force their interpretation of their scriptures on others.  We do have freedom of religion in this country but more importantly we have freedom from others religion.  Unfortunately, these people do not like to be told this.", "score": 0}, {"body": "As a closeted young gay man, it is a breath of fresh air to see that people all over the United States are beginning to tolerate/accept my lifestyle. I'm just like anybody out there. So thank you if you have in any way supported or collaborated towards achieving a more accepting world. It makes me very happy to see great articles like this one printed on the New York Times. You have no idea the world of difference it is to count with your support.", "score": 101}, {"body": "Micheal, What makes you so special? Do I get to write laws that deny who you are? You can think anything you want, you don't get to push your intolerance on others through unjust laws.  I am sorry but I thought we were living in American with the land of the free or is that right reserved for only you because you have convinced yourself that you are soo special. Nothing special about denying others what you want just for yourself!", "score": 4}, {"body": "Homosexuality is not a \"lifestyle\". One chooses a lifestyle, one does not choose one's sexual orientation. Not all homosexuals live the same lifestyle anymore than all heterosexuals live the same lifestyle. ", "score": 2}, {"body": "Always be true to yourself, and if others don't like it, that's their problem.", "score": 2}, {"body": "Mr. Kallam really needs to read his Bible more. The sin of Sodom was never homosexuality. Ezekiel 16:49. ", "score": 90}, {"body": "Hear, hear! If only this were taught as passionately in America as the prevailing interepretation...", "score": 0}, {"body": "If you feel compelled to \"opt out\" of ANY of your duties as a government official, then opt out of your job COMPLETELY by quitting it.  Such opt out provisions could lead a de facto ban on gay marriage if ALL officials in a state chose to opt out.   ", "score": 42}, {"body": "Paul, There are plenty of people who would love this job and if you can't find any decent strait people,  I am sure that there are many gay and lesbians who live in that state that are looking for a steady job.  Who needs the haters, let them share their narrow minded views with each other in a van down by the river.  ", "score": 0}, {"body": "I suppose this means that Mr. Kallam and people who share his beliefs and \"logic\" can't pursue many professions or businesses. Can't own or manage a restaurant because they would be forced to serve gluttons. Can't own or manage a hotel because they would have to provide rooms to the lustful and adulterers.  If they own a business that is wildly profittable haven't they themselves become a victim of greed or by selling the goods so wildly coveted by their customers they have enabled the greedy in their sin? Could their business accept food stamps since after all those on assistance must be slothful.", "score": 65}, {"body": "It seems to me that the religious beliefs of some hold sway over the rights, provided under the Constitution, of equal protection under the law.  \"In Greensboro, a city of 280,000 and the seat of Guilford County, Jeff L. Thigpen is the elected register of deeds, whose office issues marriage licenses. He describes himself as a Christian “who began to see that my faith is not an impediment to loving my neighbor.” \" The separation of church and state is an essential part of our Democracy, and the wish to deny the rights of others based on faith is not what I would think would be a sound Christian doctrine. \"An appointed county magistrate, Mr. Kallam was obligated to perform civil marriages whether they were same-sex or not. So he resigned, one of six in the state who stepped down to avoid violating their faith.\" As the magistrates in North Carolina and in other states, it is legal and right that they work under the law. If they prefer to resign that is their right. As Tom points out, public officials are elected to serve all of the public, not simply the heterosexual community. This kind of belief is essentially a re-kindling of segregation laws. ", "score": 44}, {"body": "I think that the key issue here is that these are CIVIL marriages proceedings, not religious ceremonies.  Nobody's asking churches or other houses of worship to compromise their beliefs. Our concerns are with civil laws and public businesses where obligations differ. This isn't a difficult concept: church and state are different spheres.", "score": 0}, {"body": "An employer (including the state) must accommodate an employee's religious beliefs and practices if (and only if) this can be accommodated without a real impact on the job.  If someone is hired to perform marriages by the state and this is objected to on religious grounds, the state had better be sure that there are other qualified employees who can do the job.  If not (and no, making the couple travel to find an alternative is not reasonable), the person who objects needs to leave that post.  It's wrong to take a job that you are not willing to do and then insist that the employer just stop doing the parts of it that offend you.  I'd think conservatives would be among the first to insist on this.  Good grief!", "score": 85}, {"body": "@dagwood- That is exactly right. Courts have held that employees religious rights should be taken into account, as long as it doesn't impose a burden on the functioning of the business or agency. If a pharmacist refuses to dispense the morning after pill or birth control,his/her employer if for example another pharmacist can do it, should accomodate that. But if the pharmacist is the only one on duty, then he/she cannot claim religious belief,because they would be denying their boss the right to do business. With government functionaries, if there is another person on duty who can do same sex weddings, then fine, it will be okay to opt out, but if you are the only one and you object, there is no case there, because by opting out they would be denying same sex couples the right to be wed by a state employee, it would be a violation of the equal protection clause because they would be offering a government benefit to one type of person and not another. And all you have to ask yourself, if the clerk refused to marry Moslems or Jews or other non Christians, or atheists, would he be allowed to claim that right?", "score": 3}, {"body": "the best way to opt of the scope of the Constitution, more specifically the 14th amendment, is to give up your citizenship and move to some place that doesn't recognize the rights of gay people to marry.  Uganda might work. ", "score": 67}, {"body": "The notion that the  authors of the 14th amendment written in the 19th century, intended for the law to be used to allow same sec marriage is just absurd.", "score": 1}, {"body": "Ed, I assume you are then ok with the government constantly searching and surveilling your computer and phone? Because I know that the authors of the 4th Amendment didn't intend to protect those from searches and seizures either. ", "score": 0}, {"body": "How about the moon landing? Personal computers? Vaccines against disease? Atomic energy? Those probably would have sounded pretty absurd to them, too.", "score": 0}, {"body": "The problem with the bill in North Carolina is that public officials are elected or appointed to serve all the public, not just the heterosexual public.  They are paid with public tax dollars from all the public.  The Senate president, Phil Berger, is abrogating his duty and oath of office to serve all the public, not just the parts he agrees with.  Rather, if there are public officials who do not want to issue licenses or perform civil marriage ceremonies, they  should resign for the good of their conscience and not continue to be a burden to the taxpayer and the public.  As to churches, they are now and always have been able to marry or not marry any couple in their church.  There are no laws forcing a church to marry someone ", "score": 431}, {"body": "Re: \"problem with the bill in North Carolina is that public officials are elected or appointed to serve all the public, not just the heterosexual public.\" And, not just the 'religious public' either!", "score": 8}, {"body": "Bam!  Spot on exactly correct. Well said, Tom.", "score": 2}, {"body": "\"if there are public officials who do not want to issue licenses or perform civil marriage ceremonies, they should resign for the good of their conscience and not continue to be a burden to the taxpayer and the public.\" You are exactly right. And Mr. Kallam, the former county magistrate mentioned in the article, was right to step down. If they can't, in good conscience, be practicing Americans then they should withdraw from public service. In that way they do themselves and the rest of us a big favor.", "score": 5}, {"body": "God and the Bible may say one thing (and this is in dispute as well), but we live under civil, not religious, laws.  Freedom to practice your religion does not include the freedom to discriminate against another citizen.  A conflict we have in our society - how does one abide by civil law when they believe that biblical law is the highest of all authorities? The Framers took care of this one for us: by separating matters of state and religion.", "score": 572}, {"body": "\"Good fences make good neighbors.\" Robert Frost in \"Mending Wall\"", "score": 2}, {"body": "Not abiding civil law because you believe biblical law is the highest of all authorities? Thats called being a traitor to your country.", "score": 7}, {"body": "Nowhere in the Old Testament is there a prohibition against gay marriage. Now it does say that men should not lie together as they do with women, but that has nothing to do with being married. If there is anything that will tend to limit frequency of sex, it is marriage. I believe that those who oppose gay sex are encouraging promiscuity. And that is wrong.", "score": 4}, {"body": "It's ridiculous how opponents of same-sex marriage have begun casting themselves as victims, now that they have suddenly found themselves on the losing side. They complain that they are \"forced\" to serve same-sex couples or \"forced\" to leave their jobs, and they resent being labeled as bigots. But unfortunately for them, the US Constitution demands equal treatment before the law. If they choose to exercise their religious freedom and deny a public good or service to a group of people, then they must stop providing those goods or services to everyone. When you're in the public sphere, you cannot pick and choose who to serve for any reason, religious or otherwise. It's really quite simple: they can follow the law and serve everyone or follow their religion and find another job. They have that choice; no one is \"forcing\" anyone to do anything but obey the law.", "score": 518}, {"body": "Hey College Professor, try joining a country club if you don't meet their requirements.", "score": 0}, {"body": "Speaking of infamous adulterers, how's your friend Newt Gingrich these days? Posts like yours make it clear that your arguments are not religious or moral but explicitly and entirely political.", "score": 0}, {"body": "kkurtz: Irrespective of what religion(s) the Founding Fathers may or may not have practiced, they got it right when they put religion in its correct place by separating Church and State and putting the State first, i.e., the State is in control.  Including \"under God\" in a State-sanctioned pledge violates this separation.", "score": 0}, {"body": "“I was happy for them at a personal level,” Ms. Bailey said. “I don’t want to force my religious views on someone else,” she said. “If they can prevent people from marrying who they want, they can keep me from going to the church I want.” Ms. Bailey is the example for ALL Christians who, because of Democracy, get to attend the Church of their choice!  Thank you, Ms. Bailey, for your integrity. Scott E. Torquato, MS, LCSW", "score": 115}, {"body": "I agree. Most of this hate towards gays stems for ignorance. How would these \"Christians\" feel if someone tried to impose another religion on them? ", "score": 2}, {"body": "No comparison to interracial marriage at all. Homosexual relationships are a lifestyle choice while marriage between men and women of different creeds or color are still marriage. The gay lobby may have won some short term gains by forcing the concept of marriage onto their relationships, but they would have been better off calling it a unique name such as a civil union or similar union of two adults. By forcing everyone else to change marriage between a man and a woman with the potential for procreation in principal, they will simply alienate all those around them. ", "score": 5}, {"body": "You talk about the Gay Lobby but what about the Christian Lobby which is trying to force their narrow minded and hate filled views on the rest of us.  I don't see the gay and lesbian alliance trying to take away my rights but I don see the religious right trying to control the actions of those they like to demean.  Everyone has the right to marry the person of their choice - Why does your belief in a Parental figure in the Sky makes you think you have the right to control the action of others? You might need someone to tell you how to live but that doesn't mean you get to tell others how to live. If you want basic rights taken from citizens of the united states then you should have to give up your rights as well.   That means no marriage for anyone especially those who will just pass intolerance and hate to their progeny.  ", "score": 18}, {"body": "Do you know anyone who is gay? Do you know any same-sex couples? I have lots of gay friends, and I know three things about them. (1) Gay people do not choose to be gay. They have to choose how to deal with their orientation, but the orientation is not a choice -- just like with straight people. (2) Gay people are attracted to members of the same sex in the same ways straight people are attracted to members of the opposite sex. This attraction can take many forms -- including the desire to commit to one special person. (3) Gay people are just as capable of forming loving, committed relationships as straight people are. Gay people find their complement -- their significant other, their better half, the one who completes them -- in a member of the same sex, and (this is important) can find their complement ONLY in a member of the same sex. This is what's at the core of a person orientation -- who you love. If you'd bother to get to know the gay men and lesbians in your community, I bet your opposition to same-sex marriage would evaporate pretty quick. Open your mind and open your heart.", "score": 17}, {"body": "Civil marriage is civil marriage.  It has no bearing on your concept of religious marriage or procreation, and no one is being forced into a same-sex marriage.  How is a gay couple's civil marriage \"forcing everyone else to change marriage\"?  It is a nonsensical argument.  If you don't want a gay marriage, don't have one and let your neighbors live their own lives!", "score": 7}, {"body": "The story in Sodom and Gomorrah is about a mob of straight married men who want to rape two strangers (who are actually angels) in order to show them that they are not welcome.  They settle for raping virgin females instead.  Elsewhere, the Bible clearly says that the sin of Sodom was greed and failure to care for the poor.  Wish these people actually read the Bible instead of just toting it around to hit people over the head with it.", "score": 336}, {"body": "great point - knowing what the bible actually says, never mind understanding the point of a particular story in it, has never been a prerequisite to using to justify any kind of bigotry, intolerance, or just plain old imposing your beliefs on others.  ", "score": 6}, {"body": "Michael F - The bible makes it very clear that divorce is wrong.  Do you spend this much time chastising divorced people?", "score": 10}, {"body": "Micheal, Why do you think we should deny rights to citizens of the United States based on what some guy wrote a long time ago about his bigotry.  Do you even know who wrote the bible?  Hint - it wasn't a made up figure from the sky but a human being with a lot of problems.", "score": 12}, {"body": "While Mr Kallam carries a bible wherever he goes, he obviously doesn't read it. The Sodom and Gomorrah story is about gang rape, not consensual homosexual sex. And the only other place homosexuality is mentioned in the bible is Leviticus, which includes a lot of rules that I'm pretty sure  Mr Kallam doesn't follow, for example the prohibition against eating non-kosher meats like pig.", "score": 445}, {"body": "I could see how you thought that, but actually there were a couple errors in how you defined what the Bible was talking about. I don't want to really get into Sodom and Gomorrah, but if you read Genesis 19 you can see that homosexuality was really the center of it.      As for Leviticus, it is a really interesting book which describes laws for numerous circumstances, theologically divided into ceremonial laws for the priesthood of Israel (ex. ceremonial cleansing), civic laws for the people of Israel (ex. \"keeping kosther\"), and lastly moral laws (ex. Ten commandmants). As a Christian, Christ's death, burial, and resurrection in my place took the punishment and judgement by God for my inability to follow the law.  I'm sorry I'm trying to keep this short! =}      The main point of the law was to show us that we as humanity are not able to live up to God's standards of holiness- which Jesus states even more clearly during the Sermon on the Mount (Matthew Ch. 5, New Testament). This points to our need of a savior.      Now, through Christ's death in my place I'm not bound by the Law, and an in depth study can point to multiple references that explain this. However; with that said -all- of the moral laws from the Old Testament are mirrored in the New Testament, while the ceremonial and civic ones are not. While there are multiple verses in the NT that talk about homosexuality, a key passage is found at the beginning of Romans (Rom. 1:26-27) among other places. -Continued", "score": 0}, {"body": "Did you leave Paul's Epistle to the Romans out of your Bible. Check out chapter 1 verse 27.  Pretty clear in any translation.", "score": 0}, {"body": "Which version of which adaptation of which translation of the Old Testament are you quoting, Lizabeth?", "score": 0}, {"body": "I wonder if Mr. Kallam and his ilk are stoning non-virgin brides to death and keeping Hebrew slaves for 'only six years' as the bible also instructs.", "score": 188}, {"body": "Don't forget Deuteronomy also forbids indoor plumbing! The Bible gives clear instructions on how to do a bowel movement and it clearly states you must go OUTSIDE your camp.", "score": 14}, {"body": "And don't forget, MEH, stoning disobedient sons, keeping milk and meet separate, and keeping all kinds of things separate, like linen and silk, cotton and wool.   Personally, I prefer to follow the Jesus who sat down to eat with tax collectors, and praised the Samaritan who, unlike the temple folk who preceded him, stopped to help the injured man, the Jesus who defended the woman caught in adultery, and who said \"Let him who is without sin among you cast the first stone.\".", "score": 16}, {"body": "In other words, *actual* Jesus.", "score": 2}, {"body": "These people seem unable to grasp that this is not a biblical issue; it's a Constitutional issue.", "score": 197}, {"body": "Assuming the Supremes make it the law of the land (not really the slam-dunk people would have you believe), some will continue to fight it, proving Einstein's theory that insanity is doing the same thing over and over and expecting different results.  Half a century ago, these same people (or their parents) were adamant about not serving blacks or allowing their children into their all-white schools despite desegregation. Hate dies slowly, especially when couched in religion. ", "score": 150}, {"body": "too many people turn religion into hate", "score": 2}, {"body": "@mtrav - Yes.  As an example, witness ISIS and its ilk murdering even those of their own religion but a different sect.  Absolute insanity.", "score": 2}, {"body": "The North Carolina official who resigned rather than participate in same sex marriages acted correctly.  A public official whose private beliefs conflict with his legal duty should do the honorable thing and resign his office.   If I'm not mistaken, Chief Justice Moore of Alabama, who has been resisting a federal court decision overturning his state's ban on same sex marriage, was involved years ago in a similar controversy.  A federal court ordered a monument displaying the Ten Commandments removed from a courthouse.  He refused to allow it.  Unfortunately, he was (and is) not honorable enough to admit that a public official whose private beliefs conflict with the oath of office he took should resign his office.  He should have resigned then and should resign now.", "score": 95}, {"body": "Using that logic about private beliefs and public responsibility says that before 3 years ago 60-70% of public officials should have resigned. Public responsibility more than 3 years ago did not support this issue which is the currently popular topic supported by a very small but powerful lobby.  ", "score": 2}, {"body": "A magistrate issues a secular government marriage license.   It is not produced by God. If that magistrate is to be excused from his duties due to his religious beliefs then I want to be excused from the obligation to obtain a license - due also to my deeply held beliefs that my marriage status and to whom is none of the government's business.", "score": 41}, {"body": "Opt out hooey.  Opt in for discrimination. Do people really have so much time on their hands that they can worry about the choices that other American citizens choose to make?  Personally, I have enough on my plate just worrying about what I need to do in my own life.", "score": 38}, {"body": "For those people who hide their bigotry behind their Christian God, I would just like to say that maybe their God just doesn’t care.  If the Christian God cared, why has same-sex marriage been legal in Canada for 10 years?  And why is same-sex marriage legal in Argentina?  Why is same-sex marriage legal in France?  Why is same-sex marriage legal in the Netherlands?  I could go on, but I think the point is made. ", "score": 43}, {"body": "Maybe their Christian God believes bigotry is worse than homosexuality. \"And now these three remain: faith, hope and love. But the greatest of these is love.\"", "score": 6}, {"body": "If this guy Kallam or anyone else can't do his job, he steps down or gets fired. That's his choice. But he has no right to impose his religion on anyone else. Seems fairly straightforward. I'm not sure why the religious conservatives think they can impose their religious beliefs on everyone else. Glad the guy stepped down and hope he can find something more appropriate to do that doesn't impose on others", "score": 123}, {"body": "By extension, the argument that religious beliefs allows pharmacists to not sell Plan B or contraceptives holds no validity if the arguments presented about same sex marriage hold true; same for corporations withholding birth control from the health care benefits for female employees.  A person's (or corporation's (laughable)) religious beliefs have no standing if that person or corporation serves or interacts with the public.  Under the law we are all equal, we all have to follow the law. ", "score": 11}, {"body": "Change \"same-sex\" to \"interracial,\" turn the clock back 50 years (maybe less) and the NYT could have written substantively identical stories about North Carolinians and others who opposed changes to marriage laws on the grounds that their God and their Bible forbade such unions.  We didn't \"accommodate\" such deeply-held religious convictions then, nor should we now.  (And before others in this forum argue that marriage has always been between \"one man and one woman.\" I invite you to review your Old Testament.  Therein you will find that God was at one time very comfortable with polygamy--or so the men who formed his priesthood concluded.)", "score": 172}, {"body": "Yes, it is less - 48 years ago in America, Justice Thomas's own inter-racial marriage would have been illegal in many States. And now he gets to 'vote' on mine. Hmmm ...", "score": 13}, {"body": "Michael, Your argument makes no sense.  They are trying to change the definition to include everyone.  That is what civil rights is about giving everyone equal rights.  If you can marry and I can't in what universe is that equal?", "score": 9}, {"body": "\"Both a heterosexual man and a homosexual man had exactly the same rights regarding marriage.\" Uh, no.  When same sex marriage is forbidden, a heterosexual man may marry the person for whom he feels love and with whom he wishes to build a life.  The homosexual man is forbidden to do exactly that.  How is that having \"exactly the same rights regarding marriage\"?", "score": 6}, {"body": "There is something deeply solipsistic and mean-spirited in claiming a right for oneself that one cannot extend to others, at no personal cost whatsoever. Biblical literalists are, of course, free to pick and choose which biblical passages they owe allegiance to (and certainly none obey all), but what is the moral authority for imposing their eccentric beliefs on others? We are citizens of a democracy, not a theocracy.", "score": 240}, {"body": "Susan--you write beautifully. I had to go look up solipsistic--great term. ", "score": 5}, {"body": "Arent there more pressing issues for a Christian? Like poverty? Greed? Not to forget the kind of seafood that is also forbidden according to the bible, Leviticus 11:10?", "score": 197}, {"body": "It is a challenge, how can someone continue to be able to hate and discriminate based upon their religion in a country that says religion takes a back seat to everyone's Constitutional rights of equality (which will soon include marriage)?", "score": 19}, {"body": "But for many of these people, their Bible [or whatever religious text] supersedes the Constitution.", "score": 5}, {"body": "Roger, When did the United States become a Theocracy?  We see how well that system of government works for the enrichment of all citizens in the middle east and elsewhere.", "score": 7}, {"body": "Unfortunately even after same sex marriage becomes the law of the land it will still be legal in many states to discriminate against LGBT people in employment and housing. The struggle continues!", "score": 67}, {"body": "Michael F - Here are some protected classes:  race, religion, sex & national origin.  So, a white, Christian male of U.S. decent is of a protected class (he can't be fired based upon any one of those traits)... but a gay person isn't.   ", "score": 5}, {"body": "Oh DR I give people the right to choose whether they wish to deal with me at all. The question why would the government care and why do they care regarding homosexuals. There are no economic disparities. ", "score": 0}, {"body": "Yes, there are economic disparities. Marriage holds tax advantages in many constituencies as well as better prices for healthcare plans. There´s also the issue of inheritance, as without a marriage the next of kin (i.e. the homophobic relative) might dispute the last will and testament on the ground of being the rightful heir of a single man.", "score": 2}, {"body": "Resistance to change is expected - look at the blowback after Brown vs Board of Education. 20 years on, we will look back and wonder what all the fuss was about!", "score": 27}, {"body": "The same sex marriage which is before the SCOTUS is the CIVIL marriage and should not be confused with your Bible's \"sacrament\" of marriage. Best Christians stop attempting to turn our civil laws into their sacraments or they'll soon end up with a \"Sacrament of Divorce\"!", "score": 106}, {"body": "And just to clarify, not all Christians consider marriage a sacrament.  For Lutherans, like me, there are two sacraments, Baptism and the Eucharist.", "score": 6}, {"body": "It  is a sad thing when people use their ignorance of the Holy Bible to judge other people.  These Christians probably would never want to take responsibility for their false-beliefs but all the gay and lesbian bullying, suicides, family break-ups and more can be traced to Christians using a book that should bring us closer to God and to each other to wound others.", "score": 43}]